{
  "id": "USN-3718-1",
  "summary": "linux, linux-aws, linux-azure, linux-gcp, linux-kvm, linux-oem regression",
  "details": "USN-3695-1 fixed vulnerabilities in the Linux kernel for Ubuntu 18.04\nLTS. Unfortunately, the fix for CVE-2018-1108 introduced a regression\nwhere insufficient early entropy prevented services from starting,\nleading in some situations to a failure to boot, This update addresses\nthe issue.\n\nWe apologize for the inconvenience.\n\nOriginal advisory details:\n\n Jann Horn discovered that the Linux kernel's implementation of random\n seed data reported that it was in a ready state before it had gathered\n sufficient entropy. An attacker could use this to expose sensitive\n information. (CVE-2018-1108)\n\n Wen Xu discovered that the ext4 file system implementation in the Linux\n kernel did not properly initialize the crc32c checksum driver. A local\n attacker could use this to cause a denial of service (system crash).\n (CVE-2018-1094)\n\n It was discovered that the cdrom driver in the Linux kernel contained an\n incorrect bounds check. A local attacker could use this to expose sensitive\n information (kernel memory). (CVE-2018-10940)\n\n Wen Xu discovered that the ext4 file system implementation in the Linux\n kernel did not properly validate xattr sizes. A local attacker could use\n this to cause a denial of service (system crash). (CVE-2018-1095)\n\n Jann Horn discovered that the 32 bit adjtimex() syscall implementation for\n 64 bit Linux kernels did not properly initialize memory returned to user\n space in some situations. A local attacker could use this to expose\n sensitive information (kernel memory). (CVE-2018-11508)\n\n It was discovered that an information leak vulnerability existed in the\n floppy driver in the Linux kernel. A local attacker could use this to\n expose sensitive information (kernel memory). (CVE-2018-7755)\n",
  "aliases": [],
  "related": [
    "https://usn.ubuntu.com/usn/usn-3695-1"
  ],
  "published": "2018-07-21T02:17:56.553040Z",
  "modified": "2018-07-21T00:17:56.553040Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:18.04:LTS",
        "name": "linux-gcp"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "4.15.0-1014.14"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-4.15.0-1014-gcp": "4.15.0-1014.14"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-3718-1"
    },
    {
      "type": "REPORT",
      "url": "https://launchpad.net/bugs/1779827"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/https://usn.ubuntu.com/usn/usn-3695-1"
    }
  ]
}