{
  "id": "USN-3582-2",
  "summary": "linux-lts-xenial, linux-aws vulnerabilities",
  "details": "USN-3582-1 fixed vulnerabilities in the Linux kernel for Ubuntu 16.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 16.04 LTS for Ubuntu\n14.04 LTS.\n\nMohamed Ghannam discovered that the IPv4 raw socket implementation in the\nLinux kernel contained a race condition leading to uninitialized pointer\nusage. A local attacker could use this to cause a denial of service or\npossibly execute arbitrary code. (CVE-2017-17712)\n\nLaurent Guerby discovered that the mbcache feature in the ext2 and ext4\nfilesystems in the Linux kernel improperly handled xattr block caching. A\nlocal attacker could use this to cause a denial of service. (CVE-2015-8952)\n\nVitaly Mayatskikh discovered that the SCSI subsystem in the Linux kernel\ndid not properly track reference counts when merging buffers. A local\nattacker could use this to cause a denial of service (memory exhaustion).\n(CVE-2017-12190)\n\nChunYu Wang discovered that a use-after-free vulnerability existed in the\nSCTP protocol implementation in the Linux kernel. A local attacker could\nuse this to cause a denial of service (system crash) or possibly execute\narbitrary code, (CVE-2017-15115)\n\nMohamed Ghannam discovered a use-after-free vulnerability in the DCCP\nprotocol implementation in the Linux kernel. A local attacker could use\nthis to cause a denial of service (system crash) or possibly execute\narbitrary code. (CVE-2017-8824)\n\nUSN-3540-2 mitigated CVE-2017-5715 (Spectre Variant 2) for the\namd64 architecture in Ubuntu 14.04 LTS. This update provides the\ncompiler-based retpoline kernel mitigation for the amd64 and i386\narchitectures. Original advisory details:\n\n Jann Horn discovered that microprocessors utilizing speculative execution\n and branch prediction may allow unauthorized memory reads via sidechannel\n attacks. This flaw is known as Spectre. A local attacker could use this to\n expose sensitive information, including kernel memory. (CVE-2017-5715)\n",
  "aliases": [],
  "related": [
    "CVE-2015-8952",
    "CVE-2017-12190",
    "CVE-2017-15115",
    "CVE-2017-17712",
    "CVE-2017-5715",
    "CVE-2017-8824"
  ],
  "published": "2018-02-22T10:06:35.497487Z",
  "modified": "2018-02-22T10:06:35.497487Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:14.04:LTS",
        "name": "linux-aws"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "4.4.0-1014.14"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-4.4.0-1014-aws": "4.4.0-1014.14"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-3582-2"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2015-8952"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2017-12190"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2017-15115"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2017-17712"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2017-5715"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2017-8824"
    }
  ]
}