{
  "id": "USN-6314-1",
  "summary": "linux-bluefield, linux-ibm vulnerabilities",
  "details": "It was discovered that the netlink implementation in the Linux kernel did\nnot properly validate policies when parsing attributes in some situations.\nAn attacker could use this to cause a denial of service (infinite\nrecursion). (CVE-2020-36691)\n\nBilly Jheng Bing Jhong discovered that the CIFS network file system\nimplementation in the Linux kernel did not properly validate arguments to\nioctl() in some situations. A local attacker could possibly use this to\ncause a denial of service (system crash). (CVE-2022-0168)\n\nIt was discovered that the ext4 file system implementation in the Linux\nkernel contained a use-after-free vulnerability. An attacker could use this\nto construct a malicious ext4 file system image that, when mounted, could\ncause a denial of service (system crash). (CVE-2022-1184)\n\nIt was discovered that some AMD x86-64 processors with SMT enabled could\nspeculatively execute instructions using a return address from a sibling\nthread. A local attacker could possibly use this to expose sensitive\ninformation. (CVE-2022-27672)\n\nWilliam Zhao discovered that the Traffic Control (TC) subsystem in the\nLinux kernel did not properly handle network packet retransmission in\ncertain situations. A local attacker could use this to cause a denial of\nservice (kernel deadlock). (CVE-2022-4269)\n\nIt was discovered that a race condition existed in the qdisc implementation\nin the Linux kernel, leading to a use-after-free vulnerability. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2023-0590)\n\nIt was discovered that a race condition existed in the btrfs file system\nimplementation in the Linux kernel, leading to a use-after-free\nvulnerability. A local attacker could use this to cause a denial of service\n(system crash) or possibly expose sensitive information. (CVE-2023-1611)\n\nIt was discovered that the APM X-Gene SoC hardware monitoring driver in the\nLinux kernel contained a race condition, leading to a use-after-free\nvulnerability. A local attacker could use this to cause a denial of service\n(system crash) or expose sensitive information (kernel memory).\n(CVE-2023-1855)\n\nIt was discovered that the ST NCI NFC driver did not properly handle device\nremoval events. A physically proximate attacker could use this to cause a\ndenial of service (system crash). (CVE-2023-1990)\n\nIt was discovered that the XFS file system implementation in the Linux\nkernel did not properly perform metadata validation when mounting certain\nimages. An attacker could use this to specially craft a file system image\nthat, when mounted, could cause a denial of service (system crash).\n(CVE-2023-2124)\n\nIt was discovered that the SLIMpro I2C device driver in the Linux kernel\ndid not properly validate user-supplied data in some situations, leading to\nan out-of-bounds write vulnerability. A privileged attacker could use this\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2023-2194)\n\nIt was discovered that a race condition existed in the TLS subsystem in the\nLinux kernel, leading to a use-after-free or a null pointer dereference\nvulnerability. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2023-28466)\n\nIt was discovered that the DA9150 charger driver in the Linux kernel did\nnot properly handle device removal, leading to a user-after free\nvulnerability. A physically proximate attacker could use this to cause a\ndenial of service (system crash) or possibly execute arbitrary code.\n(CVE-2023-30772)\n\nIt was discovered that the btrfs file system implementation in the Linux\nkernel did not properly handle error conditions in some situations, leading\nto a use-after-free vulnerability. A local attacker could possibly use this\nto cause a denial of service (system crash). (CVE-2023-3111)\n\nIt was discovered that the Ricoh R5C592 MemoryStick card reader driver in\nthe Linux kernel contained a race condition during module unload, leading\nto a use-after-free vulnerability. A local attacker could use this to cause\na denial of service (system crash) or possibly execute arbitrary code.\n(CVE-2023-3141)\n\nIt was discovered that the Qualcomm EMAC ethernet driver in the Linux\nkernel did not properly handle device removal, leading to a user-after free\nvulnerability. A physically proximate attacker could use this to cause a\ndenial of service (system crash) or possibly execute arbitrary code.\n(CVE-2023-33203)\n\n",
  "aliases": [],
  "related": [
    "CVE-2020-36691",
    "CVE-2022-0168",
    "CVE-2022-1184",
    "CVE-2022-27672",
    "CVE-2022-4269",
    "CVE-2023-0590",
    "CVE-2023-1611",
    "CVE-2023-1855",
    "CVE-2023-1990",
    "CVE-2023-2124",
    "CVE-2023-2194",
    "CVE-2023-28466",
    "CVE-2023-30772",
    "CVE-2023-3111",
    "CVE-2023-3141",
    "CVE-2023-33203"
  ],
  "published": "2023-08-29T19:18:37.818567Z",
  "modified": "2023-08-29T17:18:37.818567Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:20.04:LTS",
        "name": "linux-ibm"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.4.0-1054.59"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-buildinfo-5.4.0-1054-ibm": "5.4.0-1054.59",
            "linux-headers-5.4.0-1054-ibm": "5.4.0-1054.59",
            "linux-headers-ibm-lts-20.04": "5.4.0.1054.83",
            "linux-ibm-cloud-tools-common": "5.4.0-1054.59",
            "linux-ibm-headers-5.4.0-1054": "5.4.0-1054.59",
            "linux-ibm-lts-20.04": "5.4.0.1054.83",
            "linux-ibm-source-5.4.0": "5.4.0-1054.59",
            "linux-ibm-tools-5.4.0-1054": "5.4.0-1054.59",
            "linux-ibm-tools-common": "5.4.0-1054.59",
            "linux-image-5.4.0-1054-ibm": "5.4.0-1054.59",
            "linux-image-ibm-lts-20.04": "5.4.0.1054.83",
            "linux-image-unsigned-5.4.0-1054-ibm": "5.4.0-1054.59",
            "linux-modules-5.4.0-1054-ibm": "5.4.0-1054.59",
            "linux-modules-extra-5.4.0-1054-ibm": "5.4.0-1054.59",
            "linux-modules-extra-ibm-lts-20.04": "5.4.0.1054.83",
            "linux-tools-5.4.0-1054-ibm": "5.4.0-1054.59",
            "linux-tools-ibm-lts-20.04": "5.4.0.1054.83"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-6314-1"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-36691"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-0168"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1184"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-27672"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-4269"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-0590"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-1611"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-1855"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-1990"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-2124"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-2194"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-28466"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-30772"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-3111"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-3141"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-33203"
    }
  ]
}