{
  "id": "USN-2516-2",
  "summary": "linux vulnerability",
  "details": "USN-2516-1 fixed vulnerabilities in the Linux kernel. There was an unrelated\nregression in the use of the virtual counter (CNTVCT) on arm64 architectures.\nThis update fixes the problem.\n\nWe apologize for the inconvenience.\n\nOriginal advisory details:\n\nA flaw was discovered in the Kernel Virtual Machine's (KVM) emulation of\nthe SYSTENTER instruction when the guest OS does not initialize the\nSYSENTER MSRs. A guest OS user could exploit this flaw to cause a denial of\nservice of the guest OS (crash) or potentially gain privileges on the guest\nOS. (CVE-2015-0239)\n\nAndy Lutomirski discovered an information leak in the Linux kernel's Thread\nLocal Storage (TLS) implementation allowing users to bypass the espfix to\nobtain information that could be used to bypass the Address Space Layout\nRandomization (ASLR) protection mechanism. A local user could exploit this\nflaw to obtain potentially sensitive information from kernel memory.\n(CVE-2014-8133)\n\nA restriction bypass was discovered in iptables when conntrack rules are\nspecified and the conntrack protocol handler module is not loaded into the\nLinux kernel. This flaw can cause the firewall rules on the system to be\nbypassed when conntrack rules are used. (CVE-2014-8160)\n\nA flaw was discovered with file renaming in the linux kernel. A local user\ncould exploit this flaw to cause a denial of service (deadlock and system\nhang). (CVE-2014-8559)\n\nA flaw was discovered in how supplemental group memberships are handled in\ncertain namespace scenarios. A local user could exploit this flaw to bypass\nfile permission restrictions. (CVE-2014-8989)\n\nA flaw was discovered in how Thread Local Storage (TLS) is handled by the\ntask switching function in the Linux kernel for x86_64 based machines. A\nlocal user could exploit this flaw to bypass the Address Space Layout\nRadomization (ASLR) protection mechanism. (CVE-2014-9419)\n\nPrasad J Pandit reported a flaw in the rock_continue function of the Linux\nkernel's ISO 9660 CDROM file system. A local user could exploit this flaw\nto cause a denial of service (system crash or hang). (CVE-2014-9420)\n\nA flaw was discovered in the fragment handling of the B.A.T.M.A.N. Advanced\nMeshing Protocol in the Linux kernel. A remote attacker could exploit this\nflaw to cause a denial of service (mesh-node system crash) via fragmented\npackets. (CVE-2014-9428)\n\nA race condition was discovered in the Linux kernel's key ring. A local\nuser could cause a denial of service (memory corruption or panic) or\npossibly have unspecified impact via the keyctl commands. (CVE-2014-9529)\n\nA memory leak was discovered in the ISO 9660 CDROM file system when parsing\nrock ridge ER records. A local user could exploit this flaw to obtain\nsensitive information from kernel memory via a crafted iso9660 image.\n(CVE-2014-9584)\n\nA flaw was discovered in the Address Space Layout Randomization (ASLR) of\nthe Virtual Dynamically linked Shared Objects (vDSO) location. This flaw\nmakes it easier for a local user to bypass the ASLR protection mechanism.\n(CVE-2014-9585)\n\nDmitry Chernenkov discovered a buffer overflow in eCryptfs' encrypted file\nname decoding. A local unprivileged user could exploit this flaw to cause a\ndenial of service (system crash) or potentially gain administrative\nprivileges. (CVE-2014-9683)\n",
  "aliases": [],
  "related": [],
  "published": "2015-02-28T19:17:18.905910Z",
  "modified": "2015-02-28T19:17:18.905910Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:14.04:LTS",
        "name": "linux"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "3.13.0-46.76"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-extra-3.13.0-46-generic": "3.13.0-46.76",
            "linux-image-3.13.0-46-generic-lpae": "3.13.0-46.76",
            "linux-image-3.13.0-46-generic": "3.13.0-46.76",
            "linux-image-3.13.0-46-powerpc-e500mc": "3.13.0-46.76",
            "linux-image-3.13.0-46-powerpc-smp": "3.13.0-46.76",
            "linux-image-3.13.0-46-powerpc64-emb": "3.13.0-46.76",
            "linux-image-3.13.0-46-powerpc-e500": "3.13.0-46.76",
            "linux-image-3.13.0-46-powerpc64-smp": "3.13.0-46.76",
            "linux-image-3.13.0-46-lowlatency": "3.13.0-46.76"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-2516-2"
    },
    {
      "type": "REPORT",
      "url": "https://launchpad.net/bugs/1426043"
    }
  ]
}