{
  "id": "USN-3677-2",
  "summary": "linux-hwe, linux-gcp, linux-oem vulnerabilities",
  "details": "USN-3677-1 fixed vulnerabilities in the Linux kernel for Ubuntu 17.10.\nThis update provides the corresponding updates for the Linux Hardware\nEnablement (HWE) kernel from Ubuntu 17.10 for Ubuntu 16.04 LTS.\n\nIt was discovered that the netfilter subsystem of the Linux kernel did not\nproperly validate ebtables offsets. A local attacker could use this to\ncause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2018-1068)\n\nWen Xu discovered that the ext4 filesystem implementation in the Linux\nkernel did not properly handle corrupted meta data in some situations. An\nattacker could use this to specially craft an ext4 file system that caused\na denial of service (system crash) when mounted. (CVE-2018-1092)\n\nIt was discovered that a NULL pointer dereference existed in the RDS\n(Reliable Datagram Sockets) protocol implementation in the Linux kernel. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2018-7492)\n\nIt was discovered that the 802.11 software simulator implementation in the\nLinux kernel contained a memory leak when handling certain error\nconditions. A local attacker could possibly use this to cause a denial of\nservice (memory exhaustion). (CVE-2018-8087)\n\nEyal Itkin discovered that the USB displaylink video adapter driver in the\nLinux kernel did not properly validate mmap offsets sent from userspace. A\nlocal attacker could use this to expose sensitive information (kernel\nmemory) or possibly execute arbitrary code. (CVE-2018-8781)\n",
  "aliases": [],
  "related": [
    "CVE-2018-1068",
    "CVE-2018-1092",
    "CVE-2018-7492",
    "CVE-2018-8087",
    "CVE-2018-8781"
  ],
  "published": "2018-06-12T00:18:07.841533Z",
  "modified": "2018-06-12T00:18:07.841533Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:16.04:LTS",
        "name": "linux-gcp"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "4.13.0-1019.23"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-4.13.0-1019-gcp": "4.13.0-1019.23",
            "linux-image-extra-4.13.0-1019-gcp": "4.13.0-1019.23"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-3677-2"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-1068"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-1092"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-7492"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-8087"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-8781"
    }
  ]
}