{
  "id": "USN-4093-1",
  "summary": "linux, linux-hwe, linux-azure, linux-gcp, linux-kvm, linux-raspi2, linux-snapdragon vulnerabilities",
  "details": "It was discovered that a heap buffer overflow existed in the Marvell\nWireless LAN device driver for the Linux kernel. An attacker could use this\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2019-10126)\n\nAndrei Vlad Lutas and Dan Lutas discovered that some x86 processors\nincorrectly handle SWAPGS instructions during speculative execution. A\nlocal attacker could use this to expose sensitive information (kernel\nmemory). (CVE-2019-1125)\n\nIt was discovered that the PowerPC dlpar implementation in the Linux kernel\ndid not properly check for allocation errors in some situations. A local\nattacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2019-12614)\n\nIt was discovered that a NULL pointer dereference vulnerability existed in\nthe Near-field communication (NFC) implementation in the Linux kernel. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2019-12984)\n\nJann Horn discovered a use-after-free vulnerability in the Linux kernel\nwhen accessing LDT entries in some situations. A local attacker could use\nthis to cause a denial of service (system crash) or possibly execute\narbitrary code. (CVE-2019-13233)\n\nJann Horn discovered that the ptrace implementation in the Linux kernel did\nnot properly record credentials in some situations. A local attacker could\nuse this to cause a denial of service (system crash) or possibly gain\nadministrative privileges. (CVE-2019-13272)\n\nIt was discovered that the Marvell Wireless LAN device driver in the Linux\nkernel did not properly validate the BSS descriptor. A local attacker could\npossibly use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2019-3846)\n",
  "aliases": [],
  "related": [
    "CVE-2019-10126",
    "CVE-2019-1125",
    "CVE-2019-12614",
    "CVE-2019-12984",
    "CVE-2019-13233",
    "CVE-2019-13272",
    "CVE-2019-3846"
  ],
  "published": "2019-08-13T15:04:42.366266Z",
  "modified": "2019-08-13T15:04:42.366266Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:18.04:LTS",
        "name": "linux-azure"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.0.0-1014.14~18.04.1"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-azure": "5.0.0.1014.25",
            "linux-image-5.0.0-1014-azure": "5.0.0-1014.14~18.04.1"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-4093-1"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2019-10126"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2019-1125"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2019-12614"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2019-12984"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2019-13233"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2019-13272"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2019-3846"
    }
  ]
}