{
  "id": "USN-2379-1",
  "summary": "linux vulnerabilities",
  "details": "Steven Vittitoe reported multiple stack buffer overflows in Linux kernel's\nmagicmouse HID driver. A physically proximate attacker could exploit this\nflaw to cause a denial of service (system crash) or possibly execute\narbitrary code via specially crafted devices. (CVE-2014-3181)\n\nBen Hawkes reported some off by one errors for report descriptors in the\nLinux kernel's HID stack. A physically proximate attacker could exploit\nthese flaws to cause a denial of service (out-of-bounds write) via a\nspecially crafted device. (CVE-2014-3184)\n\nSeveral bounds check flaws allowing for buffer overflows were discovered in\nthe Linux kernel's Whiteheat USB serial driver. A physically proximate\nattacker could exploit these flaws to cause a denial of service (system\ncrash) via a specially crafted device. (CVE-2014-3185)\n\nSteven Vittitoe reported a buffer overflow in the Linux kernel's PicoLCD\nHID device driver. A physically proximate attacker could exploit this flaw\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode via a specially craft device. (CVE-2014-3186)\n\nA flaw was discovered in the Linux kernel's associative-array garbage\ncollection implementation. A local user could exploit this flaw to cause a\ndenial of service (system crash) or possibly have other unspecified impact\nby using keyctl operations. (CVE-2014-3631)\n\nA flaw was discovered in the Linux kernel's UDF filesystem (used on some\nCD-ROMs and DVDs) when processing indirect ICBs. An attacker who can cause\nCD, DVD or image file with a specially crafted inode to be mounted can\ncause a denial of service (infinite loop or stack consumption).\n(CVE-2014-6410)\n\nJames Eckersall discovered a buffer overflow in the Ceph filesystem in the\nLinux kernel. A remote attacker could exploit this flaw to cause a denial\nof service (memory consumption and panic) or possibly have other\nunspecified impact via a long unencrypted auth ticket. (CVE-2014-6416)\n\nJames Eckersall discovered a flaw in the handling of memory allocation\nfailures in the Ceph filesystem. A remote attacker could exploit this flaw\nto cause a denial of service (system crash) or possibly have unspecified\nother impact. (CVE-2014-6417)\n\nJames Eckersall discovered a flaw in how the Ceph filesystem validates auth\nreplies. A remote attacker could exploit this flaw to cause a denial of\nservice (system crash) or possibly have other unspecified impact.\n(CVE-2014-6418)\n",
  "aliases": [],
  "related": [
    "CVE-2014-3181",
    "CVE-2014-3184",
    "CVE-2014-3185",
    "CVE-2014-3186",
    "CVE-2014-3631",
    "CVE-2014-6410",
    "CVE-2014-6416",
    "CVE-2014-6417",
    "CVE-2014-6418"
  ],
  "published": "2014-10-09T13:00:07.107935Z",
  "modified": "2014-10-09T13:00:07.107935Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:14.04:LTS",
        "name": "linux"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "3.13.0-37.64"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-3.13.0-37-generic-lpae": "3.13.0-37.64",
            "linux-image-3.13.0-37-lowlatency": "3.13.0-37.64",
            "linux-image-3.13.0-37-powerpc64-emb": "3.13.0-37.64",
            "linux-image-3.13.0-37-generic": "3.13.0-37.64",
            "linux-image-3.13.0-37-powerpc-smp": "3.13.0-37.64",
            "linux-image-3.13.0-37-powerpc-e500": "3.13.0-37.64",
            "linux-image-3.13.0-37-powerpc64-smp": "3.13.0-37.64",
            "linux-image-extra-3.13.0-37-generic": "3.13.0-37.64",
            "linux-image-3.13.0-37-powerpc-e500mc": "3.13.0-37.64"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-2379-1"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-3181"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-3184"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-3185"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-3186"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-3631"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-6410"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-6416"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-6417"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2014-6418"
    }
  ]
}