{
  "id": "USN-5469-1",
  "summary": "linux, linux-aws, linux-azure, linux-gcp, linux-gke, linux-ibm, linux-intel-iotg, linux-kvm, linux-lowlatency, linux-oracle, linux-raspi vulnerabilities",
  "details": "It was discovered that the Linux kernel did not properly restrict access to\nthe kernel debugger when booted in secure boot environments. A privileged\nattacker could use this to bypass UEFI Secure Boot restrictions.\n(CVE-2022-21499)\n\nAaron Adams discovered that the netfilter subsystem in the Linux kernel did\nnot properly handle the removal of stateful expressions in some situations,\nleading to a use-after-free vulnerability. A local attacker could use this\nto cause a denial of service (system crash) or execute arbitrary code.\n(CVE-2022-1966)\n\nBilly Jheng Bing Jhong discovered that the CIFS network file system\nimplementation in the Linux kernel did not properly validate arguments to\nioctl() in some situations. A local attacker could possibly use this to\ncause a denial of service (system crash). (CVE-2022-0168)\n\nHu Jiahui discovered that multiple race conditions existed in the Advanced\nLinux Sound Architecture (ALSA) framework, leading to use-after-free\nvulnerabilities. A local attacker could use these to cause a denial of\nservice (system crash) or possibly execute arbitrary code. (CVE-2022-1048)\n\nQiuhao Li, Gaoning Pan and Yongkang Jia discovered that the KVM\nimplementation in the Linux kernel did not properly perform guest page\ntable updates in some situations. An attacker in a guest vm could possibly\nuse this to crash the host OS. (CVE-2022-1158)\n\nIt was discovered that the implementation of the 6pack and mkiss protocols\nin the Linux kernel did not handle detach events properly in some\nsituations, leading to a use-after-free vulnerability. A local attacker\ncould possibly use this to cause a denial of service (system crash).\n(CVE-2022-1195)\n\nDuoming Zhou discovered that the 6pack protocol implementation in the Linux\nkernel did not handle detach events properly in some situations, leading to\na use-after-free vulnerability. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2022-1198)\n\nDuoming Zhou discovered that the AX.25 amateur radio protocol\nimplementation in the Linux kernel did not handle detach events properly in\nsome situations. A local attacker could possibly use this to cause a denial\nof service (system crash) or execute arbitrary code. (CVE-2022-1199)\n\nDuoming Zhou discovered race conditions in the AX.25 amateur radio protocol\nimplementation in the Linux kernel during device detach operations. A local\nattacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2022-1204)\n\nDuoming Zhou discovered race conditions in the AX.25 amateur radio protocol\nimplementation in the Linux kernel, leading to use-after-free\nvulnerabilities. A local attacker could possibly use this to cause a denial\nof service (system crash). (CVE-2022-1205)\n\nQiuhao Li, Gaoning Pan, and Yongkang Jia discovered that the kvm\nimplementation in the Linux kernel did not handle releasing a virtual cpu\nproperly. A local attacker in a guest VM coud possibly use this to cause a\ndenial of service (host system crash). (CVE-2022-1263)\n\nIt was discovered that the PF_KEYv2 implementation in the Linux kernel did\nnot properly initialize kernel memory in some situations. A local attacker\ncould use this to expose sensitive information (kernel memory).\n(CVE-2022-1353)\n\nIt was discovered that the implementation of X.25 network protocols in the\nLinux kernel did not terminate link layer sessions properly. A local\nattacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2022-1516)\n\nIt was discovered that the ACRN Hypervisor Service Module implementation in\nthe Linux kernel did not properly deallocate memory in some situations. A\nlocal privileged attacker could possibly use this to cause a denial of\nservice (memory exhaustion). (CVE-2022-1651)\n\nIt was discovered that the RxRPC session socket implementation in the Linux\nkernel did not properly handle ioctls called when no security protocol is\ngiven. A local attacker could use this to cause a denial of service (system\ncrash) or possibly expose sensitive information (kernel memory).\n(CVE-2022-1671)\n\nZiming Zhang discovered that the netfilter subsystem in the Linux kernel\ndid not properly validate sets with multiple ranged fields. A local\nattacker could use this to cause a denial of service or execute arbitrary\ncode. (CVE-2022-1972)\n\n赵子轩 discovered that the 802.2 LLC type 2 driver in the Linux kernel did not\nproperly perform reference counting in some error conditions. A local\nattacker could use this to cause a denial of service. (CVE-2022-28356)\n\nIt was discovered that the 8 Devices USB2CAN interface implementation in\nthe Linux kernel did not properly handle certain error conditions, leading\nto a double-free. A local attacker could possibly use this to cause a\ndenial of service (system crash). (CVE-2022-28388)\n\nIt was discovered that the Microchip CAN BUS Analyzer interface\nimplementation in the Linux kernel did not properly handle certain error\nconditions, leading to a double-free. A local attacker could possibly use\nthis to cause a denial of service (system crash). (CVE-2022-28389)\n\nIt was discovered that the EMS CAN/USB interface implementation in the\nLinux kernel contained a double-free vulnerability when handling certain\nerror conditions. A local attacker could use this to cause a denial of\nservice (memory exhaustion). (CVE-2022-28390)\n",
  "aliases": [],
  "related": [
    "CVE-2022-0168",
    "CVE-2022-1048",
    "CVE-2022-1158",
    "CVE-2022-1195",
    "CVE-2022-1198",
    "CVE-2022-1199",
    "CVE-2022-1204",
    "CVE-2022-1205",
    "CVE-2022-1263",
    "CVE-2022-1353",
    "CVE-2022-1516",
    "CVE-2022-1651",
    "CVE-2022-1671",
    "CVE-2022-1966",
    "CVE-2022-1972",
    "CVE-2022-21499",
    "CVE-2022-28356",
    "CVE-2022-28388",
    "CVE-2022-28389",
    "CVE-2022-28390"
  ],
  "published": "2022-06-08T04:55:56.914620Z",
  "modified": "2022-06-08T04:55:56.914620Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:22.04:LTS",
        "name": "linux-ibm"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.15.0-1007.8"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-headers-5.15.0-1007-ibm": "5.15.0-1007.8",
            "linux-ibm-cloud-tools-common": "5.15.0-1007.8",
            "linux-ibm-headers-5.15.0-1007": "5.15.0-1007.8",
            "linux-buildinfo-5.15.0-1007-ibm": "5.15.0-1007.8",
            "linux-tools-5.15.0-1007-ibm": "5.15.0-1007.8",
            "linux-image-ibm": "5.15.0.1007.7",
            "linux-tools-ibm": "5.15.0.1007.7",
            "linux-ibm-source-5.15.0": "5.15.0-1007.8",
            "linux-ibm-tools-common": "5.15.0-1007.8",
            "linux-modules-5.15.0-1007-ibm": "5.15.0-1007.8",
            "linux-image-unsigned-5.15.0-1007-ibm": "5.15.0-1007.8",
            "linux-ibm": "5.15.0.1007.7",
            "linux-image-5.15.0-1007-ibm": "5.15.0-1007.8",
            "linux-modules-extra-5.15.0-1007-ibm": "5.15.0-1007.8",
            "linux-headers-ibm": "5.15.0.1007.7",
            "linux-ibm-tools-5.15.0-1007": "5.15.0-1007.8"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-5469-1"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-0168"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1048"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1158"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1195"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1198"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1199"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1204"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1205"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1263"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1353"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1516"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1651"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1671"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1966"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-1972"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-21499"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-28356"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-28388"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-28389"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-28390"
    }
  ]
}