{
  "id": "USN-4912-1",
  "summary": "linux-oem-5.6 vulnerabilities",
  "details": "Piotr Krysiuk discovered that the BPF JIT compiler for x86 in the Linux\nkernel did not properly validate computation of branch displacements in\nsome situations. A local attacker could use this to cause a denial of\nservice (system crash) or possibly execute arbitrary code. (CVE-2021-29154)\n\nIt was discovered that a race condition existed in the binder IPC\nimplementation in the Linux kernel, leading to a use-after-free\nvulnerability. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2020-0423)\n\nIt was discovered that the HID multitouch implementation within the Linux\nkernel did not properly validate input events in some situations. A\nphysically proximate attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2020-0465)\n\nIt was discovered that the eventpoll (aka epoll) implementation in the\nLinux kernel contained a logic error that could lead to a use after free\nvulnerability. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2020-0466)\n\nIt was discovered that a race condition existed in the perf subsystem of\nthe Linux kernel, leading to a use-after-free vulnerability. An attacker\nwith access to the perf subsystem could use this to cause a denial of\nservice (system crash) or possibly execute arbitrary code. (CVE-2020-14351)\n\nIt was discovered that the frame buffer implementation in the Linux kernel\ndid not properly handle some edge cases in software scrollback. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2020-14390)\n\nIt was discovered that a race condition existed in the hugetlb sysctl\nimplementation in the Linux kernel. A privileged attacker could use this to\ncause a denial of service (system crash). (CVE-2020-25285)\n\nIt was discovered that the GENEVE tunnel implementation in the Linux kernel\nwhen combined with IPSec did not properly select IP routes in some\nsituations. An attacker could use this to expose sensitive information\n(unencrypted network traffic). (CVE-2020-25645)\n\nBodong Zhao discovered a use-after-free in the Sun keyboard driver\nimplementation in the Linux kernel. A local attacker could use this to\ncause a denial of service or possibly execute arbitrary code.\n(CVE-2020-25669)\n\nShisong Qin and Bodong Zhao discovered that Speakup screen reader driver in\nthe Linux kernel did not correctly handle setting line discipline in some\nsituations. A local attacker could use this to cause a denial of service\n(system crash). (CVE-2020-27830)\n\nIt was discovered that the Marvell WiFi-Ex device driver in the Linux\nkernel did not properly validate ad-hoc SSIDs. A local attacker could use\nthis to cause a denial of service (system crash) or possibly execute\narbitrary code. (CVE-2020-36158)\n\nLoris Reiff discovered that the BPF implementation in the Linux kernel did\nnot properly validate attributes in the getsockopt BPF hook. A local\nattacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2021-20194)\n\nAdam Zabrocki discovered that the kprobes subsystem in the Linux kernel did\nnot properly detect linker padding in some situations. A privileged\nattacker could use this to cause a denial of service (system crash) or\npossibly expose sensitive information. (CVE-2021-3411)\n\n吴异 discovered that the NFS implementation in the Linux kernel did not\nproperly prevent access outside of an NFS export that is a subdirectory of\na file system. An attacker could possibly use this to bypass NFS access\nrestrictions. (CVE-2021-3178)\n",
  "aliases": [],
  "related": [
    "CVE-2020-0423",
    "CVE-2020-0465",
    "CVE-2020-0466",
    "CVE-2020-14351",
    "CVE-2020-14390",
    "CVE-2020-25285",
    "CVE-2020-25645",
    "CVE-2020-25669",
    "CVE-2020-27830",
    "CVE-2020-36158",
    "CVE-2021-20194",
    "CVE-2021-29154",
    "CVE-2021-3178",
    "CVE-2021-3411"
  ],
  "published": "2021-04-13T23:35:44.987489Z",
  "modified": "2021-04-13T23:35:44.987489Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:20.04:LTS",
        "name": "linux-oem-5.6"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.6.0-1053.57"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-oem-20.04": "5.6.0.1053.49",
            "linux-image-5.6.0-1053-oem": "5.6.0-1053.57"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-4912-1"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-0423"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-0465"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-0466"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-14351"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-14390"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-25285"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-25645"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-25669"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-27830"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-36158"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2021-20194"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2021-29154"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2021-3178"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2021-3411"
    }
  ]
}