{
  "id": "USN-4389-1",
  "summary": "linux, linux-aws, linux-azure, linux-gcp, linux-kvm, linux-oracle, linux-raspi, linux-riscv vulnerabilities",
  "details": "It was discovered that the F2FS file system implementation in the Linux\nkernel did not properly perform bounds checking on xattrs in some\nsituations. A local attacker could possibly use this to expose sensitive\ninformation (kernel memory). (CVE-2020-0067)\n\nIt was discovered that memory contents previously stored in\nmicroarchitectural special registers after RDRAND, RDSEED, and SGX EGETKEY\nread operations on Intel client and Xeon E3 processors may be briefly\nexposed to processes on the same or different processor cores. A local\nattacker could use this to expose sensitive information. (CVE-2020-0543)\n\nPiotr Krysiuk discovered that race conditions existed in the file system\nimplementation in the Linux kernel. A local attacker could use this to\ncause a denial of service (system crash). (CVE-2020-12114)\n\nIt was discovered that the USB susbsystem's scatter-gather implementation\nin the Linux kernel did not properly take data references in some\nsituations, leading to a use-after-free. A physically proximate attacker\ncould use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2020-12464)\n\nBui Quang Minh discovered that the XDP socket implementation in the Linux\nkernel did not properly validate meta-data passed from user space, leading\nto an out-of-bounds write vulnerability. A local attacker with the\nCAP_NET_ADMIN capability could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2020-12659)\n\nDmitry Vyukov discovered that the SELinux netlink security hook in the\nLinux kernel did not validate messages in some situations. A privileged\nattacker could use this to bypass SELinux netlink restrictions.\n(CVE-2020-10751)\n",
  "aliases": [],
  "related": [
    "CVE-2020-0067",
    "CVE-2020-0543",
    "CVE-2020-10751",
    "CVE-2020-12114",
    "CVE-2020-12464",
    "CVE-2020-12659",
    "https://wiki.ubuntu.com/SecurityTeam/KnowledgeBase/SRBDS"
  ],
  "published": "2020-06-10T19:26:22.433919Z",
  "modified": "2020-06-10T19:26:22.433919Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:20.04:LTS",
        "name": "linux-gcp"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.4.0-1015.15"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-gke": "5.4.0.1015.14",
            "linux-image-5.4.0-1015-gcp": "5.4.0-1015.15",
            "linux-image-gcp": "5.4.0.1015.14"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-4389-1"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-0067"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-0543"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-10751"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-12114"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-12464"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2020-12659"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/https://wiki.ubuntu.com/SecurityTeam/KnowledgeBase/SRBDS"
    }
  ]
}