{
  "id": "USN-3631-2",
  "summary": "linux-lts-xenial, linux-aws vulnerabilities",
  "details": "USN-3631-1 fixed vulnerabilities in the Linux kernel for Ubuntu 16.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 16.04 LTS for Ubuntu\n14.04 LTS.\n\nIt was discovered that a buffer overread vulnerability existed in the\nkeyring subsystem of the Linux kernel. A local attacker could possibly use\nthis to expose sensitive information (kernel memory). (CVE-2017-13305)\n\nIt was discovered that the DM04/QQBOX USB driver in the Linux kernel did\nnot properly handle device attachment and warm-start. A physically\nproximate attacker could use this to cause a denial of service (system\ncrash) or possibly execute arbitrary code. (CVE-2017-16538)\n\nLuo Quan and Wei Yang discovered that a race condition existed in the\nAdvanced Linux Sound Architecture (ALSA) subsystem of the Linux kernel when\nhandling ioctl()s. A local attacker could use this to cause a denial of\nservice (system deadlock). (CVE-2018-1000004)\n\nWang Qize discovered that an information disclosure vulnerability existed\nin the SMBus driver for ACPI Embedded Controllers in the Linux kernel. A\nlocal attacker could use this to expose sensitive information (kernel\npointer addresses). (CVE-2018-5750)\n\n范龙飞 discovered that a race condition existed in the Advanced Linux\nSound Architecture (ALSA) subsystem of the Linux kernel that could lead to\na use-after-free or an out-of-bounds buffer access. A local attacker with\naccess to /dev/snd/seq could use this to cause a denial of service (system\ncrash) or possibly execute arbitrary code. (CVE-2018-7566)\n",
  "aliases": [],
  "related": [
    "CVE-2017-13305",
    "CVE-2017-16538",
    "CVE-2018-1000004",
    "CVE-2018-5750",
    "CVE-2018-7566"
  ],
  "published": "2018-04-24T07:04:01.979395Z",
  "modified": "2018-04-24T07:04:01.979395Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:14.04:LTS",
        "name": "linux-aws"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "4.4.0-1017.17"
            }
          ]
        }
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "linux-image-4.4.0-1017-aws": "4.4.0-1017.17"
          }
        ],
        "availability": "No subscription needed"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-3631-2"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2017-13305"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2017-16538"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-1000004"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-5750"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2018-7566"
    }
  ]
}