{
  "description": "Al Viro discovered a race condition in the TTY driver. A local attacker\ncould exploit this to crash the system, leading to a denial of service.\n(CVE-2009-4895)\n\nDan Rosenberg discovered that the MOVE_EXT ext4 ioctl did not correctly\ncheck file permissions. A local attacker could overwrite append-only files,\nleading to potential data loss. (CVE-2010-2066)\n\nDan Rosenberg discovered that the swapexit xfs ioctl did not correctly\ncheck file permissions. A local attacker could exploit this to read from\nwrite-only files, leading to a loss of privacy. (CVE-2010-2226)\n\nGael Delalleu, Rafal Wojtczuk, and Brad Spengler discovered that the memory\nmanager did not properly handle when applications grow stacks into adjacent\nmemory regions. A local attacker could exploit this to gain control of\ncertain applications, potentially leading to privilege escalation, as\ndemonstrated in attacks against the X server. (CVE-2010-2240)\n\nSuresh Jayaraman discovered that CIFS did not correctly validate certain\nresponse packats. A remote attacker could send specially crafted traffic\nthat would crash the system, leading to a denial of service.\n(CVE-2010-2248)\n\nBen Hutchings discovered that the ethtool interface did not correctly check\ncertain sizes. A local attacker could perform malicious ioctl calls that\ncould crash the system, leading to a denial of service. (CVE-2010-2478,\nCVE-2010-3084)\n\nJames Chapman discovered that L2TP did not correctly evaluate checksum\ncapabilities. If an attacker could make malicious routing changes, they\ncould crash the system, leading to a denial of service. (CVE-2010-2495)\n\nNeil Brown discovered that NFSv4 did not correctly check certain write\nrequests. A remote attacker could send specially crafted traffic that could\ncrash the system or possibly gain root privileges. (CVE-2010-2521)\n\nDavid Howells discovered that DNS resolution in CIFS could be spoofed. A\nlocal attacker could exploit this to control DNS replies, leading to a loss\nof privacy and possible privilege escalation. (CVE-2010-2524)\n\nDan Rosenberg discovered that the btrfs filesystem did not correctly\nvalidate permissions when using the clone function. A local attacker could\noverwrite the contents of file handles that were opened for append-only, or\npotentially read arbitrary contents, leading to a loss of privacy. Only\nUbuntu 9.10 was affected. (CVE-2010-2538)\n\nBob Peterson discovered that GFS2 rename operations did not correctly\nvalidate certain sizes. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-2798)\n\nKees Cook discovered that under certain situations the ioctl subsystem for\nDRM did not properly sanitize its arguments. A local attacker could exploit\nthis to read previously freed kernel memory, leading to a loss of privacy.\n(CVE-2010-2803)\n\nEric Dumazet discovered that many network functions could leak kernel stack\ncontents. A local attacker could exploit this to read portions of kernel\nmemory, leading to a loss of privacy. (CVE-2010-2942, CVE-2010-3477)\n\nDave Chinner discovered that the XFS filesystem did not correctly order\ninode lookups when exported by NFS. A remote attacker could exploit this to\nread or write disk blocks that had changed file assignment or had become\nunlinked, leading to a loss of privacy. (CVE-2010-2943)\n\nSergey Vlasov discovered that JFS did not correctly handle certain extended\nattributes. A local attacker could bypass namespace access rules, leading\nto a loss of privacy. (CVE-2010-2946)\n\nTavis Ormandy discovered that the IRDA subsystem did not correctly shut\ndown. A local attacker could exploit this to cause the system to crash or\npossibly gain root privileges. (CVE-2010-2954)\n\nBrad Spengler discovered that the wireless extensions did not correctly\nvalidate certain request sizes. A local attacker could exploit this to read\nportions of kernel memory, leading to a loss of privacy. (CVE-2010-2955)\n\nBen Hawkes discovered an integer overflow in the Controller Area Network\n(CVE-2010-2959)\n\nKees Cook discovered that the Intel i915 graphics driver did not correctly\nvalidate memory regions. A local attacker with access to the video card\ncould read and write arbitrary kernel memory to gain root privileges.\nUbuntu 10.10 was not affected. (CVE-2010-2962)\n\nKees Cook discovered that the V4L1 32bit compat interface did not correctly\nvalidate certain parameters. A local attacker on a 64bit system with access\nto a video device could exploit this to gain root privileges.\n(CVE-2010-2963)\n\nToshiyuki Okajima discovered that ext4 did not correctly check certain\nparameters. A local attacker could exploit this to crash the system or\noverwrite the last block of large files. (CVE-2010-3015)\n\nTavis Ormandy discovered that the AIO subsystem did not correctly validate\ncertain parameters. A local attacker could exploit this to crash the system\nor possibly gain root privileges. (CVE-2010-3067)\n\nDan Rosenberg discovered that certain XFS ioctls leaked kernel stack\ncontents. A local attacker could exploit this to read portions of kernel\nmemory, leading to a loss of privacy. (CVE-2010-3078)\n\nRobert Swiecki discovered that ftrace did not correctly handle mutexes. A\nlocal attacker could exploit this to crash the kernel, leading to a denial\nof service. (CVE-2010-3079)\n\nTavis Ormandy discovered that the OSS sequencer device did not correctly\nshut down. A local attacker could exploit this to crash the system or\npossibly gain root privileges. (CVE-2010-3080)\n\nBen Hawkes discovered that the Linux kernel did not correctly validate\nmemory ranges on 64bit kernels when allocating memory on behalf of 32bit\nsystem calls. On a 64bit system, a local attacker could perform malicious\nmulticast getsockopt calls to gain root privileges. (CVE-2010-3081)\n\nDan Rosenberg discovered that several network ioctls did not clear kernel\nmemory correctly. A local user could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-3296, CVE-2010-3297,\nCVE-2010-3298)\n\nBen Hawkes discovered that the Linux kernel did not correctly filter\nregisters on 64bit kernels when performing 32bit system calls. On a 64bit\nsystem, a local attacker could manipulate 32bit system calls to gain root\nprivileges. (CVE-2010-3301)\n\nDan Rosenberg discovered that the ROSE driver did not correctly check\nparameters. A local attacker with access to a ROSE network device could\nexploit this to crash the system or possibly gain root privileges.\n(CVE-2010-3310)\n\nThomas Dreibholz discovered that SCTP did not correctly handle appending\npacket chunks. A remote attacker could send specially crafted traffic to\ncrash the system, leading to a denial of service. (CVE-2010-3432)\n\nDan Rosenberg discovered that the CD driver did not correctly check\nparameters. A local attacker could exploit this to read arbitrary kernel\nmemory, leading to a loss of privacy. (CVE-2010-3437)\n\nDan Rosenberg discovered that the Sound subsystem did not correctly\nvalidate parameters. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-3442)\n\nDan Jacobson discovered that ThinkPad video output was not correctly access\ncontrolled. A local attacker could exploit this to hang the system, leading\nto a denial of service. (CVE-2010-3448)\n\nIt was discovered that KVM did not correctly initialize certain CPU\nregisters. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2010-3698)\n\nDan Rosenberg discovered that SCTP did not correctly handle HMAC\ncalculations. A remote attacker could send specially crafted traffic that\nwould crash the system, leading to a denial of service. (CVE-2010-3705)\n\nNelson Elhage discovered several problems with the Acorn Econet protocol\ndriver. A local user could cause a denial of service via a NULL pointer\ndereference, escalate privileges by overflowing the kernel stack, and\nassign Econet addresses to arbitrary interfaces. (CVE-2010-3848,\nCVE-2010-3849, CVE-2010-3850)\n\nBrad Spengler discovered that stack memory for new a process was not\ncorrectly calculated. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-3858)\n\nKees Cook discovered that the ethtool interface did not correctly clear\nkernel memory. A local attacker could read kernel heap memory, leading to a\nloss of privacy. (CVE-2010-3861)\n\nDan Rosenberg discovered that the RDS network protocol did not correctly\ncheck certain parameters. A local attacker could exploit this gain root\nprivileges. (CVE-2010-3904)\n\nKees Cook and Vasiliy Kulikov discovered that the shm interface did not\nclear kernel memory correctly. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-4072)\n\nDan Rosenberg discovered that IPC structures were not correctly initialized\non 64bit systems. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4073)\n\nDan Rosenberg discovered that the USB subsystem did not correctly\ninitialize certian structures. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-4074)\n\nDan Rosenberg discovered that the SiS video driver did not correctly clear\nkernel memory. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4078)\n\nDan Rosenberg discovered that the ivtv V4L driver did not correctly\ninitialize certian structures. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-4079)\n\nSteve Chen discovered that setsockopt did not correctly check MSS values. A\nlocal attacker could make a specially crafted socket call to crash the\nsystem, leading to a denial of service. (CVE-2010-4165)\n\nDave Jones discovered that the mprotect system call did not correctly\nhandle merged VMAs. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4169)\n\nVegard Nossum discovered that memory garbage collection was not handled\ncorrectly for active sockets. A local attacker could exploit this to\nallocate all available kernel memory, leading to a denial of service.\n(CVE-2010-4249)\n",
  "releases": {
    "karmic": {
      "sources": {
        "linux-fsl-imx51": {
          "version": "2.6.31-112.30",
          "description": "Linux kernel for FSL IMX51"
        }
      },
      "binaries": {
        "linux-image-2.6.31-112-imx51": {
          "version": "2.6.31-112.30"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31-112.30.diff.gz": {
              "md5": "eb5f6fe8ea1ba1541908b6635b6eb070",
              "size": 5689311
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31-112.30.dsc": {
              "md5": "9f183ebaeae4bc5f042e011c01a2d06b",
              "size": 1389
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31.orig.tar.gz": {
              "md5": "16c0355d3612806ef87addf7c9f8c9f9",
              "size": 78278595
            }
          }
        },
        "armel": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/linux-headers-2.6.31-112_2.6.31-112.30_armel.deb": {
              "md5": "69b7bc23b6a0ccd5911b8fe4279c89cb",
              "size": 9856034
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-usb-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "a66999a29ab17a23f464b124957e51f0",
              "size": 112192
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-shared-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "50564e0525ab647761b1011e145399a9",
              "size": 184568
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fs-core-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "a0b16b84ff81a28d19d0ce5afc919083",
              "size": 548480
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/linux-image-2.6.31-112-imx51_2.6.31-112.30_armel.deb": {
              "md5": "593a2caa4da514cdd0e8663a5aa19f64",
              "size": 14566916
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/plip-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "a46998bb3c8a1f786aa840c4949e4c95",
              "size": 8218
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/md-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "ad8a5437eeb796073116c0c60254e17c",
              "size": 163272
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nfs-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "8052e549fae8a4f8189a0f853c4825fe",
              "size": 294586
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/storage-core-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "cbe570516cc3851629929202ad80a4f3",
              "size": 21332
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fat-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "2c5d3a96da5f45c531bb20b423279fe7",
              "size": 4542
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/mouse-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "c30bdc42f9f1b087dd62b912ae0fc002",
              "size": 24552
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/scsi-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "53d973ce8597fa35e948f633296f512b",
              "size": 191494
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/usb-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "67f6388b95d37d032147638daf363e22",
              "size": 114184
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/crypto-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "808419d720380dacfc7aa71eb8447553",
              "size": 62012
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/block-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "be63ef29022f71ef81f0c5c0f7e5dff2",
              "size": 97392
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/ppp-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "657ccd6145488ad41b788472cb5137ae",
              "size": 36380
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/linux-headers-2.6.31-112-imx51_2.6.31-112.30_armel.deb": {
              "md5": "3602a6a08467cff3f063fa7d9acf4343",
              "size": 673916
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/kernel-image-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "1e25b9c4dd46cbbd61d0e2a2f7647f3e",
              "size": 3417494
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "0df28001acd3f1cf5aa96dba8756022a",
              "size": 236166
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/irda-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "7c76d661cb4f11fb53d61b795e8277f1",
              "size": 212326
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/input-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "37a00bbbcc9b929ad363ea7db629e405",
              "size": 50136
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fs-secondary-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "a0fb096a86472328492a20ee846da9ab",
              "size": 138382
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/serial-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "85515ab49064d8eab991be7b32d28551",
              "size": 93934
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/sata-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "56616f349c347568528cb7737e1863bb",
              "size": 15622
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/parport-modules-2.6.31-112-imx51-di_2.6.31-112.30_armel.udeb": {
              "md5": "546362055ae18b5c08f90e2eaf00b192",
              "size": 28190
            }
          }
        }
      }
    }
  },
  "title": "Linux kernel vulnerabilities",
  "timestamp": 1298678327.343176,
  "summary": "linux-fsl-imx51 vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n",
  "isummary": "Multiple kernel flaws.\n",
  "id": "USN-1074-1",
  "cves": [
    "CVE-2009-4895",
    "CVE-2010-2066",
    "CVE-2010-2226",
    "CVE-2010-2240",
    "CVE-2010-2248",
    "CVE-2010-2478",
    "CVE-2010-2495",
    "CVE-2010-2521",
    "CVE-2010-2524",
    "CVE-2010-2538",
    "CVE-2010-2798",
    "CVE-2010-2803",
    "CVE-2010-2942",
    "CVE-2010-2943",
    "CVE-2010-2946",
    "CVE-2010-2954",
    "CVE-2010-2955",
    "CVE-2010-2959",
    "CVE-2010-2962",
    "CVE-2010-2963",
    "CVE-2010-3015",
    "CVE-2010-3067",
    "CVE-2010-3078",
    "CVE-2010-3079",
    "CVE-2010-3080",
    "CVE-2010-3081",
    "CVE-2010-3084",
    "CVE-2010-3296",
    "CVE-2010-3297",
    "CVE-2010-3298",
    "CVE-2010-3301",
    "CVE-2010-3310",
    "CVE-2010-3432",
    "CVE-2010-3437",
    "CVE-2010-3442",
    "CVE-2010-3448",
    "CVE-2010-3477",
    "CVE-2010-3698",
    "CVE-2010-3705",
    "CVE-2010-3848",
    "CVE-2010-3849",
    "CVE-2010-3850",
    "CVE-2010-3858",
    "CVE-2010-3861",
    "CVE-2010-3904",
    "CVE-2010-4072",
    "CVE-2010-4073",
    "CVE-2010-4074",
    "CVE-2010-4078",
    "CVE-2010-4079",
    "CVE-2010-4165",
    "CVE-2010-4169",
    "CVE-2010-4249"
  ]
}