{
  "description": "USN-3849-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nIt was discovered that a NULL pointer dereference existed in the keyring\nsubsystem of the Linux kernel. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2017-2647)\n\nIt was discovered that a race condition existed in the raw MIDI driver for\nthe Linux kernel, leading to a double free vulnerability. A local attacker\ncould use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2018-10902)\n\nIt was discovered that an integer overrun vulnerability existed in the\nPOSIX timers implementation in the Linux kernel. A local attacker could use\nthis to cause a denial of service. (CVE-2018-12896)\n\nNoam Rathaus discovered that a use-after-free vulnerability existed in the\nInfiniband implementation in the Linux kernel. An attacker could use this\nto cause a denial of service (system crash). (CVE-2018-14734)\n\nIt was discovered that the YUREX USB device driver for the Linux kernel did\nnot properly restrict user space reads or writes. A physically proximate\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2018-16276)\n\nTetsuo Handa discovered a logic error in the TTY subsystem of the Linux\nkernel. A local attacker with access to pseudo terminal devices could use\nthis to cause a denial of service. (CVE-2018-18386)\n\nKanda Motohiro discovered that writing extended attributes to an XFS file\nsystem in the Linux kernel in certain situations could cause an error\ncondition to occur. A local attacker could use this to cause a denial of\nservice. (CVE-2018-18690)\n\nIt was discovered that an integer overflow vulnerability existed in the\nCDROM driver of the Linux kernel. A local attacker could use this to expose\nsensitive information (kernel memory). (CVE-2018-18710)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-164.214~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-3.13.0-164-generic": {
          "version": "3.13.0-164.214~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.164.154"
        },
        "linux-image-3.13.0-164-generic-lpae": {
          "version": "3.13.0-164.214~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.164.154"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1545349147.423471,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "isummary": "Several security issues were fixed in the Linux kernel.\n",
  "id": "USN-3849-2",
  "cves": [
    "CVE-2017-2647",
    "CVE-2018-10902",
    "CVE-2018-12896",
    "CVE-2018-14734",
    "CVE-2018-16276",
    "CVE-2018-18386",
    "CVE-2018-18690",
    "CVE-2018-18710"
  ]
}