{
  "description": "USN-3880-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nIt was discovered that the CIFS client implementation in the Linux kernel\ndid not properly handle setup negotiation during session recovery, leading\nto a NULL pointer exception. An attacker could use this to create a\nmalicious CIFS server that caused a denial of service (client system\ncrash). (CVE-2018-1066)\n\nJann Horn discovered that the procfs file system implementation in the\nLinux kernel did not properly restrict the ability to inspect the kernel\nstack of an arbitrary task. A local attacker could use this to expose\nsensitive information. (CVE-2018-17972)\n\nJann Horn discovered that the mremap() system call in the Linux kernel did\nnot properly flush the TLB when completing, potentially leaving access to a\nphysical page after it has been released to the page allocator. A local\nattacker could use this to cause a denial of service (system crash), expose\nsensitive information, or possibly execute arbitrary code. (CVE-2018-18281)\n\nIt was discovered that the socket implementation in the Linux kernel\ncontained a type confusion error that could lead to memory corruption. A\nlocal attacker could use this to cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2018-9568)\n",
  "releases": {
    "precise": {
      "allbinaries": {
        "linux-image-3.13.0-165-generic": {
          "version": "3.13.0-165.215~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.165.155"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.165.155"
        },
        "linux-image-3.13.0-165-generic-lpae": {
          "version": "3.13.0-165.215~precise1"
        }
      },
      "binaries": {
        "linux-image-3.13.0-165-generic": {
          "version": "3.13.0-165.215~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.165.155"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.165.155"
        },
        "linux-image-3.13.0-165-generic-lpae": {
          "version": "3.13.0-165.215~precise1"
        }
      },
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-165.215~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1549322706.535416,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2018-1066",
    "CVE-2018-17972",
    "CVE-2018-18281",
    "CVE-2018-9568"
  ],
  "id": "USN-3880-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}