{
  "description": "It was discovered that the alarmtimer implementation in the Linux kernel\ncontained an integer overflow vulnerability. A local attacker could use\nthis to cause a denial of service. (CVE-2018-13053)\n\nWen Xu discovered that the XFS filesystem implementation in the Linux\nkernel did not properly track inode validations. An attacker could use this\nto construct a malicious XFS image that, when mounted, could cause a denial\nof service (system crash). (CVE-2018-13093)\n\nWen Xu discovered that the f2fs file system implementation in the Linux\nkernel did not properly validate metadata. An attacker could use this to\nconstruct a malicious f2fs image that, when mounted, could cause a denial\nof service (system crash). (CVE-2018-13096, CVE-2018-13097, CVE-2018-13098,\nCVE-2018-13099, CVE-2018-13100, CVE-2018-14614, CVE-2018-14615,\nCVE-2018-14616)\n\nWen Xu and Po-Ning Tseng discovered that btrfs file system implementation\nin the Linux kernel did not properly validate metadata. An attacker could\nuse this to construct a malicious btrfs image that, when mounted, could\ncause a denial of service (system crash). (CVE-2018-14609, CVE-2018-14610,\nCVE-2018-14611, CVE-2018-14612, CVE-2018-14613)\n\nWen Xu discovered that the HFS+ filesystem implementation in the Linux\nkernel did not properly handle malformed catalog data in some situations.\nAn attacker could use this to construct a malicious HFS+ image that, when\nmounted, could cause a denial of service (system crash). (CVE-2018-14617)\n\nVasily Averin and Pavel Tikhomirov discovered that the cleancache subsystem\nof the Linux kernel did not properly initialize new files in some\nsituations. A local attacker could use this to expose sensitive\ninformation. (CVE-2018-16862)\n\nHui Peng and Mathias Payer discovered that the Option USB High Speed driver\nin the Linux kernel did not properly validate metadata received from the\ndevice. A physically proximate attacker could use this to cause a denial of\nservice (system crash). (CVE-2018-19985)\n\nHui Peng and Mathias Payer discovered that the USB subsystem in the Linux\nkernel did not properly handle size checks when handling an extra USB\ndescriptor. A physically proximate attacker could use this to cause a\ndenial of service (system crash). (CVE-2018-20169)\n\nZhipeng Xie discovered that an infinite loop could be triggered in the CFS\nLinux kernel process scheduler. A local attacker could possibly use this to\ncause a denial of service. (CVE-2018-20784)\n\nIt was discovered that a use-after-free error existed in the block layer\nsubsystem of the Linux kernel when certain failure conditions occurred. A\nlocal attacker could possibly use this to cause a denial of service (system\ncrash) or possibly execute arbitrary code. (CVE-2018-20856)\n\nEli Biham and Lior Neumann discovered that the Bluetooth implementation in\nthe Linux kernel did not properly validate elliptic curve parameters during\nDiffie-Hellman key exchange in some situations. An attacker could use this\nto expose sensitive information. (CVE-2018-5383)\n\nIt was discovered that the Intel Wi-Fi device driver in the Linux kernel did\nnot properly validate certain Tunneled Direct Link Setup (TDLS). A\nphysically proximate attacker could use this to cause a denial of service\n(Wi-Fi disconnect). (CVE-2019-0136)\n\nIt was discovered that a heap buffer overflow existed in the Marvell\nWireless LAN device driver for the Linux kernel. An attacker could use this\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2019-10126)\n\nIt was discovered that the Bluetooth UART implementation in the Linux\nkernel did not properly check for missing tty operations. A local attacker\ncould use this to cause a denial of service. (CVE-2019-10207)\n\nAmit Klein and Benny Pinkas discovered that the Linux kernel did not\nsufficiently randomize IP ID values generated for connectionless networking\nprotocols. A remote attacker could use this to track particular Linux\ndevices. (CVE-2019-10638)\n\nAmit Klein and Benny Pinkas discovered that the location of kernel\naddresses could be exposed by the implementation of connection-less network\nprotocols in the Linux kernel. A remote attacker could possibly use this to\nassist in the exploitation of another vulnerability in the Linux kernel.\n(CVE-2019-10639)\n\nAdam Zabrocki discovered that the Intel i915 kernel mode graphics driver in\nthe Linux kernel did not properly restrict mmap() ranges in some\nsituations. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2019-11085)\n\nIt was discovered that an integer overflow existed in the Linux kernel when\nreference counting pages, leading to potential use-after-free issues. A\nlocal attacker could use this to cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2019-11487)\n\nJann Horn discovered that a race condition existed in the Linux kernel when\nperforming core dumps. A local attacker could use this to cause a denial of\nservice (system crash) or expose sensitive information. (CVE-2019-11599)\n\nIt was discovered that a null pointer dereference vulnerability existed in\nthe LSI Logic MegaRAID driver in the Linux kernel. A local attacker could\nuse this to cause a denial of service (system crash). (CVE-2019-11810)\n\nIt was discovered that a race condition leading to a use-after-free existed\nin the Reliable Datagram Sockets (RDS) protocol implementation in the Linux\nkernel. The RDS protocol is disabled via blocklist by default in Ubuntu. \nIf enabled, a local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2019-11815)\n\nIt was discovered that the ext4 file system implementation in the Linux\nkernel did not properly zero out memory in some situations. A local\nattacker could use this to expose sensitive information (kernel memory).\n(CVE-2019-11833)\n\nIt was discovered that the Bluetooth Human Interface Device Protocol (HIDP)\nimplementation in the Linux kernel did not properly verify strings were\nNULL terminated in certain situations. A local attacker could use this to\nexpose sensitive information (kernel memory). (CVE-2019-11884)\n\nIt was discovered that a NULL pointer dereference vulnerabilty existed in\nthe Near-field communication (NFC) implementation in the Linux kernel. An\nattacker could use this to cause a denial of service (system crash).\n(CVE-2019-12818)\n\nIt was discovered that the MDIO bus devices subsystem in the Linux kernel\nimproperly dropped a device reference in an error condition, leading to a\nuse-after-free. An attacker could use this to cause a denial of service\n(system crash). (CVE-2019-12819)\n\nIt was discovered that a NULL pointer dereference vulnerability existed in\nthe Near-field communication (NFC) implementation in the Linux kernel. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2019-12984)\n\nJann Horn discovered a use-after-free vulnerability in the Linux kernel\nwhen accessing LDT entries in some situations. A local attacker could use\nthis to cause a denial of service (system crash) or possibly execute\narbitrary code. (CVE-2019-13233)\n\nJann Horn discovered that the ptrace implementation in the Linux kernel did\nnot properly record credentials in some situations. A local attacker could\nuse this to cause a denial of service (system crash) or possibly gain\nadministrative privileges. (CVE-2019-13272)\n\nIt was discovered that the GTCO tablet input driver in the Linux kernel did\nnot properly bounds check the initial HID report sent by the device. A\nphysically proximate attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2019-13631)\n\nIt was discovered that the floppy driver in the Linux kernel did not\nproperly validate meta data, leading to a buffer overread. A local attacker\ncould use this to cause a denial of service (system crash).\n(CVE-2019-14283)\n\nIt was discovered that the floppy driver in the Linux kernel did not\nproperly validate ioctl() calls, leading to a division-by-zero. A local\nattacker could use this to cause a denial of service (system crash).\n(CVE-2019-14284)\n\nTuba Yavuz discovered that a race condition existed in the DesignWare USB3\nDRD Controller device driver in the Linux kernel. A physically proximate\nattacker could use this to cause a denial of service. (CVE-2019-14763)\n\nIt was discovered that an out-of-bounds read existed in the QLogic QEDI\niSCSI Initiator Driver in the Linux kernel. A local attacker could possibly\nuse this to expose sensitive information (kernel memory). (CVE-2019-15090)\n\nIt was discovered that the Raremono AM/FM/SW radio device driver in the\nLinux kernel did not properly allocate memory, leading to a use-after-free.\nA physically proximate attacker could use this to cause a denial of service\nor possibly execute arbitrary code. (CVE-2019-15211)\n\nIt was discovered at a double-free error existed in the USB Rio 500 device\ndriver for the Linux kernel. A physically proximate attacker could use this\nto cause a denial of service. (CVE-2019-15212)\n\nIt was discovered that a race condition existed in the Advanced Linux Sound\nArchitecture (ALSA) subsystem of the Linux kernel, leading to a potential\nuse-after-free. A physically proximate attacker could use this to cause a\ndenial of service (system crash) or possibly execute arbitrary code.\n(CVE-2019-15214)\n\nIt was discovered that a race condition existed in the CPiA2 video4linux\ndevice driver for the Linux kernel, leading to a use-after-free. A\nphysically proximate attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2019-15215)\n\nIt was discovered that a race condition existed in the Softmac USB Prism54\ndevice driver in the Linux kernel. A physically proximate attacker could\nuse this to cause a denial of service (system crash). (CVE-2019-15220)\n\nIt was discovered that a use-after-free vulnerability existed in the\nAppleTalk implementation in the Linux kernel if an error occurs during\ninitialization. A local attacker could use this to cause a denial of\nservice (system crash). (CVE-2019-15292)\n\nIt was discovered that the Empia EM28xx DVB USB device driver\nimplementation in the Linux kernel contained a use-after-free vulnerability\nwhen disconnecting the device. An attacker could use this to cause a denial\nof service (system crash). (CVE-2019-2024)\n\nIt was discovered that the USB video device class implementation in the\nLinux kernel did not properly validate control bits, resulting in an out of\nbounds buffer read. A local attacker could use this to possibly expose\nsensitive information (kernel memory). (CVE-2019-2101)\n\nIt was discovered that the Marvell Wireless LAN device driver in the Linux\nkernel did not properly validate the BSS descriptor. A local attacker could\npossibly use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2019-3846)\n\nJason Wang discovered that an infinite loop vulnerability existed in the\nvirtio net driver in the Linux kernel. A local attacker in a guest VM could\npossibly use this to cause a denial of service in the host system.\n(CVE-2019-3900)\n\nDaniele Antonioli, Nils Ole Tippenhauer, and Kasper B. Rasmussen discovered\nthat the Bluetooth protocol BR/EDR specification did not properly require\nsufficiently strong encryption key lengths. A physically proximate attacker\ncould use this to expose sensitive information. (CVE-2019-9506)\n\nIt was discovered that the Appletalk IP encapsulation driver in the Linux\nkernel did not properly prevent kernel addresses from being copied to user\nspace. A local attacker with the CAP_NET_ADMIN capability could use this to\nexpose sensitive information. (CVE-2018-20511)\n\nIt was discovered that a race condition existed in the USB YUREX device\ndriver in the Linux kernel. A physically proximate attacker could use this\nto cause a denial of service (system crash). (CVE-2019-15216)\n\nIt was discovered that the Siano USB MDTV receiver device driver in the\nLinux kernel made improper assumptions about the device characteristics. A\nphysically proximate attacker could use this cause a denial of service\n(system crash). (CVE-2019-15218)\n\nIt was discovered that the Line 6 POD USB device driver in the Linux kernel\ndid not properly validate data size information from the device. A\nphysically proximate attacker could use this to cause a denial of service\n(system crash). (CVE-2019-15221)\n\nMuyu Yu discovered that the CAN implementation in the Linux kernel in some\nsituations did not properly restrict the field size when processing\noutgoing frames. A local attacker with CAP_NET_ADMIN privileges could use\nthis to execute arbitrary code. (CVE-2019-3701)\n\nVladis Dronov discovered that the debug interface for the Linux kernel's\nHID subsystem did not properly validate passed parameters in some\nsituations. A local privileged attacker could use this to cause a denial of\nservice (infinite loop). (CVE-2019-3819)\n",
  "releases": {
    "bionic": {
      "allbinaries": {
        "linux-image-4.15.0-1047-aws": {
          "pocket": "security",
          "source": "linux-aws",
          "version": "4.15.0-1047.49"
        },
        "linux-image-aws": {
          "pocket": "security",
          "source": "linux-meta-aws",
          "version": "4.15.0.1047.46"
        }
      },
      "binaries": {
        "linux-image-4.15.0-1047-aws": {
          "pocket": "security",
          "version": "4.15.0-1047.49"
        },
        "linux-image-aws": {
          "pocket": "security",
          "version": "4.15.0.1047.46"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-aws_4.15.0-1047.49.diff.gz": {
              "md5": "859a6655510d40004acbc613447fbce7",
              "size": 9109660
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-aws/linux-meta-aws_4.15.0.1047.46.dsc": {
              "md5": "536fc01b680d7fe09c143c35db3be25b",
              "size": 1902
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-aws/linux-meta-aws_4.15.0.1047.46.tar.xz": {
              "md5": "abd3802a2ec64840ea7c611d1d30ff4e",
              "size": 5948
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-aws_4.15.0.orig.tar.gz": {
              "md5": "dd5a75343cd956de12e8d26e1805ca92",
              "size": 157656459
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-aws_4.15.0-1047.49.dsc": {
              "md5": "0ec72309a982ebe5bdc56f4172ef5d5c",
              "size": 4205
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-aws-headers-4.15.0-1047_4.15.0-1047.49_all.deb": {
              "md5": "259242fedb7ce4d7a01a29e9c584fcb8",
              "size": 11058320
            }
          }
        },
        "amd64": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-image-4.15.0-1047-aws_4.15.0-1047.49_amd64.deb": {
              "md5": "dcc93ec6a7ac506c98da81f4587f72bc",
              "size": 7776980
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-modules-extra-4.15.0-1047-aws_4.15.0-1047.49_amd64.deb": {
              "md5": "faca46efe5ecd8999a4604bc0ad0d6c6",
              "size": 18440668
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-aws/linux-tools-aws_4.15.0.1047.46_amd64.deb": {
              "md5": "aa258c74069a4d73777f49640edb82e0",
              "size": 2520
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-tools-4.15.0-1047-aws_4.15.0-1047.49_amd64.deb": {
              "md5": "3dab7bf4012c36f80319059f57adffba",
              "size": 1960
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-modules-4.15.0-1047-aws_4.15.0-1047.49_amd64.deb": {
              "md5": "e6f4d21ff2c4d75ebb8e7d4f3c9883c0",
              "size": 12602684
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-aws-tools-4.15.0-1047_4.15.0-1047.49_amd64.deb": {
              "md5": "205ae64fa54ae13c3e159c7b50dbe7e5",
              "size": 4557308
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-aws/linux-headers-aws_4.15.0.1047.46_amd64.deb": {
              "md5": "60cfbde7f4d19aa00efb0ef655b002bd",
              "size": 2512
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-buildinfo-4.15.0-1047-aws_4.15.0-1047.49_amd64.deb": {
              "md5": "0b34ee5cc388589f134b54c5a0ef4000",
              "size": 326588
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-aws/linux-headers-4.15.0-1047-aws_4.15.0-1047.49_amd64.deb": {
              "md5": "d9248e2ed3bf9fe22f952adc94287730",
              "size": 1118460
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-aws/linux-image-aws_4.15.0.1047.46_amd64.deb": {
              "md5": "90634d29a9416608b01fcb871771ebd8",
              "size": 2508
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-aws/linux-aws_4.15.0.1047.46_amd64.deb": {
              "md5": "ad7722b4177734e63ba1fd33d3f7f40d",
              "size": 1880
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-aws/linux-modules-extra-aws_4.15.0.1047.46_amd64.deb": {
              "md5": "c4b14c2aea75f7673c1b44456af7fd4c",
              "size": 2520
            }
          }
        },
        "arm64": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-buildinfo-4.15.0-1047-aws_4.15.0-1047.49_arm64.deb": {
              "md5": "4caafad4a8c400ead5b247d1db6bd39c",
              "size": 362396
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-aws/linux-image-aws_4.15.0.1047.46_arm64.deb": {
              "md5": "a79f0d651f7c96fea862345049580508",
              "size": 2508
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-aws-tools-4.15.0-1047_4.15.0-1047.49_arm64.deb": {
              "md5": "2d9f84d98cfeb8a3a821f94a341a8845",
              "size": 4114500
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-aws/linux-headers-aws_4.15.0.1047.46_arm64.deb": {
              "md5": "9461b40013764b263577c105fd167d71",
              "size": 2512
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-aws/linux-aws_4.15.0.1047.46_arm64.deb": {
              "md5": "78cd35e84b5532bb3d5465589c63c1a4",
              "size": 1880
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-modules-4.15.0-1047-aws_4.15.0-1047.49_arm64.deb": {
              "md5": "e75f4f5fb0b0598d44f2ded958903eff",
              "size": 11957084
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-cloud-tools-4.15.0-1047-aws_4.15.0-1047.49_arm64.deb": {
              "md5": "993c12587aa4a396aae0fbf8260d94da",
              "size": 1868
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-aws/linux-modules-extra-aws_4.15.0.1047.46_arm64.deb": {
              "md5": "07256cb523eec288fb84a7138d471173",
              "size": 2520
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-headers-4.15.0-1047-aws_4.15.0-1047.49_arm64.deb": {
              "md5": "f3203ed60db033dece80a49ed68c3793",
              "size": 853912
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-aws/linux-tools-aws_4.15.0.1047.46_arm64.deb": {
              "md5": "1380221d8c8d583789474a47454f49c5",
              "size": 2520
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-aws-cloud-tools-4.15.0-1047_4.15.0-1047.49_arm64.deb": {
              "md5": "3cd19a8c186d4cbb920ea3654c5df496",
              "size": 185084
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-image-4.15.0-1047-aws_4.15.0-1047.49_arm64.deb": {
              "md5": "6063abfbc25eb43dfb77a8a1b1ac6901",
              "size": 8396324
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-modules-extra-4.15.0-1047-aws_4.15.0-1047.49_arm64.deb": {
              "md5": "eea14df5f94d5e3a5b9bd355171a1b37",
              "size": 29616536
            },
            "http://ports.ubuntu.com/pool/main/l/linux-aws/linux-tools-4.15.0-1047-aws_4.15.0-1047.49_arm64.deb": {
              "md5": "718a86e328db81297faf5aab92aff600",
              "size": 1892
            }
          }
        }
      },
      "sources": {
        "linux-aws": {
          "version": "4.15.0-1047.49",
          "description": "Linux kernel for Amazon Web Services (AWS) systems"
        }
      }
    },
    "xenial": {
      "allbinaries": {
        "linux-image-4.15.0-1047-aws": {
          "pocket": "security",
          "source": "linux-aws-hwe",
          "version": "4.15.0-1047.49~16.04.1"
        },
        "linux-image-aws-hwe": {
          "pocket": "security",
          "source": "linux-meta-aws-hwe",
          "version": "4.15.0.1047.47"
        }
      },
      "binaries": {
        "linux-image-4.15.0-1047-aws": {
          "pocket": "security",
          "version": "4.15.0-1047.49~16.04.1"
        },
        "linux-image-aws-hwe": {
          "pocket": "security",
          "version": "4.15.0.1047.47"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-aws-hwe_4.15.0.orig.tar.gz": {
              "md5": "dd5a75343cd956de12e8d26e1805ca92",
              "size": 157656459
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-aws-hwe_4.15.0-1047.49~16.04.1.diff.gz": {
              "md5": "d81e88ac1f0fb57f35a309525e35d4e5",
              "size": 10056135
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-meta-aws-hwe_4.15.0.1047.47.tar.gz": {
              "md5": "f47402f9ebfe85c8bc6019dff23c6abb",
              "size": 6157
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-meta-aws-hwe_4.15.0.1047.47.dsc": {
              "md5": "a6c897348108257b47d150d94e7c909c",
              "size": 1757
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-aws-hwe_4.15.0-1047.49~16.04.1.dsc": {
              "md5": "2e55f444736cb58bbdb1296830b60629",
              "size": 3906
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-aws-headers-4.15.0-1047_4.15.0-1047.49~16.04.1_all.deb": {
              "md5": "9ddf5022c4cf880bd8e0cfb496453f8e",
              "size": 11033898
            }
          }
        },
        "amd64": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-aws-hwe_4.15.0.1047.47_amd64.deb": {
              "md5": "44871e49e940b757eb2e4988623db4fc",
              "size": 1802
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-modules-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_amd64.deb": {
              "md5": "a41c16e0b3012c310de49bad33b9bfa1",
              "size": 12548082
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-tools-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_amd64.deb": {
              "md5": "e475d8e728c38c3969b6a2e4d7de5c25",
              "size": 1918
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-modules-extra-aws-hwe_4.15.0.1047.47_amd64.deb": {
              "md5": "7707a85b689d407c19da21add00f6026",
              "size": 2456
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-headers-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_amd64.deb": {
              "md5": "c348f6fb8a4e0ae18c2cd4c69a353e26",
              "size": 1109842
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-aws-hwe-tools-4.15.0-1047_4.15.0-1047.49~16.04.1_amd64.deb": {
              "md5": "0a604af9813a3d6ff3d5d8e172f96713",
              "size": 3984518
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-tools-aws-hwe_4.15.0.1047.47_amd64.deb": {
              "md5": "297bd7a92bb2196344b9680f9d235e9f",
              "size": 2434
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-image-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_amd64.deb": {
              "md5": "c3e019fd9d0b9d2275d10b06643f154d",
              "size": 7781398
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-aws-edge_4.15.0.1047.47_amd64.deb": {
              "md5": "cb91eadfdf16d4f602bda6cb6a095f94",
              "size": 1772
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-headers-aws-hwe_4.15.0.1047.47_amd64.deb": {
              "md5": "49723e34f984b81297ac298da349534e",
              "size": 2430
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-meta-aws-hwe/linux-image-aws-hwe_4.15.0.1047.47_amd64.deb": {
              "md5": "eb1337a222e5d8ba98a21a5b19b08702",
              "size": 2426
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-buildinfo-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_amd64.deb": {
              "md5": "1fdc7a60e4ee8d46aac1e22d9ad8099e",
              "size": 332582
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-aws-hwe/linux-modules-extra-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_amd64.deb": {
              "md5": "3b96e76ea4065fd3a43681cac6f70532",
              "size": 18387846
            }
          }
        },
        "arm64": {
          "urls": {
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-aws-hwe-cloud-tools-4.15.0-1047_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "5974e5b0c271625f6e2a5147e6bec158",
              "size": 189772
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-tools-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "53a0333fb686f098c52a3275f87688d7",
              "size": 1842
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-meta-aws-hwe/linux-image-aws-hwe_4.15.0.1047.47_arm64.deb": {
              "md5": "228ec07eef569cc8f77e594e91ed117d",
              "size": 2426
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-meta-aws-hwe/linux-modules-extra-aws-hwe_4.15.0.1047.47_arm64.deb": {
              "md5": "0668305cd88618226b9941ae96a8e45b",
              "size": 2460
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-meta-aws-hwe/linux-tools-aws-hwe_4.15.0.1047.47_arm64.deb": {
              "md5": "0b23e3f3fd401885a37d602e1c0db7f9",
              "size": 2430
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-meta-aws-hwe/linux-headers-aws-hwe_4.15.0.1047.47_arm64.deb": {
              "md5": "b68873e0cafb20214b7d10ea10c7fab4",
              "size": 2430
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-aws-hwe-tools-4.15.0-1047_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "340f760f0327e685df05ec9bd1a31c6c",
              "size": 3623812
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-headers-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "f01840a8f783575bc1af853bd5ac3982",
              "size": 867706
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-modules-extra-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "a7b371b5d494090d41e3b0fab04456a6",
              "size": 29221412
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-image-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "89ffe12086f0772cb56c6e9872587104",
              "size": 8228924
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-modules-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "b56c39ec5068371afd58f322a5140305",
              "size": 11775590
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-meta-aws-hwe/linux-aws-edge_4.15.0.1047.47_arm64.deb": {
              "md5": "c0bb34e92f810e304bc52847da008605",
              "size": 1776
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-cloud-tools-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "05f154074494cd5a44dcf8f2d8ef553a",
              "size": 1820
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-aws-hwe/linux-buildinfo-4.15.0-1047-aws_4.15.0-1047.49~16.04.1_arm64.deb": {
              "md5": "1e5f5425b19c20cfa17f29e8cdca5563",
              "size": 367136
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-meta-aws-hwe/linux-aws-hwe_4.15.0.1047.47_arm64.deb": {
              "md5": "c60ac00d7548d0b9f01d33f94b172117",
              "size": 1802
            }
          }
        }
      },
      "sources": {
        "linux-aws-hwe": {
          "version": "4.15.0-1047.49~16.04.1",
          "description": "Linux kernel for Amazon Web Services (AWS-HWE) systems"
        }
      }
    }
  },
  "title": "Linux kernel (AWS) vulnerabilities",
  "timestamp": 1567460073.075167,
  "summary": "linux-aws vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "isummary": "Several security issues were fixed in the Linux kernel.\n",
  "id": "USN-4118-1",
  "cves": [
    "CVE-2018-13053",
    "CVE-2018-13093",
    "CVE-2018-13096",
    "CVE-2018-13097",
    "CVE-2018-13098",
    "CVE-2018-13099",
    "CVE-2018-13100",
    "CVE-2018-14609",
    "CVE-2018-14610",
    "CVE-2018-14611",
    "CVE-2018-14612",
    "CVE-2018-14613",
    "CVE-2018-14614",
    "CVE-2018-14615",
    "CVE-2018-14616",
    "CVE-2018-14617",
    "CVE-2018-16862",
    "CVE-2018-19985",
    "CVE-2018-20169",
    "CVE-2018-20511",
    "CVE-2018-20784",
    "CVE-2018-20856",
    "CVE-2018-5383",
    "CVE-2019-0136",
    "CVE-2019-10126",
    "CVE-2019-10207",
    "CVE-2019-10638",
    "CVE-2019-10639",
    "CVE-2019-11085",
    "CVE-2019-11487",
    "CVE-2019-11599",
    "CVE-2019-11810",
    "CVE-2019-11815",
    "CVE-2019-11833",
    "CVE-2019-11884",
    "CVE-2019-12818",
    "CVE-2019-12819",
    "CVE-2019-12984",
    "CVE-2019-13233",
    "CVE-2019-13272",
    "CVE-2019-13631",
    "CVE-2019-14283",
    "CVE-2019-14284",
    "CVE-2019-14763",
    "CVE-2019-15090",
    "CVE-2019-15211",
    "CVE-2019-15212",
    "CVE-2019-15214",
    "CVE-2019-15215",
    "CVE-2019-15216",
    "CVE-2019-15218",
    "CVE-2019-15220",
    "CVE-2019-15221",
    "CVE-2019-15292",
    "CVE-2019-2024",
    "CVE-2019-2101",
    "CVE-2019-3701",
    "CVE-2019-3819",
    "CVE-2019-3846",
    "CVE-2019-3900",
    "CVE-2019-9506"
  ]
}