{
  "description": "USN-5348-1 fixed several vulnerabilities in Smarty. This update provides\nthe fixes for CVE-2021-21408, CVE-2021-26119, CVE-2021-26120 and\nCVE-2021-29454 for Ubuntu 20.04 ESM.\n\nOriginal advisory details:\n\n David Gnedt and Thomas Konrad discovered that Smarty was incorrectly\n sanitizing the paths present in the templates. An attacker could possibly\n use this use to read arbitrary files when controlling the executed\n template. (CVE-2018-13982)\n\n It was discovered that Smarty was incorrectly sanitizing the paths\n present in the templates. An attacker could possibly use this use to read\n arbitrary files when controlling the executed template. (CVE-2018-16831)\n\n It was discovered that Smarty was incorrectly validating security policy\n data, allowing the execution of static classes even when not permitted by\n the security settings. An attacker could possibly use this issue to\n execute arbitrary code. (CVE-2021-21408)\n\n It was discovered that Smarty was incorrectly managing access control to\n template objects, which allowed users to perform a sandbox escape. An\n attacker could possibly use this issue to send specially crafted input to\n applications that use Smarty and execute arbitrary code. (CVE-2021-26119)\n\n It was discovered that Smarty was not checking for special characters\n when setting function names during plugin compile operations. An attacker\n could possibly use this issue to send specially crafted input to\n applications that use Smarty and execute arbitrary code. (CVE-2021-26120)\n\n It was discovered that Smarty was incorrectly sanitizing characters in\n math strings processed by the math function. An attacker could possibly\n use this issue to send specially crafted input to applications that use\n Smarty and execute arbitrary code. (CVE-2021-29454)\n",
  "releases": {
    "focal": {
      "sources": {
        "smarty3": {
          "version": "3.1.34+20190228.1.c9f0de05+selfpack1-1ubuntu0.1~esm1",
          "description": "Smarty - the compiling PHP template engine"
        }
      },
      "binaries": {
        "smarty3": {
          "pocket": "esm-apps",
          "version": "3.1.34+20190228.1.c9f0de05+selfpack1-1ubuntu0.1~esm1"
        }
      },
      "allbinaries": {
        "smarty3": {
          "pocket": "esm-apps",
          "source": "smarty3",
          "version": "3.1.34+20190228.1.c9f0de05+selfpack1-1ubuntu0.1~esm1"
        }
      }
    }
  },
  "title": "Smarty vulnerabilities",
  "timestamp": 1655825365.781864,
  "summary": "smarty3 vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "is_hidden": "false",
  "cves": [
    "CVE-2021-21408",
    "CVE-2021-26119",
    "CVE-2021-26120",
    "CVE-2021-29454"
  ],
  "id": "USN-5348-3",
  "isummary": "Several security issues were fixed in Smarty.\n"
}