{
  "description": "Joseph Nuzman discovered that some Intel processors did not properly\ninitialise shared resources. A local attacker could use this to obtain\nsensitive information. (CVE-2021-0145)\n\nMark Ermolov, Dmitry Sklyarov and Maxim Goryachy discovered that some Intel\nprocessors did not prevent test and debug logic from being activated at\nruntime. A local attacker could use this to escalate\nprivileges. (CVE-2021-0146)\n\nIt was discovered that some Intel processors did not implement sufficient\ncontrol flow management. A local attacker could use this to cause a denial\nof service (system crash). (CVE-2021-0127)\n\nIt was discovered that some Intel processors did not completely perform\ncleanup actions on multi-core shared buffers. A local attacker could\npossibly use this to expose sensitive information. (CVE-2022-21123,\nCVE-2022-21127)\n\nIt was discovered that some Intel processors did not completely perform\ncleanup actions on microarchitectural fill buffers. A local attacker could\npossibly use this to expose sensitive information. (CVE-2022-21125)\n\nAlysa Milburn, Jason Brandt, Avishai Redelman and Nir Lavi discovered that\nsome Intel processors improperly optimised security-critical code. A local\nattacker could possibly use this to expose sensitive\ninformation. (CVE-2022-21151)\n\nIt was discovered that some Intel processors did not properly perform\ncleanup during specific special register write operations. A local attacker\ncould possibly use this to expose sensitive information. (CVE-2022-21166)\n\nIt was discovered that some Intel processors did not properly restrict\naccess in some situations. A local attacker could use this to obtain\nsensitive information. (CVE-2021-33117)\n\nBrandon Miller discovered that some Intel processors did not properly\nrestrict access in some situations. A local attacker could use this to\nobtain sensitive information or a remote attacker could use this to\ncause a denial of service (system crash). (CVE-2021-33120)\n",
  "releases": {
    "xenial": {
      "allbinaries": {
        "intel-microcode": {
          "pocket": "esm-infra",
          "source": "intel-microcode",
          "version": "3.20220510.0ubuntu0.16.04.1+esm1"
        }
      },
      "binaries": {
        "intel-microcode": {
          "pocket": "esm-infra",
          "version": "3.20220510.0ubuntu0.16.04.1+esm1"
        }
      },
      "sources": {
        "intel-microcode": {
          "version": "3.20220510.0ubuntu0.16.04.1+esm1",
          "description": "Processor microcode for Intel CPUs"
        }
      }
    }
  },
  "title": "Intel Microcode vulnerabilities",
  "timestamp": 1658986283.1581652,
  "summary": "Intel Microcode vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "isummary": "Several security issues were fixed in Intel Microcode.\n",
  "id": "USN-5535-1",
  "cves": [
    "CVE-2021-0127",
    "CVE-2021-0145",
    "CVE-2021-0146",
    "CVE-2021-33117",
    "CVE-2021-33120",
    "CVE-2022-21123",
    "CVE-2022-21125",
    "CVE-2022-21127",
    "CVE-2022-21151",
    "CVE-2022-21166"
  ]
}