{
  "description": "USN-5956-1 fixed vulnerabilities in PHPMailer. It was discovered that the\nfix for CVE-2017-11503 was incomplete. This update fixes the problem.\n\nOriginal advisory details:\n\n Dawid Golunski discovered that PHPMailer was not properly escaping user\n input data used as arguments to functions executed by the system shell. An\n attacker could possibly use this issue to execute arbitrary code. This\n issue only affected Ubuntu 16.04 ESM. (CVE-2016-10033, CVE-2016-10045)\n \n It was discovered that PHPMailer was not properly escaping characters\n in certain fields of the code_generator.php example code. An attacker\n could possibly use this issue to conduct cross-site scripting (XSS)\n attacks. This issue was only fixed in Ubuntu 16.04 ESM and Ubuntu 18.04\n ESM. (CVE-2017-11503)\n \n Yongxiang Li discovered that PHPMailer was not properly converting\n relative paths provided as user input when adding attachments to messages,\n which could lead to relative image URLs being treated as absolute local\n file paths and added as attachments. An attacker could possibly use this\n issue to access unauthorized resources and expose sensitive information.\n This issue only affected Ubuntu 16.04 ESM. (CVE-2017-5223)\n \n Sehun Oh discovered that PHPMailer was not properly processing untrusted\n non-local file attachments, which could lead to an object injection. An\n attacker could possibly use this issue to execute arbitrary code. This\n issue only affected Ubuntu 16.04 ESM. (CVE-2018-19296)\n \n Elar Lang discovered that PHPMailer was not properly escaping file\n attachment names, which could lead to a misinterpretation of file types\n by entities processing the message. An attacker could possibly use this\n issue to bypass attachment filters. This issue was only fixed in Ubuntu\n 16.04 ESM and Ubuntu 20.04 ESM. (CVE-2020-13625)\n \n It was discovered that PHPMailer was not properly handling callables in\n its validateAddress function, which could result in untrusted code being\n called should the global namespace contain a function called 'php'. An\n attacker could possibly use this issue to execute arbitrary code. This\n issue was only fixed in Ubuntu 20.04 ESM and Ubuntu 22.04 ESM.\n (CVE-2021-3603)\n",
  "releases": {
    "bionic": {
      "allbinaries": {
        "libphp-phpmailer": {
          "pocket": "esm-apps",
          "source": "libphp-phpmailer",
          "version": "5.2.14+dfsg-2.3+deb9u2ubuntu0.1~esm2"
        }
      },
      "binaries": {
        "libphp-phpmailer": {
          "pocket": "esm-apps",
          "version": "5.2.14+dfsg-2.3+deb9u2ubuntu0.1~esm2"
        }
      },
      "sources": {
        "libphp-phpmailer": {
          "version": "5.2.14+dfsg-2.3+deb9u2ubuntu0.1~esm2",
          "description": "full featured email transfer class for PHP"
        }
      }
    },
    "xenial": {
      "allbinaries": {
        "libphp-phpmailer": {
          "pocket": "esm-apps",
          "source": "libphp-phpmailer",
          "version": "5.2.14+dfsg-1ubuntu0.1~esm2"
        }
      },
      "binaries": {
        "libphp-phpmailer": {
          "pocket": "esm-apps",
          "version": "5.2.14+dfsg-1ubuntu0.1~esm2"
        }
      },
      "sources": {
        "libphp-phpmailer": {
          "version": "5.2.14+dfsg-1ubuntu0.1~esm2",
          "description": "full featured email transfer class for PHP"
        }
      }
    }
  },
  "title": "PHPMailer vulnerability",
  "timestamp": 1678910312.9064364,
  "summary": "libphp-phpmailer vulnerability",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "cves": [
    "CVE-2017-11503"
  ],
  "id": "USN-5956-2",
  "isummary": "An incomplete fix was discovered in PHPMailer.\n"
}