{
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n",
  "cves": [
    "CVE-2020-1968",
    "CVE-2021-23840",
    "CVE-2022-1292",
    "CVE-2022-2068",
    "CVE-2023-3446",
    "CVE-2024-0727"
  ],
  "description": "Robert Merget, Marcus Brinkmann, Nimrod Aviram, and Juraj Somorovsky\ndiscovered that certain Diffie-Hellman ciphersuites in the TLS\nspecification and implemented by OpenSSL contained a flaw. A remote\nattacker could possibly use this issue to eavesdrop on encrypted\ncommunications. This was fixed in this update by removing the insecure\nciphersuites from OpenSSL. (CVE-2020-1968)\n\nPaul Kehrer discovered that OpenSSL incorrectly handled certain input\nlengths in EVP functions. A remote attacker could possibly use this issue\nto cause OpenSSL to crash, resulting in a denial of service.\n(CVE-2021-23840)\n\nElison Niven discovered that OpenSSL incorrectly handled the c_rehash\nscript. A local attacker could possibly use this issue to execute arbitrary\ncommands when c_rehash is run. (CVE-2022-1292)\n\nChancen and Daniel Fiala discovered that OpenSSL incorrectly handled the\nc_rehash script. A local attacker could possibly use this issue to execute\narbitrary commands when c_rehash is run. (CVE-2022-2068)\n\nIt was discovered that OpenSSL incorrectly handled excessively large\nDiffie-Hellman parameters. An attacker could possibly use this issue\nto cause a denial of service. (CVE-2023-3446)\n\nBahaa Naamneh discovered that OpenSSL incorrectly handled certain malformed\nPKCS12 files. A remote attacker could possibly use this issue to cause\nOpenSSL to crash, resulting in a denial of service. (CVE-2024-0727)\n",
  "id": "USN-7018-1",
  "isummary": "Several security issues were fixed in OpenSSL.\n",
  "releases": {
    "trusty": {
      "allbinaries": {
        "libssl-dev": {
          "pocket": "esm-infra",
          "source": "openssl",
          "version": "1.0.1f-1ubuntu2.27+esm10"
        },
        "libssl-doc": {
          "pocket": "esm-infra",
          "source": "openssl",
          "version": "1.0.1f-1ubuntu2.27+esm10"
        },
        "libssl1.0.0": {
          "pocket": "esm-infra",
          "source": "openssl",
          "version": "1.0.1f-1ubuntu2.27+esm10"
        },
        "openssl": {
          "pocket": "esm-infra",
          "source": "openssl",
          "version": "1.0.1f-1ubuntu2.27+esm10"
        }
      },
      "binaries": {
        "libssl1.0.0": {
          "pocket": "esm-infra",
          "version": "1.0.1f-1ubuntu2.27+esm10"
        },
        "openssl": {
          "pocket": "esm-infra",
          "version": "1.0.1f-1ubuntu2.27+esm10"
        }
      },
      "sources": {
        "openssl": {
          "description": "Secure Socket Layer (SSL) cryptographic library and tools",
          "version": "1.0.1f-1ubuntu2.27+esm10"
        }
      }
    }
  },
  "summary": "openssl vulnerabilities",
  "timestamp": 1726619926.2030795,
  "title": "OpenSSL vulnerabilities"
}