{
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "cves": [
    "CVE-2020-6071",
    "CVE-2020-6072",
    "CVE-2020-6073",
    "CVE-2020-6077",
    "CVE-2020-6078",
    "CVE-2020-6079",
    "CVE-2020-6080"
  ],
  "description": "It was discovered that libmicrodns could recursively follow the same\ncompression pointer, leading to an infinite loop. An attacker could\npossibly use this issue to cause a denial of service. (CVE-2020-6071)\n\nIt was discovered that libmicrodns did not check the return value of the\nrr_decode function, which could lead to a double free. An attacker could\npossibly use this issue to execute arbitrary code. (CVE-2020-6072)\n\nIt was discovered that libmicrodns incorrectly handled certain inputs,\nwhich could lead to an integer overflow. An attacker could possibly use\nthis issue to cause a denial of service. (CVE-2020-6073)\n\nIt was discovered that libmicrodns incorrectly handled certain inputs,\nwhich could lead to a out-of-bounds read. An attacker could possibly use\nthis issue to cause a denial of service. (CVE-2020-6077)\n\nIt was discovered that libmicrodns incorrectly handled memory when parsing\nmDNS messages in mdns_recv, which could lead to a NULL pointer dereference.\nAn attacker could possibly use this issue to cause a denial of service.\n(CVE-2020-6078)\n\nIt was discovered that libmicrodns incorrectly handled memory, which could\nlead to excessive memory consumption due to memory leaks. An attacker\ncould possibly use this issue to cause a denial of service.\n(CVE-2020-6079, CVE-2020-6080)\n",
  "id": "USN-7239-1",
  "isummary": "Several security issues were fixed in libmicrodns.\n",
  "releases": {
    "bionic": {
      "allbinaries": {
        "libmicrodns-dev": {
          "pocket": "esm-apps",
          "source": "libmicrodns",
          "version": "0.0.8-1ubuntu0.1~esm1"
        },
        "libmicrodns0": {
          "pocket": "esm-apps",
          "source": "libmicrodns",
          "version": "0.0.8-1ubuntu0.1~esm1"
        }
      },
      "binaries": {
        "libmicrodns0": {
          "pocket": "esm-apps",
          "version": "0.0.8-1ubuntu0.1~esm1"
        }
      },
      "sources": {
        "libmicrodns": {
          "description": "minimal mDNS resolver and announcer library",
          "version": "0.0.8-1ubuntu0.1~esm1"
        }
      }
    }
  },
  "summary": "libmicrodns vulnerabilities",
  "timestamp": 1738107380.6557357,
  "title": "libmicrodns vulnerabilities"
}