{
  "description": "USN-3441-1 fixed several vulnerabilities in curl. This update\nprovides the corresponding update for Ubuntu 12.04 ESM.\n\nOriginal advisory details:\n\n Daniel Stenberg discovered that curl incorrectly handled large floating\n point output. A remote attacker could use this issue to cause curl to\n crash, resulting in a denial of service, or possibly execute arbitrary\n code. (CVE-2016-9586)\n\n Even Rouault discovered that curl incorrectly handled large file names when\n doing TFTP transfers. A remote attacker could use this issue to cause curl\n to crash, resulting in a denial of service, or possibly obtain sensitive\n memory contents. (CVE-2017-1000100)\n\n Brian Carpenter and Yongji Ouyang discovered that curl incorrectly handled\n numerical range globbing. A remote attacker could use this issue to cause\n curl to crash, resulting in a denial of service, or possibly obtain\n sensitive memory contents. (CVE-2017-1000101)\n\n Max Dymond discovered that curl incorrectly handled FTP PWD responses. A\n remote attacker could use this issue to cause curl to crash, resulting in a\n denial of service. (CVE-2017-1000254)\n\n Brian Carpenter discovered that curl incorrectly handled IMAP FETCH\n response lines. A remote attacker could use this issue to cause curl to\n crash, resulting in a denial of service, or possibly execute arbitrary\n code.(CVE-2017-1000257)\n\n Brian Carpenter discovered that curl incorrectly handled the --write-out\n command line option. A local attacker could possibly use this issue to\n obtain sensitive memory contents. (CVE-2017-7407)\n",
  "releases": {
    "precise": {
      "sources": {
        "curl": {
          "version": "7.22.0-3ubuntu4.18",
          "description": "HTTP, HTTPS, and FTP client and client libraries"
        }
      },
      "binaries": {
        "libcurl3-nss": {
          "version": "7.22.0-3ubuntu4.18"
        },
        "curl": {
          "version": "7.22.0-3ubuntu4.18"
        },
        "libcurl3-gnutls": {
          "version": "7.22.0-3ubuntu4.18"
        },
        "libcurl3": {
          "version": "7.22.0-3ubuntu4.18"
        }
      }
    }
  },
  "title": "curl vulnerabilities",
  "timestamp": 1508788059.131938,
  "summary": "curl vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "cves": [
    "CVE-2016-9586",
    "CVE-2017-1000100",
    "CVE-2017-1000254",
    "CVE-2017-1000257",
    "CVE-2017-7407"
  ],
  "id": "USN-3441-2",
  "isummary": "Several security issues were fixed in curl.\n"
}
