{
  "description": "USN-1430-1 fixed vulnerabilities in Firefox. This update provides an\nupdated ubufox package for use with the latest Firefox.\n\nOriginal advisory details:\n\n Bob Clary, Christian Holler, Brian Hackett, Bobby Holley, Gary Kwong,\n Hilary Hall, Honza Bambas, Jesse Ruderman, Julian Seward, and Olli Pettay\n discovered memory safety issues affecting Firefox. If the user were tricked\n into opening a specially crafted page, an attacker could exploit these to\n cause a denial of service via application crash, or potentially execute\n code with the privileges of the user invoking Firefox. (CVE-2012-0467,\n CVE-2012-0468)\n \n Aki Helin discovered a use-after-free vulnerability in XPConnect. An\n attacker could potentially exploit this to execute arbitrary code with the\n privileges of the user invoking Firefox. (CVE-2012-0469)\n \n Atte Kettunen discovered that invalid frees cause heap corruption in\n gfxImageSurface. If a user were tricked into opening a malicious Scalable\n Vector Graphics (SVG) image file, an attacker could exploit these to cause\n a denial of service via application crash, or potentially execute code with\n the privileges of the user invoking Firefox. (CVE-2012-0470)\n \n Anne van Kesteren discovered a potential cross-site scripting (XSS)\n vulnerability via multibyte content processing errors. With cross-site\n scripting vulnerabilities, if a user were tricked into viewing a specially\n crafted page, a remote attacker could exploit this to modify the contents,\n or steal confidential data, within the same domain. (CVE-2012-0471)\n \n Matias Juntunen discovered a vulnerability in Firefox's WebGL\n implementation that potentially allows the reading of illegal video memory.\n An attacker could possibly exploit this to cause a denial of service via\n application crash. (CVE-2012-0473)\n \n Jordi Chancel, Eddy Bordi, and Chris McGowen discovered that Firefox\n allowed the address bar to display a different website than the one the\n user was visiting. This could potentially leave the user vulnerable to\n cross-site scripting (XSS) attacks. With cross-site scripting\n vulnerabilities, if a user were tricked into viewing a specially crafted\n page, a remote attacker could exploit this to modify the contents, or steal\n confidential data, within the same domain. (CVE-2012-0474)\n \n Simone Fabiano discovered that Firefox did not always send correct origin\n headers when connecting to an IPv6 websites. An attacker could potentially\n use this to bypass intended access controls. (CVE-2012-0475)\n \n Masato Kinugawa discovered that cross-site scripting (XSS) injection is\n possible during the decoding of ISO-2022-KR and ISO-2022-CN character sets.\n With cross-site scripting vulnerabilities, if a user were tricked into\n viewing a specially crafted page, a remote attacker could exploit this to\n modify the contents, or steal confidential data, within the same domain.\n (CVE-2012-0477)\n \n It was discovered that certain images rendered using WebGL could cause\n Firefox to crash. If the user were tricked into opening a specially crafted\n page, an attacker could exploit this to cause a denial of service via\n application crash, or potentially execute code with the privileges of the\n user invoking Firefox. (CVE-2012-0478)\n \n Mateusz Jurczyk discovered an off-by-one error in the OpenType Sanitizer.\n If the user were tricked into opening a specially crafted page, an attacker\n could exploit this to cause a denial of service via application crash, or\n potentially execute code with the privileges of the user invoking Firefox.\n (CVE-2011-3062)\n \n Daniel Divricean discovered a defect in the error handling of JavaScript\n errors can potentially leak the file names and location of JavaScript files\n on a server. This could potentially lead to inadvertent information\n disclosure and a vector for further attacks. (CVE-2011-1187)\n \n Jeroen van der Gun discovered a vulnerability in the way Firefox handled\n RSS and Atom feeds. Invalid RSS or ATOM content loaded over HTTPS caused\n the location bar to be updated with the address of this content, while the\n main window still displays the previously loaded content. An attacker could\n potentially exploit this vulnerability to conduct phishing attacks.\n (CVE-2012-0479)\n",
  "releases": {
    "lucid": {
      "sources": {
        "ubufox": {
          "version": "0.9.5-0ubuntu0.10.04.1",
          "description": "Ubuntu Firefox specific configuration defaults and apt support"
        }
      },
      "binaries": {
        "xul-ext-ubufox": {
          "version": "0.9.5-0ubuntu0.10.04.1"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5-0ubuntu0.10.04.1.dsc": {
              "md5": "0859ef1ba294e4e43325cc028005d405",
              "size": 1514
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5-0ubuntu0.10.04.1.debian.tar.gz": {
              "md5": "ad207bd71998c0c66658aee8ac1bd5e7",
              "size": 16187
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5.orig.tar.gz": {
              "md5": "da9e30b244fc24b7627bc27f120d9f44",
              "size": 62960
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5-0ubuntu0.10.04.1_all.deb": {
              "md5": "9e3fe3a050728947a6275b7dc6efa60d",
              "size": 1206
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/xul-ext-ubufox_0.9.5-0ubuntu0.10.04.1_all.deb": {
              "md5": "6dddeceb8dab278bdc1ccbd0effd9eae",
              "size": 58850
            }
          }
        }
      }
    },
    "natty": {
      "sources": {
        "ubufox": {
          "version": "0.9.5-0ubuntu1",
          "description": "Ubuntu Firefox specific configuration defaults and apt support"
        }
      },
      "binaries": {
        "xul-ext-ubufox": {
          "version": "0.9.5-0ubuntu1"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5-0ubuntu1.debian.tar.gz": {
              "md5": "66eec239ced4b2b5c26cc7e0353b66ab",
              "size": 11063
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5-0ubuntu1.dsc": {
              "md5": "e098fa55cef8fc2492ca20c763e46a25",
              "size": 1482
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5.orig.tar.gz": {
              "md5": "da9e30b244fc24b7627bc27f120d9f44",
              "size": 62960
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/xul-ext-ubufox_0.9.5-0ubuntu1_all.deb": {
              "md5": "ef1e1e59a7af4e3d9cbe441b7f558bc9",
              "size": 45878
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_0.9.5-0ubuntu1_all.deb": {
              "md5": "16f8c3553859edad0676df66944deb97",
              "size": 1194
            }
          }
        }
      }
    },
    "oneiric": {
      "sources": {
        "ubufox": {
          "version": "1.0.4-0ubuntu1",
          "description": "Ubuntu Firefox specific configuration defaults and apt support"
        }
      },
      "binaries": {
        "xul-ext-ubufox": {
          "version": "1.0.4-0ubuntu1"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_1.0.4-0ubuntu1.dsc": {
              "md5": "d539c47888a740143b6be29758badec2",
              "size": 1482
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_1.0.4-0ubuntu1.debian.tar.gz": {
              "md5": "317a779dd626aea3dba32b5d206522bd",
              "size": 11674
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_1.0.4.orig.tar.gz": {
              "md5": "101154dd0f3653c93072de55b727a79d",
              "size": 62748
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/xul-ext-ubufox_1.0.4-0ubuntu1_all.deb": {
              "md5": "08deac9e6e6890f40d3e829293d742aa",
              "size": 47442
            },
            "http://security.ubuntu.com/ubuntu/pool/main/u/ubufox/ubufox_1.0.4-0ubuntu1_all.deb": {
              "md5": "9ca83cbbd220fcd9b207a5953c613b7b",
              "size": 1202
            }
          }
        }
      }
    }
  },
  "title": "ubufox update",
  "timestamp": 1335530303.332837,
  "summary": "ubufox update",
  "action": "After a standard system update you need to restart Firefox to make\nall the necessary changes.\n",
  "isummary": "This update provides compatible ubufox packages for the latest Firefox.\n",
  "id": "USN-1430-2",
  "cves": [
    "https://launchpad.net/bugs/987262"
  ]
}