{
  "description": "USN 3343-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nUSN 3335-2 fixed a vulnerability in the Linux kernel. However, that\nfix introduced regressions for some Java applications. This update\naddresses the issue. We apologize for the inconvenience.\n\nIt was discovered that a use-after-free vulnerability in the core voltage\nregulator driver of the Linux kernel. A local attacker could use this to\ncause a denial of service or possibly execute arbitrary code.\n(CVE-2014-9940)\n\nIt was discovered that a buffer overflow existed in the trace subsystem in\nthe Linux kernel. A privileged local attacker could use this to execute\narbitrary code. (CVE-2017-0605)\n\nRoee Hay discovered that the parallel port printer driver in the Linux\nkernel did not properly bounds check passed arguments. A local attacker\nwith write access to the kernel command line arguments could use this to\nexecute arbitrary code. (CVE-2017-1000363)\n\nLi Qiang discovered that an integer overflow vulnerability existed in the\nDirect Rendering Manager (DRM) driver for VMWare devices in the Linux\nkernel. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2017-7294)\n\nIt was discovered that a double-free vulnerability existed in the IPv4\nstack of the Linux kernel. An attacker could use this to cause a denial of\nservice (system crash). (CVE-2017-8890)\n\nAndrey Konovalov discovered an IPv6 out-of-bounds read error in the Linux\nkernel's IPv6 stack. A local attacker could cause a denial of service or\npotentially other unspecified problems. (CVE-2017-9074)\n\nAndrey Konovalov discovered a flaw in the handling of inheritance in the\nLinux kernel's IPv6 stack. A local user could exploit this issue to cause a\ndenial of service or possibly other unspecified problems. (CVE-2017-9075)\n\nIt was discovered that dccp v6 in the Linux kernel mishandled inheritance.\nA local attacker could exploit this issue to cause a denial of service or\npotentially other unspecified problems. (CVE-2017-9076)\n\nIt was discovered that the transmission control protocol (tcp) v6 in the\nLinux kernel mishandled inheritance. A local attacker could exploit this\nissue to cause a denial of service or potentially other unspecified\nproblems. (CVE-2017-9077)\n\nIt was discovered that the IPv6 stack in the Linux kernel was performing\nits over write consistency check after the data was actually overwritten. A\nlocal attacker could exploit this flaw to cause a denial of service (system\ncrash). (CVE-2017-9242)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-123.172~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise"
        }
      },
      "binaries": {
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.123.114"
        },
        "linux-image-3.13.0-123-generic": {
          "version": "3.13.0-123.172~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.123.114"
        },
        "linux-image-3.13.0-123-generic-lpae": {
          "version": "3.13.0-123.172~precise1"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1498728316.945186,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "isummary": "Several security issues were fixed in the Linux kernel.\n",
  "id": "USN-3343-2",
  "cves": [
    "https://launchpad.net/bugs/1699772",
    "https://www.ubuntu.com/usn/usn-3335-2",
    "CVE-2014-9940",
    "CVE-2017-0605",
    "CVE-2017-7294",
    "CVE-2017-8890",
    "CVE-2017-9074",
    "CVE-2017-9075",
    "CVE-2017-9076",
    "CVE-2017-9077",
    "CVE-2017-9242",
    "CVE-2017-1000363"
  ]
}