{
  "description": "USN-3445-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nEyal Itkin discovered that the IP over IEEE 1394 (FireWire) implementation\nin the Linux kernel contained a buffer overflow when handling fragmented\npackets. A remote attacker could use this to possibly execute arbitrary\ncode with administrative privileges. (CVE-2016-8633)\n\nAndrey Konovalov discovered that a divide-by-zero error existed in the TCP\nstack implementation in the Linux kernel. A local attacker could use this\nto cause a denial of service (system crash). (CVE-2017-14106)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-133.182~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-3.13.0-133-generic-lpae": {
          "version": "3.13.0-133.182~precise1"
        },
        "linux-image-3.13.0-133-generic": {
          "version": "3.13.0-133.182~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.133.123"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.133.123"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1507702459.808208,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2016-8633",
    "CVE-2017-14106"
  ],
  "id": "USN-3445-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}
