{
  "description": "\nDan Rosenberg discovered that the Linux kernel TIPC implementation\ncontained multiple integer signedness errors. A local attacker could\nexploit this to gain root privileges. (CVE-2010-3859)\n\nDan Rosenberg discovered that multiple terminal ioctls did not correctly\ninitialize structure memory. A local attacker could exploit this to read\nportions of kernel stack memory, leading to a loss of privacy.\n(CVE-2010-4075, CVE-2010-4076, CVE-2010-4077)\n\nDan Rosenberg discovered that the socket filters did not correctly\ninitialize structure memory. A local attacker could create malicious\nfilters to read portions of kernel stack memory, leading to a loss of\nprivacy. (CVE-2010-4158)\n\nDan Rosenberg discovered that the Linux kernel L2TP implementation\ncontained multiple integer signedness errors. A local attacker could\nexploit this to to crash the kernel, or possibly gain root privileges.\n(CVE-2010-4160)\n\nDan Rosenberg discovered that certain iovec operations did not calculate\npage counts correctly. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4162)\n\nDan Rosenberg discovered that the SCSI subsystem did not correctly validate\niov segments. A local attacker with access to a SCSI device could send\nspecially crafted requests to crash the system, leading to a denial of\nservice. (CVE-2010-4163, CVE-2010-4668)\n\nDan Rosenberg discovered that the RDS protocol did not correctly check\nioctl arguments. A local attacker could exploit this to crash the system,\nleading to a denial of service. (CVE-2010-4175)\n\nAlan Cox discovered that the HCI UART driver did not correctly check if a\nwrite operation was available. If the mmap_min-addr sysctl was changed from\nthe Ubuntu default to a value of 0, a local attacker could exploit this\nflaw to gain root privileges. (CVE-2010-4242)\n\nBrad Spengler discovered that the kernel did not correctly account for\nuserspace memory allocations during exec() calls. A local attacker could\nexploit this to consume all system memory, leading to a denial of service.\n(CVE-2010-4243)\n\nAlex Shi and Eric Dumazet discovered that the network stack did not\ncorrectly handle packet backlogs. A remote attacker could exploit this by\nsending a large amount of network traffic to cause the system to run out of\nmemory, leading to a denial of service. (CVE-2010-4251, CVE-2010-4805)\n\nIt was discovered that the ICMP stack did not correctly handle certain\nunreachable messages. If a remote attacker were able to acquire a socket\nlock, they could send specially crafted traffic that would crash the\nsystem, leading to a denial of service. (CVE-2010-4526)\n\nDan Carpenter discovered that the Infiniband driver did not correctly\nhandle certain requests. A local user could exploit this to crash the\nsystem or potentially gain root privileges. (CVE-2010-4649, CVE-2011-1044)\n\nKees Cook reported that /proc/pid/stat did not correctly filter certain\nmemory locations. A local attacker could determine the memory layout of\nprocesses in an attempt to increase the chances of a successful memory\ncorruption exploit. (CVE-2011-0726)\n\nTimo Warns discovered that MAC partition parsing routines did not correctly\ncalculate block counts. A local attacker with physical access could plug in\na specially crafted block device to crash the system or potentially gain\nroot privileges. (CVE-2011-1010)\n\nTimo Warns discovered that LDM partition parsing routines did not correctly\ncalculate block counts. A local attacker with physical access could plug in\na specially crafted block device to crash the system, leading to a denial\nof service. (CVE-2011-1012)\n\nMatthiew Herrb discovered that the drm modeset interface did not correctly\nhandle a signed comparison. A local attacker could exploit this to crash\nthe system or possibly gain root privileges. (CVE-2011-1013)\n\nIt was discovered that the /proc filesystem did not correctly handle\npermission changes when programs executed. A local attacker could hold open\nfiles to examine details about programs running with higher privileges,\npotentially increasing the chances of exploiting additional\nvulnerabilities. (CVE-2011-1020)\n\nVasiliy Kulikov discovered that the Bluetooth stack did not correctly clear\nmemory. A local attacker could exploit this to read kernel stack memory,\nleading to a loss of privacy. (CVE-2011-1078)\n\nVasiliy Kulikov discovered that the Bluetooth stack did not correctly check\nthat device name strings were NULL terminated. A local attacker could\nexploit this to crash the system, leading to a denial of service, or leak\ncontents of kernel stack memory, leading to a loss of privacy.\n(CVE-2011-1079)\n\nVasiliy Kulikov discovered that bridge network filtering did not check that\nname fields were NULL terminated. A local attacker could exploit this to\nleak contents of kernel stack memory, leading to a loss of privacy.\n(CVE-2011-1080)\n\nNelson Elhage discovered that the epoll subsystem did not correctly handle\ncertain structures. A local attacker could create malicious requests that\nwould hang the system, leading to a denial of service. (CVE-2011-1082)\n\nNeil Horman discovered that NFSv4 did not correctly handle certain orders\nof operation with ACL data. A remote attacker with access to an NFSv4 mount\ncould exploit this to crash the system, leading to a denial of service.\n(CVE-2011-1090)\n\nJohan Hovold discovered that the DCCP network stack did not correctly\nhandle certain packet combinations. A remote attacker could send specially\ncrafted network traffic that would crash the system, leading to a denial of\nservice. (CVE-2011-1093)\n\nPeter Huewe discovered that the TPM device did not correctly initialize\nmemory. A local attacker could exploit this to read kernel heap memory\ncontents, leading to a loss of privacy. (CVE-2011-1160)\n\nTimo Warns discovered that OSF partition parsing routines did not correctly\nclear memory. A local attacker with physical access could plug in a\nspecially crafted block device to read kernel memory, leading to a loss of\nprivacy. (CVE-2011-1163)\n\nVasiliy Kulikov discovered that the netfilter code did not check certain\nstrings copied from userspace. A local attacker with netfilter access could\nexploit this to read kernel memory or crash the system, leading to a denial\nof service. (CVE-2011-1170, CVE-2011-1171, CVE-2011-1172, CVE-2011-2534)\n\nVasiliy Kulikov discovered that the Acorn Universal Networking driver did\nnot correctly initialize memory. A remote attacker could send specially\ncrafted traffic to read kernel stack memory, leading to a loss of privacy.\n(CVE-2011-1173)\n\nDan Rosenberg discovered that the IRDA subsystem did not correctly check\ncertain field sizes. If a system was using IRDA, a remote attacker could\nsend specially crafted traffic to crash the system or gain root privileges.\n(CVE-2011-1180)\n\nRyan Sweat discovered that the GRO code did not correctly validate memory.\nIn some configurations on systems using VLANs, a remote attacker could send\nspecially crafted traffic to crash the system, leading to a denial of\nservice. (CVE-2011-1478)\n\nDan Rosenberg discovered that the X.25 Rose network stack did not correctly\nhandle certain fields. If a system was running with Rose enabled, a remote\nattacker could send specially crafted traffic to gain root privileges.\n(CVE-2011-1493)\n\nTimo Warns discovered that the GUID partition parsing routines did not\ncorrectly validate certain structures. A local attacker with physical\naccess could plug in a specially crafted block device to crash the system,\nleading to a denial of service. (CVE-2011-1577)\n\nOliver Hartkopp and Dave Jones discovered that the CAN network driver did\nnot correctly validate certain socket structures. If this driver was\nloaded, a local attacker could crash the system, leading to a denial of\nservice. (CVE-2011-1598)\n\nDan Rosenberg discovered that the DCCP stack did not correctly handle\ncertain packet structures. A remote attacker could exploit this to crash\nthe system, leading to a denial of service. (CVE-2011-1770)\n\nVasiliy Kulikov and Dan Rosenberg discovered that ecryptfs did not\ncorrectly check the origin of mount points. A local attacker could exploit\nthis to trick the system into unmounting arbitrary mount points, leading to\na denial of service. (CVE-2011-1833)\n\nVasiliy Kulikov discovered that taskstats listeners were not correctly\nhandled. A local attacker could expoit this to exhaust memory and CPU\nresources, leading to a denial of service. (CVE-2011-2484)\n\nIt was discovered that Bluetooth l2cap and rfcomm did not correctly\ninitialize structures. A local attacker could exploit this to read portions\nof the kernel stack, leading to a loss of privacy. (CVE-2011-2492)\n\nFernando Gont discovered that the IPv6 stack used predictable fragment\nidentification numbers. A remote attacker could exploit this to exhaust\nnetwork resources, leading to a denial of service. (CVE-2011-2699)\n\nThe performance counter subsystem did not correctly handle certain\ncounters. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2011-2918)\n\nA flaw was found in the Linux kernel's /proc/*/*map* interface. A local,\nunprivileged user could exploit this flaw to cause a denial of service.\n(CVE-2011-3637)\n\nDan Rosenberg discovered flaws in the linux Rose (X.25 PLP) layer used by\namateur radio. A local user or a remote user on an X.25 network could\nexploit these flaws to execute arbitrary code as root. (CVE-2011-4913)\n\nBen Hutchings discovered several flaws in the Linux Rose (X.25 PLP) layer.\nA local user or a remote user on an X.25 network could exploit these flaws\nto execute arbitrary code as root. (CVE-2011-4914)\n",
  "releases": {
    "lucid": {
      "sources": {
        "linux-fsl-imx51": {
          "version": "2.6.31-610.28",
          "description": "Linux kernel for IMX51"
        }
      },
      "binaries": {
        "linux-image-2.6.31-610-imx51": {
          "version": "2.6.31-610.28"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31-610.28.diff.gz": {
              "size": 5473547,
              "md5": "9530f874b2b9a59d145aa62b4bb5108f"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31.orig.tar.gz": {
              "size": 78278595,
              "md5": "16c0355d3612806ef87addf7c9f8c9f9"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31-610.28.dsc": {
              "size": 2782,
              "md5": "6126c9d8a00cda4d28ebba57d14c61ef"
            }
          }
        },
        "armel": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/serial-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 93662,
              "md5": "4f7b51d5c1aaa863baee131991779d34"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/linux-headers-2.6.31-610-imx51_2.6.31-610.28_armel.deb": {
              "size": 10643024,
              "md5": "a0398ef63933dc2bf24bbf9cd24a50fa"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/crypto-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 63096,
              "md5": "b2bdc5e657d22af317b2ad70e37d5cad"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-usb-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 115462,
              "md5": "009cbcb73126656d280463dafc3eaed9"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/sata-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 15602,
              "md5": "df3bf9fbee5867cd4a582b7ba9cdcd61"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/scsi-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 179422,
              "md5": "c4997f6b7be7e24a7b2e1edf7e2e5715"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/md-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 164480,
              "md5": "2986b22a1bdbd9e0f95ee572118763c2"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 234858,
              "md5": "a247c5636370dc125ba76de9f0269471"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fs-core-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 549716,
              "md5": "251c56156eca143e826e8988aa0ea1a1"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/storage-core-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 21368,
              "md5": "79878074878d3ddd895e14105dfed01f"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nfs-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 292702,
              "md5": "d8201f3cad7d9aed1cb5a1dc6bf7ef32"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/input-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 50550,
              "md5": "9abe91c941e8ea97447f7de7b1784a2b"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/usb-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 114726,
              "md5": "9778de92a7ace536560feb248604e3e0"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fs-secondary-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 138446,
              "md5": "935473d4a3797b6482124803cc19ec65"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/irda-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 211062,
              "md5": "f65b7eadc88226e059d64d9dca0291f4"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/block-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 24048,
              "md5": "3d1c45fdc12c74f47a0688bc4f0ed5aa"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/parport-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 17974,
              "md5": "4b34143b8566614d6ed69245a26ed9bd"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/plip-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 8234,
              "md5": "f71b9557286ec03fd13eff72c275fc32"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fat-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 4540,
              "md5": "7c6499e88e22c79df8856369f7547564"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/mouse-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 24566,
              "md5": "3a9e4380c8ba510d5ee9585e5ddd06d9"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-shared-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 186124,
              "md5": "e7ffdbf13b35fade00ecf7debc43e303"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/kernel-image-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 3455792,
              "md5": "7a8cd77e8020c44a0b45cd4d9398cf22"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/ppp-modules-2.6.31-610-imx51-di_2.6.31-610.28_armel.udeb": {
              "size": 36192,
              "md5": "fc8bd6758bb2478f9d8afce23b216b76"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/linux-image-2.6.31-610-imx51_2.6.31-610.28_armel.deb": {
              "size": 14505048,
              "md5": "d185665192b9aad196ea9a96bd42a0e5"
            }
          }
        }
      }
    }
  },
  "title": "Linux kernel (i.MX51) vulnerabilities",
  "timestamp": 1315944692.08755,
  "summary": "linux-fsl-imx51 vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed. If\nyou use linux-restricted-modules, you have to update that package as\nwell to get modules which work with the new kernel version. Unless you\nmanually uninstalled the standard kernel metapackages (e.g. linux-generic,\nlinux-server, linux-powerpc), a standard system upgrade will automatically\nperform this as well.\n",
  "cves": [
    "CVE-2010-3859",
    "CVE-2010-4075",
    "CVE-2010-4076",
    "CVE-2010-4077",
    "CVE-2010-4158",
    "CVE-2010-4160",
    "CVE-2010-4162",
    "CVE-2010-4163",
    "CVE-2010-4175",
    "CVE-2010-4242",
    "CVE-2010-4243",
    "CVE-2010-4251",
    "CVE-2010-4526",
    "CVE-2010-4649",
    "CVE-2010-4668",
    "CVE-2010-4805",
    "CVE-2011-0726",
    "CVE-2011-1010",
    "CVE-2011-1012",
    "CVE-2011-1013",
    "CVE-2011-1020",
    "CVE-2011-1044",
    "CVE-2011-1078",
    "CVE-2011-1079",
    "CVE-2011-1080",
    "CVE-2011-1082",
    "CVE-2011-1090",
    "CVE-2011-1093",
    "CVE-2011-1160",
    "CVE-2011-1163",
    "CVE-2011-1170",
    "CVE-2011-1171",
    "CVE-2011-1172",
    "CVE-2011-1173",
    "CVE-2011-1180",
    "CVE-2011-1478",
    "CVE-2011-1493",
    "CVE-2011-1577",
    "CVE-2011-1598",
    "CVE-2011-1770",
    "CVE-2011-1833",
    "CVE-2011-2484",
    "CVE-2011-2492",
    "CVE-2011-2534",
    "CVE-2011-2699",
    "CVE-2011-2918",
    "CVE-2011-3637",
    "CVE-2011-4913",
    "CVE-2011-4914"
  ],
  "id": "USN-1204-1",
  "isummary": "Multiple kernel flaws have been fixed.\n"
}
