{
  "description": "USN-3707-1 and USN-3349-1 fixed several vulnerabilities in NTP. This update\nprovides the corresponding update for Ubuntu 12.04 ESM.\n\nOriginal advisory details:\n\n Miroslav Lichvar discovered that NTP incorrectly handled certain spoofed\n addresses when performing rate limiting. A remote attacker could possibly\n use this issue to perform a denial of service. (CVE-2016-7426)\n\n Matthew Van Gundy discovered that NTP incorrectly handled certain crafted\n broadcast mode packets. A remote attacker could possibly use this issue to\n perform a denial of service. (CVE-2016-7427, CVE-2016-7428)\n\n Matthew Van Gundy discovered that NTP incorrectly handled certain control\n mode packets. A remote attacker could use this issue to set or unset traps.\n (CVE-2016-9310)\n\n Matthew Van Gundy discovered that NTP incorrectly handled the trap service.\n A remote attacker could possibly use this issue to cause NTP to crash, resulting\n in a denial of service. (CVE-2016-9311)\n\n It was discovered that the NTP legacy DPTS refclock driver incorrectly handled\n the /dev/datum device. A local attacker could possibly use this issue to cause\n a denial of service. (CVE-2017-6462)\n\n It was discovered that NTP incorrectly handled certain invalid settings in a\n :config directive. A remote authenticated user could possibly use this issue\n to cause NTP to crash, resulting in a denial of service. (CVE-2017-6463)\n\n Michael Macnair discovered that NTP incorrectly handled certain responses.\n A remote attacker could possibly use this issue to execute arbitrary code.\n (CVE-2018-7183)\n\n Miroslav Lichvar discovered that NTP incorrectly handled certain\n zero-origin timestamps. A remote attacker could possibly use this issue to\n cause a denial of service. (CVE-2018-7185)\n",
  "releases": {
    "precise": {
      "allbinaries": {
        "ntp": {
          "version": "1:4.2.6.p3+dfsg-1ubuntu3.12"
        },
        "ntp-doc": {
          "version": "1:4.2.6.p3+dfsg-1ubuntu3.12"
        },
        "ntpdate": {
          "version": "1:4.2.6.p3+dfsg-1ubuntu3.12"
        }
      },
      "binaries": {
        "ntp": {
          "version": "1:4.2.6.p3+dfsg-1ubuntu3.12"
        }
      },
      "sources": {
        "ntp": {
          "version": "1:4.2.6.p3+dfsg-1ubuntu3.12",
          "description": "Network Time Protocol daemon and utility programs"
        }
      }
    }
  },
  "title": "NTP vulnerabilities",
  "timestamp": 1548250790.475809,
  "summary": "ntp vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "isummary": "Several security issues were fixed in NTP.\n",
  "id": "USN-3707-2",
  "cves": [
    "CVE-2016-7426",
    "CVE-2016-7427",
    "CVE-2016-7428",
    "CVE-2016-9310",
    "CVE-2016-9311",
    "CVE-2017-6462",
    "CVE-2017-6463",
    "CVE-2018-7183",
    "CVE-2018-7185"
  ]
}
