{
  "description": "USN-3424-1 fixed several vulnerabilities in libxml2. This update\nprovides the corresponding update for Ubuntu 12.04 ESM.\n\nOriginal advisory details:\n\n It was discovered that a type confusion error existed in libxml2. An\n attacker could use this to specially construct XML data that\n could cause a denial of service or possibly execute arbitrary\n code. (CVE-2017-0663)\n\n It was discovered that libxml2 did not properly validate parsed entity\n references. An attacker could use this to specially construct XML\n data that could expose sensitive information. (CVE-2017-7375)\n\n It was discovered that a buffer overflow existed in libxml2 when\n handling HTTP redirects. An attacker could use this to specially\n construct XML data that could cause a denial of service or possibly\n execute arbitrary code. (CVE-2017-7376)\n\n Marcel Böhme and Van-Thuan Pham discovered a buffer overflow in\n libxml2 when handling elements. An attacker could use this to specially\n construct XML data that could cause a denial of service or possibly\n execute arbitrary code. (CVE-2017-9047)\n\n Marcel Böhme and Van-Thuan Pham discovered a buffer overread\n in libxml2 when handling elements. An attacker could use this\n to specially construct XML data that could cause a denial of\n service. (CVE-2017-9048)\n\n Marcel Böhme and Van-Thuan Pham discovered multiple buffer overreads\n in libxml2 when handling parameter-entity references. An attacker\n could use these to specially construct XML data that could cause a\n denial of service. (CVE-2017-9049, CVE-2017-9050)\n",
  "releases": {
    "precise": {
      "sources": {
        "libxml2": {
          "version": "2.7.8.dfsg-5.1ubuntu4.18",
          "description": "GNOME XML library"
        }
      },
      "binaries": {
        "libxml2": {
          "version": "2.7.8.dfsg-5.1ubuntu4.18"
        }
      }
    }
  },
  "title": "libxml2 vulnerabilities",
  "timestamp": 1507665075.265189,
  "summary": "libxml2 vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "isummary": "Several security issues were fixed in libxml2.\n",
  "id": "USN-3424-2",
  "cves": [
    "CVE-2017-0663",
    "CVE-2017-7375",
    "CVE-2017-7376",
    "CVE-2017-9047",
    "CVE-2017-9048",
    "CVE-2017-9049",
    "CVE-2017-9050"
  ]
}