{
  "description": "USN-3382-1 fixed several vulnerabilities in PHP. This update provides\nthe corresponding update for Ubuntu 12.04 ESM.\n\nOriginal advisory details:\n\n It was discovered that the PHP URL parser incorrectly handled certain URI\n components. A remote attacker could possibly use this issue to bypass\n hostname-specific URL checks. (CVE-2016-10397)\n\n It was discovered that PHP incorrectly handled certain boolean parameters\n when unserializing data. A remote attacker could possibly use this issue to\n cause PHP to crash, resulting in a denial of service. (CVE-2017-11143)\n\n Sebastian Li, Wei Lei, Xie Xiaofei, and Liu Yang discovered that PHP\n incorrectly handled the OpenSSL sealing function. A remote attacker could\n possibly use this issue to cause PHP to crash, resulting in a denial of\n service. (CVE-2017-11144)\n\n Wei Lei and Liu Yang discovered that the PHP date extension incorrectly\n handled memory. A remote attacker could possibly use this issue to disclose\n sensitive information from the server. (CVE-2017-11145)\n\n It was discovered that PHP incorrectly handled certain PHAR archives. A\n remote attacker could use this issue to cause PHP to crash or disclose\n sensitive information. This issue only affected Ubuntu 14.04 LTS.\n (CVE-2017-11147)\n\n Wei Lei and Liu Yang discovered that PHP incorrectly handled parsing ini\n files. An attacker could possibly use this issue to cause PHP to crash,\n resulting in a denial of service. (CVE-2017-11628)\n\n It was discovered that PHP mbstring incorrectly handled certain regular\n expressions. A remote attacker could use this issue to cause PHP to crash,\n resulting in a denial of service, or possibly execute arbitrary code.\n (CVE-2017-9224, CVE-2017-9226, CVE-2017-9227, CVE-2017-9228, CVE-2017-9229)\n",
  "releases": {
    "precise": {
      "sources": {
        "php5": {
          "version": "5.3.10-1ubuntu3.28",
          "description": "HTML-embedded scripting language interpreter"
        }
      },
      "binaries": {
        "php5-cli": {
          "version": "5.3.10-1ubuntu3.28"
        },
        "php5": {
          "version": "5.3.10-1ubuntu3.28"
        },
        "libapache2-mod-php5": {
          "version": "5.3.10-1ubuntu3.28"
        },
        "php5-fpm": {
          "version": "5.3.10-1ubuntu3.28"
        },
        "php5-cgi": {
          "version": "5.3.10-1ubuntu3.28"
        }
      }
    }
  },
  "title": "PHP vulnerabilities",
  "timestamp": 1513603418.610439,
  "summary": "php5 vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "isummary": "Several security issues were fixed in PHP.\n",
  "id": "USN-3382-2",
  "cves": [
    "CVE-2016-10397",
    "CVE-2017-11143",
    "CVE-2017-11144",
    "CVE-2017-11145",
    "CVE-2017-11147",
    "CVE-2017-11628",
    "CVE-2017-9224",
    "CVE-2017-9226",
    "CVE-2017-9227",
    "CVE-2017-9228",
    "CVE-2017-9229"
  ]
}