{
  "description": "USN-3674-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nIt was discovered that the netfilter subsystem of the Linux kernel did not\nproperly validate ebtables offsets. A local attacker could use this to\ncause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2018-1068)\n\nIt was discovered that a NULL pointer dereference existed in the RDS\n(Reliable Datagram Sockets) protocol implementation in the Linux kernel. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2018-7492)\n\nEyal Itkin discovered that the USB displaylink video adapter driver in the\nLinux kernel did not properly validate mmap offsets sent from userspace. A\nlocal attacker could use this to expose sensitive information (kernel\nmemory) or possibly execute arbitrary code. (CVE-2018-8781)\n\nXingyuan Lin discovered that a out-of-bounds read existed in the USB Video\nClass (UVC) driver of the Linux kernel. A local attacker could use this to\nexpose sensitive information (kernel memory). (CVE-2017-0627)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-151.201~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-3.13.0-151-generic": {
          "version": "3.13.0-151.201~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.151.142"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.151.142"
        },
        "linux-image-3.13.0-151-generic-lpae": {
          "version": "3.13.0-151.201~precise1"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1528744842.145868,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2017-0627",
    "CVE-2018-1068",
    "CVE-2018-7492",
    "CVE-2018-8781"
  ],
  "id": "USN-3674-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}
