{
  "description": "Vladimir V. Perepelitsa discovered a bug in Thunderbird's handling of anonymous\nfunctions during regular expression string replacement. A malicious HTML email\ncould exploit this to capture a random block of client memory. (CAN-2005-0989)\n\nGeorgi Guninski discovered that the types of certain XPInstall related\nJavaScript objects were not sufficiently validated when they were called. This\ncould be exploited by malicious HTML email content to crash Thunderbird or even\nexecute arbitrary code with the privileges of the user. (CAN-2005-1159) \n\nThunderbird did not properly verify the values of XML DOM nodes.  By tricking\nthe user to perform a common action like clicking on a link or opening the\ncontext menu, a malicious HTML email could exploit this to execute arbitrary\nJavaScript code with the full privileges of the user. (CAN-2005-1160)\n\nA variant of the attack described in CAN-2005-1160 (see USN-124-1) was\ndiscovered. Additional checks were added to make sure Javascript eval and\nscript objects are run with the privileges of the context that created them,\nnot the potentially elevated privilege of the context calling them.\n(CAN-2005-1532)\n\nScripts in XBL controls from web content continued to be run even when\nJavascript was disabled. This could be combined with most script-based exploits\nto attack people running vulnerable versions who thought disabling Javascript\nwould protect them. (CAN-2005-2261)\n\nThe function for version comparison in the addons installer did not properly\nverify the type of its argument. By passing specially crafted Javascript\nobjects to it, a malicious web site could crash Thunderbird and possibly even\nexecute arbitrary code with the privilege of the user account Thunderbird runs\nin. (CAN-2005-2265)\n\nThe XHTML DOM node handler did not take namespaces into account when verifying\nnode types based on their names. For example, an XHTML email could contain an\n<IMG> tag with malicious contents, which would then be processed as the\nstandard trusted HTML <img> tag. By tricking an user to view a malicious email,\nthis could be exploited to execute attacker-specified code with the full\nprivileges of the user. (CAN-2005-2269) \n\nIt was discovered that some objects were not created appropriately.  This\nallowed malicious web content scripts to trace back the creation chain until\nthey found a privileged object and execute code with higher privileges than\nallowed by the current site. (CAN-2005-2270) \n\nJavier Fernández-Sanguino Peña discovered that the run-mozilla.sh script\ncreated temporary files in an unsafe way when running with 'debugging' enabled.\nThis could allow a symlink attack to create or overwrite arbitrary files with\nthe privileges of the user invoking the program.\n(CAN-2005-2353)\n\nThe update for Ubuntu 4.10 (Warty Warthog) also fixes several less\ncritical vulnerabilities which are not present in the Ubuntu 5.04\nversion. (MFSA-2005-02 to MFSA-2005-30; please see the following web\nsite for details:\nhttp://www.mozilla.org/projects/security/known-vulnerabilities.html).\nWe apologize for the huge delay of this update; we changed our update\nstrategy for Mozilla products to make sure that such long delays will\nnot happen again.",
  "releases": {
    "warty": {
      "binaries": {
        "mozilla-thunderbird": {
          "version": ""
        },
        "mozilla-thunderbird-enigmail": {
          "version": ""
        }
      }
    },
    "hoary": {
      "binaries": {
        "mozilla-thunderbird": {
          "version": ""
        },
        "mozilla-thunderbird-enigmail": {
          "version": ""
        }
      }
    }
  },
  "title": "Mozilla Thunderbird vulnerabilities",
  "timestamp": 1122918462,
  "summary": "mozilla-thunderbird vulnerabilities",
  "id": "USN-157-1",
  "cves": [
    "CVE-2005-0989",
    "CVE-2005-1159",
    "CVE-2005-1160",
    "CVE-2005-1532",
    "CVE-2005-2261",
    "CVE-2005-2265",
    "CVE-2005-2269",
    "CVE-2005-2270",
    "CVE-2005-2353"
  ]
}
