{
  "description": "\nThomas Pollet discovered that the RDS network protocol did not check\ncertain iovec buffers. A local attacker could exploit this to crash the\nsystem or possibly execute arbitrary code as the root user. (CVE-2010-3865)\n\nDan Rosenberg discovered that the Linux kernel X.25 implementation\nincorrectly parsed facilities. A remote attacker could exploit this to\ncrash the kernel, leading to a denial of service. (CVE-2010-3873)\n\nDan Rosenberg discovered that the CAN protocol on 64bit systems did not\ncorrectly calculate the size of certain buffers. A local attacker could\nexploit this to crash the system or possibly execute arbitrary code as the\nroot user. (CVE-2010-3874)\n\nVasiliy Kulikov discovered that the Linux kernel X.25 implementation did\nnot correctly clear kernel memory. A local attacker could exploit this to\nread kernel stack memory, leading to a loss of privacy. (CVE-2010-3875)\n\nVasiliy Kulikov discovered that the Linux kernel sockets implementation did\nnot properly initialize certain structures. A local attacker could exploit\nthis to read kernel stack memory, leading to a loss of privacy.\n(CVE-2010-3876)\n\nVasiliy Kulikov discovered that the TIPC interface did not correctly\ninitialize certain structures. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-3877)\n\nNelson Elhage discovered that the Linux kernel IPv4 implementation did not\nproperly audit certain bytecodes in netlink messages. A local attacker\ncould exploit this to cause the kernel to hang, leading to a denial of\nservice. (CVE-2010-3880)\n\nDan Rosenberg discovered that the RME Hammerfall DSP audio interface driver\ndid not correctly clear kernel memory. A local attacker could exploit this\nto read kernel stack memory, leading to a loss of privacy. (CVE-2010-4080,\nCVE-2010-4081)\n\nDan Rosenberg discovered that the VIA video driver did not correctly clear\nkernel memory. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4082)\n\nDan Rosenberg discovered that the semctl syscall did not correctly clear\nkernel memory. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4083)\n\nJames Bottomley discovered that the ICP vortex storage array controller\ndriver did not validate certain sizes. A local attacker on a 64bit system\ncould exploit this to crash the kernel, leading to a denial of service.\n(CVE-2010-4157)\n\nDan Rosenberg discovered multiple flaws in the X.25 facilities parsing. If\na system was using X.25, a remote attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4164)\n\nIt was discovered that multithreaded exec did not handle CPU timers\ncorrectly. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2010-4248)\n\nNelson Elhage discovered that the kernel did not correctly handle process\ncleanup after triggering a recoverable kernel bug. If a local attacker were\nable to trigger certain kinds of kernel bugs, they could create a specially\ncrafted process to gain root privileges. (CVE-2010-4258)\n\nNelson Elhage discovered that Econet did not correctly handle AUN packets\nover UDP. A local attacker could send specially crafted traffic to crash\nthe system, leading to a denial of service. (CVE-2010-4342)\n\nTavis Ormandy discovered that the install_special_mapping function could\nbypass the mmap_min_addr restriction. A local attacker could exploit this\nto mmap 4096 bytes below the mmap_min_addr area, possibly improving the\nchances of performing NULL pointer dereference attacks. (CVE-2010-4346)\n\nDan Rosenberg discovered that the OSS subsystem did not handle name\ntermination correctly. A local attacker could exploit this crash the system\nor gain root privileges. (CVE-2010-4527)\n\nDan Rosenberg discovered that IRDA did not correctly check the size of\nbuffers. On non-x86 systems, a local attacker could exploit this to read\nkernel heap memory, leading to a loss of privacy. (CVE-2010-4529)\n\nDan Rosenburg discovered that the CAN subsystem leaked kernel addresses\ninto the /proc filesystem. A local attacker could use this to increase the\nchances of a successful memory corruption exploit. (CVE-2010-4565)\n\nKees Cook discovered that some ethtool functions did not correctly clear\nheap memory. A local attacker with CAP_NET_ADMIN privileges could exploit\nthis to read portions of kernel heap memory, leading to a loss of privacy.\n(CVE-2010-4655)\n\nKees Cook discovered that the IOWarrior USB device driver did not correctly\ncheck certain size fields. A local attacker with physical access could plug\nin a specially crafted USB device to crash the system or potentially gain\nroot privileges. (CVE-2010-4656)\n\nGoldwyn Rodrigues discovered that the OCFS2 filesystem did not correctly\nclear memory when writing certain file holes. A local attacker could\nexploit this to read uninitialized data from the disk, leading to a loss of\nprivacy. (CVE-2011-0463)\n\nDan Carpenter discovered that the TTPCI DVB driver did not check certain\nvalues during an ioctl. If the dvb-ttpci module was loaded, a local\nattacker could exploit this to crash the system, leading to a denial of\nservice, or possibly gain root privileges. (CVE-2011-0521)\n\nJens Kuehnel discovered that the InfiniBand driver contained a race\ncondition. On systems using InfiniBand, a local attacker could send\nspecially crafted requests to crash the system, leading to a denial of\nservice. (CVE-2011-0695)\n\nDan Rosenberg discovered that XFS did not correctly initialize memory. A\nlocal attacker could make crafted ioctl calls to leak portions of kernel\nstack memory, leading to a loss of privacy. (CVE-2011-0711)\n\nRafael Dominguez Vega discovered that the caiaq Native Instruments USB\ndriver did not correctly validate string lengths. A local attacker with\nphysical access could plug in a specially crafted USB device to crash the\nsystem or potentially gain root privileges. (CVE-2011-0712)\n\nTimo Warns discovered that the LDM disk partition handling code did not\ncorrectly handle certain values. By inserting a specially crafted disk\ndevice, a local attacker could exploit this to gain root privileges.\n(CVE-2011-1017)\n\nJulien Tinnes discovered that the kernel did not correctly validate the\nsignal structure from tkill(). A local attacker could exploit this to send\nsignals to arbitrary threads, possibly bypassing expected restrictions.\n(CVE-2011-1182)\n\nDan Rosenberg discovered that MPT devices did not correctly validate\ncertain values in ioctl calls. If these drivers were loaded, a local\nattacker could exploit this to read arbitrary kernel memory, leading to a\nloss of privacy. (CVE-2011-1494, CVE-2011-1495)\n\nTavis Ormandy discovered that the pidmap function did not correctly handle\nlarge requests. A local attacker could exploit this to crash the system,\nleading to a denial of service. (CVE-2011-1593)\n\nVasiliy Kulikov discovered that the AGP driver did not check certain ioctl\nvalues. A local attacker with access to the video subsystem could exploit\nthis to crash the system, leading to a denial of service, or possibly gain\nroot privileges. (CVE-2011-1745, CVE-2011-2022)\n\nVasiliy Kulikov discovered that the AGP driver did not check the size of\ncertain memory allocations. A local attacker with access to the video\nsubsystem could exploit this to run the system out of memory, leading to a\ndenial of service. (CVE-2011-1746)\n\nOliver Hartkopp and Dave Jones discovered that the CAN network driver did\nnot correctly validate certain socket structures. If this driver was\nloaded, a local attacker could crash the system, leading to a denial of\nservice. (CVE-2011-1748)\n",
  "releases": {
    "lucid": {
      "sources": {
        "linux-fsl-imx51": {
          "version": "2.6.31-609.26",
          "description": "Linux kernel for IMX51"
        }
      },
      "binaries": {
        "linux-image-2.6.31-609-imx51": {
          "version": "2.6.31-609.26"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31-609.26.tar.gz": {
              "size": 84968572,
              "md5": "923256dc144091e5feeb01f060c63ac5"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-fsl-imx51/linux-fsl-imx51_2.6.31-609.26.dsc": {
              "size": 1868,
              "md5": "562e1031520c9961608f147de2dc0699"
            }
          }
        },
        "armel": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/storage-core-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 21370,
              "md5": "ea4facc3f873cbccfa5dc0c660604964"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nfs-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 293436,
              "md5": "7d3e358565860b32fdcac4c56a770261"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-usb-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 114258,
              "md5": "8979766af4b75847d4d20c57b5371440"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fs-secondary-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 138184,
              "md5": "eaf2fcd754c6fe17b52a8ed88f86d158"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/ppp-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 36156,
              "md5": "c72812955dff460adf4b44c00025d97c"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/usb-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 115522,
              "md5": "8883f701f242f0bea18a2b1ea59d4829"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/block-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 24064,
              "md5": "dde6532ad83e4d7b0131c41dc2543050"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/linux-headers-2.6.31-609-imx51_2.6.31-609.26_armel.deb": {
              "size": 10672306,
              "md5": "1ac9662231f85315de6b11e10a2fc1dc"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-shared-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 184596,
              "md5": "faabcd4e4d0f39212ccca1b3f2e0d31a"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/md-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 162248,
              "md5": "5deb38a4006e30feb69d4536b3f4a660"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/plip-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 8226,
              "md5": "f945747624b0a98e555fac02aae5f300"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/kernel-image-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 3454168,
              "md5": "b8a928e3f1e097f7b09850518f271dee"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/irda-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 211206,
              "md5": "7ab55022133f9ddd6fd950a4dbd43cbd"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/input-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 49908,
              "md5": "ea3050bc19fb088dcaded52bea951811"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/parport-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 17972,
              "md5": "2c61632157fa92eeb3624f441da7ef49"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/scsi-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 179410,
              "md5": "7a863aa0200d9c1d457201aae15cf40a"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/crypto-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 63558,
              "md5": "9ad85ea244046c8fc6f9506d21554229"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/sata-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 15602,
              "md5": "b484603a18b8faefdd04aa838f3117ae"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/serial-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 93660,
              "md5": "358af30efff9c8ab50dfded60ff38879"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/mouse-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 24558,
              "md5": "442c93a09a18864a1cea99ba3b9ebdd4"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fat-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 4510,
              "md5": "27e32d915343556d53ee771efdbb9b56"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/nic-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 235446,
              "md5": "e45153d96a27230348a5764b16cfe7ef"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/fs-core-modules-2.6.31-609-imx51-di_2.6.31-609.26_armel.udeb": {
              "size": 549108,
              "md5": "7a07cb9482b6c2b39f9e362c3fc6bd83"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-fsl-imx51/linux-image-2.6.31-609-imx51_2.6.31-609.26_armel.deb": {
              "size": 14554140,
              "md5": "e28e8fc33cacf2603e1c1e8292a5dffc"
            }
          }
        }
      }
    }
  },
  "title": "Linux kernel vulnerabilities (i.MX51)",
  "timestamp": 1309957792.089799,
  "summary": "linux-fsl-imx51 vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed. If\nyou use linux-restricted-modules, you have to update that package as\nwell to get modules which work with the new kernel version. Unless you\nmanually uninstalled the standard kernel metapackages (e.g. linux-generic,\nlinux-server, linux-powerpc), a standard system upgrade will automatically\nperform this as well.\n",
  "cves": [
    "CVE-2010-3865",
    "CVE-2010-3873",
    "CVE-2010-3874",
    "CVE-2010-3875",
    "CVE-2010-3876",
    "CVE-2010-3877",
    "CVE-2010-3880",
    "CVE-2010-4080",
    "CVE-2010-4081",
    "CVE-2010-4082",
    "CVE-2010-4083",
    "CVE-2010-4157",
    "CVE-2010-4164",
    "CVE-2010-4248",
    "CVE-2010-4258",
    "CVE-2010-4342",
    "CVE-2010-4346",
    "CVE-2010-4527",
    "CVE-2010-4529",
    "CVE-2010-4565",
    "CVE-2010-4655",
    "CVE-2010-4656",
    "CVE-2011-0463",
    "CVE-2011-0521",
    "CVE-2011-0695",
    "CVE-2011-0711",
    "CVE-2011-0712",
    "CVE-2011-1017",
    "CVE-2011-1182",
    "CVE-2011-1494",
    "CVE-2011-1495",
    "CVE-2011-1593",
    "CVE-2011-1745",
    "CVE-2011-1746",
    "CVE-2011-1748",
    "CVE-2011-2022"
  ],
  "id": "USN-1164-1",
  "isummary": "Multiple kernel flaws have been fixed.\n"
}
