{
  "description": "USN-3386-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nAndrey Konovalov discovered a race condition in the UDP Fragmentation\nOffload (UFO) code in the Linux kernel. A local attacker could use this to\ncause a denial of service or execute arbitrary code. (CVE-2017-1000112)\n\nAndrey Konovalov discovered a race condition in AF_PACKET socket option\nhandling code in the Linux kernel. A local unprivileged attacker could use\nthis to cause a denial of service or possibly execute arbitrary code.\n(CVE-2017-1000111)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-128.177~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-3.13.0-128-generic": {
          "version": "3.13.0-128.177~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.128.118"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.128.118"
        },
        "linux-image-3.13.0-128-generic-lpae": {
          "version": "3.13.0-128.177~precise1"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1502422658.798516,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2017-1000111",
    "CVE-2017-1000112"
  ],
  "id": "USN-3386-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}
