{
  "description": "Peter Zelezny discovered that URLs which are passed to Firefox or\nMozilla on the command line are not correctly protected against\ninterpretation by the shell. If Firefox or Mozilla is configured as\nthe default handler for URLs (which is the default in Ubuntu), this\ncould be exploited to execute arbitrary code with user privileges by\ntricking the user into clicking on a specially crafted URL (for\nexample, in an email or chat client).  (CAN-2005-2968, MFSA-2005-59)\n\nA buffer overflow was discovered in the XBM image handler. By tricking\nan user into opening a specially crafted XBM image, an attacker could\nexploit this to execute arbitrary code with the user's privileges.\n(MFSA-2005-58)\n\nMats Palmgren discovered a buffer overflow in the Unicode string\nparser. Unicode strings that contained \"zero-width non-joiner\"\ncharacters caused a browser crash, which could possibly even exploited\nto execute arbitrary code with the user's privileges.\n(MFSA-2005-58)\n\nGeorgi Guninski reported an integer overflow in the JavaScript engine.\nThis could be exploited to run arbitrary code under some conditions.\n(MFSA-2005-58)\n\nThis update also fixes some less critical issues which are described\nat http://www.mozilla.org/security/announce/mfsa2005-58.html.",
  "releases": {
    "hoary": {
      "binaries": {
        "mozilla-mailnews": {
          "version": ""
        },
        "mozilla-calendar": {
          "version": ""
        },
        "mozilla-browser": {
          "version": ""
        },
        "mozilla-firefox": {
          "version": ""
        }
      }
    },
    "warty": {
      "binaries": {
        "mozilla-mailnews": {
          "version": ""
        },
        "mozilla-calendar": {
          "version": ""
        },
        "mozilla-browser": {
          "version": ""
        },
        "mozilla-firefox": {
          "version": ""
        }
      }
    }
  },
  "title": "Mozilla and Firefox vulnerabilities",
  "timestamp": 1127518756,
  "summary": "mozilla, mozilla-firefox vulnerabilities",
  "id": "USN-186-1",
  "cves": [
    "CVE-2005-2968",
    "MFSA-2005-58"
  ]
}