{
  "description": "Adam Nichols discovered that heap overflows existed in the iSCSI subsystem\nin the Linux kernel. A local attacker could use this to cause a denial of\nservice (system crash) or possibly execute arbitrary code. (CVE-2021-27365)\n\nIt was discovered that the LIO SCSI target implementation in the Linux\nkernel performed insufficient identifier checking in certain XCOPY\nrequests. An attacker with access to at least one LUN in a multiple\nbackstore environment could use this to expose sensitive information or\nmodify data. (CVE-2020-28374)\n\nAdam Nichols discovered that the iSCSI subsystem in the Linux kernel did\nnot properly restrict access to iSCSI transport handles. A local attacker\ncould use this to cause a denial of service or expose sensitive information\n(kernel pointer addresses). (CVE-2021-27363)\n\nAdam Nichols discovered that an out-of-bounds read existed in the iSCSI\nsubsystem in the Linux kernel. A local attacker could use this to cause a\ndenial of service (system crash) or expose sensitive information (kernel\nmemory). (CVE-2021-27364)\n",
  "releases": {
    "precise": {
      "allbinaries": {
        "linux-image-3.13.0-185-lowlatency": {
          "version": "3.13.0-185.236~12.04.1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.185.170"
        },
        "linux-image-3.13.0-185-generic": {
          "version": "3.13.0-185.236~12.04.1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.185.170"
        },
        "linux-image-3.13.0-185-generic-lpae": {
          "version": "3.13.0-185.236~12.04.1"
        }
      },
      "binaries": {
        "linux-image-3.13.0-185-generic": {
          "version": "3.13.0-185.236~12.04.1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.185.170"
        }
      },
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-185.236~12.04.1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1617682280.668826,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "isummary": "Several security issues were fixed in the Linux kernel.\n",
  "id": "USN-4901-1",
  "cves": [
    "CVE-2020-28374",
    "CVE-2021-27363",
    "CVE-2021-27364",
    "CVE-2021-27365"
  ]
}
