{
  "description": "USN-3381-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nPeter Pi discovered that the colormap handling for frame buffer devices in\nthe Linux kernel contained an integer overflow. A local attacker could use\nthis to disclose sensitive information (kernel memory). (CVE-2016-8405)\n\nIt was discovered that the Linux kernel did not properly restrict\nRLIMIT_STACK size. A local attacker could use this in conjunction with\nanother vulnerability to possibly execute arbitrary code.\n(CVE-2017-1000365)\n\nIt was discovered that SELinux in the Linux kernel did not properly handle\nempty writes to /proc/pid/attr. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2017-2618)\n\n石磊 discovered that the RxRPC Kerberos 5 ticket handling code in the\nLinux kernel did not properly verify metadata. A remote attacker could use\nthis to cause a denial of service (system crash) or possibly execute\narbitrary code. (CVE-2017-7482)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-126.175~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-3.13.0-126-generic-lpae": {
          "version": "3.13.0-126.175~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.126.117"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.126.117"
        },
        "linux-image-3.13.0-126-generic": {
          "version": "3.13.0-126.175~precise1"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1502132634.468472,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2016-8405",
    "CVE-2017-1000365",
    "CVE-2017-2618",
    "CVE-2017-7482"
  ],
  "id": "USN-3381-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}
