{
  "description": "Gaël Delalleau discovered a buffer overflow in the env_opt_add()\nfunction of the Kerberos 4 and 5 telnet clients. By sending specially\ncrafted replies, a malicious telnet server could exploit this to\nexecute arbitrary code with the privileges of the user running the\ntelnet client. (CVE-2005-0468)\n\nGaël Delalleau discovered a buffer overflow in the handling of the\nLINEMODE suboptions in the telnet clients of Kerberos 4 and 5. By\nsending a specially constructed reply containing a large number of SLC\n(Set Local Character) commands, a remote attacker (i. e.  a malicious\ntelnet server) could execute arbitrary commands with the privileges of\nthe user running the telnet client. (CVE-2005-0469)\n\nDaniel Wachdorf discovered two remote vulnerabilities in the Key\nDistribution Center of Kerberos 5 (krb5-kdc). By sending certain TCP\nconnection requests, a remote attacker could trigger a double-freeing\nof memory, which led to memory corruption and a crash of the KDC\nserver. (CVE-2005-1174). Under rare circumstances the same type of TCP\nconnection requests could also trigger a buffer overflow that could be\nexploited to run arbitrary code with the privileges of the KDC server.\n(CVE-2005-1175)\n\nMagnus Hagander discovered that the krb5_recvauth() function attempted\nto free previously freed memory in some situations. A remote attacker\ncould possibly exploit this to run arbitrary code with the privileges\nof the program that called this function. Most imporantly, this\naffects the following daemons: kpropd (from the krb5-kdc package),\nklogind, and kshd (both from the krb5-rsh-server package).\n(CVE-2005-1689)\n\nPlease note that these packages are not officially supported by Ubuntu\n(they are in the 'universe' component of the archive).",
  "releases": {
    "warty": {
      "binaries": {
        "krb5-rsh-server": {
          "version": ""
        },
        "krb5-kdc": {
          "version": ""
        },
        "krb5-clients": {
          "version": ""
        },
        "krb5-telnetd": {
          "version": ""
        },
        "kerberos4kth-clients": {
          "version": ""
        }
      }
    },
    "hoary": {
      "binaries": {
        "krb5-rsh-server": {
          "version": ""
        },
        "krb5-kdc": {
          "version": ""
        },
        "krb5-clients": {
          "version": ""
        },
        "krb5-telnetd": {
          "version": ""
        },
        "kerberos4kth-clients": {
          "version": ""
        }
      }
    }
  },
  "title": "Kerberos vulnerabilities",
  "timestamp": 1133892120,
  "summary": "krb4, krb5 vulnerabilities",
  "id": "USN-224-1",
  "cves": [
    "CVE-2005-0468",
    "CVE-2005-0469",
    "CVE-2005-1174",
    "CVE-2005-1175",
    "CVE-2005-1689"
  ]
}
