{
  "description": "Jann Horn discovered that the extended Berkeley Packet Filter (eBPF)\nimplementation in the Linux kernel did not properly reference count file\ndescriptors, leading to a use-after-free. A local unprivileged attacker\ncould use this to gain administrative privileges.\n\nRalf Spenneberg discovered that the USB sound subsystem in the Linux kernel\ndid not properly validate USB device descriptors. An attacker with physical\naccess could use this to cause a denial of service (system crash).\n(CVE-2016-2184)\n\nRalf Spenneberg discovered that the ATI Wonder Remote II USB driver in the\nLinux kernel did not properly validate USB device descriptors. An attacker\nwith physical access could use this to cause a denial of service (system\ncrash). (CVE-2016-2185)\n\nRalf Spenneberg discovered that the PowerMate USB driver in the Linux\nkernel did not properly validate USB device descriptors. An attacker with\nphysical access could use this to cause a denial of service (system crash).\n(CVE-2016-2186)\n\nRalf Spenneberg discovered that the I/O-Warrior USB device driver in the\nLinux kernel did not properly validate USB device descriptors. An attacker\nwith physical access could use this to cause a denial of service (system\ncrash). (CVE-2016-2188)\n\nSergej Schumilo, Hendrik Schwartke, and Ralf Spenneberg discovered that the\nMCT USB RS232 Converter device driver in the Linux kernel did not properly\nvalidate USB device descriptors. An attacker with physical access could use\nthis to cause a denial of service (system crash). (CVE-2016-3136)\n\nSergej Schumilo, Hendrik Schwartke, and Ralf Spenneberg discovered that the\nCypress M8 USB device driver in the Linux kernel did not properly validate\nUSB device descriptors. An attacker with physical access could use this to\ncause a denial of service (system crash). (CVE-2016-3137)\n\nSergej Schumilo, Hendrik Schwartke, and Ralf Spenneberg discovered that the\nUSB abstract device control driver for modems and ISDN adapters did not\nvalidate endpoint descriptors. An attacker with physical access could use\nthis to cause a denial of service (system crash). (CVE-2016-3138)\n\nSergej Schumilo, Hendrik Schwartke, and Ralf Spenneberg discovered that the\nLinux kernel's USB driver for Digi AccelePort serial converters did not\nproperly validate USB device descriptors. An attacker with physical access\ncould use this to cause a denial of service (system crash). (CVE-2016-3140)\n\nIt was discovered that the IPv4 implementation in the Linux kernel did not\nperform the destruction of inet device objects properly. An attacker in a\nguest OS could use this to cause a denial of service (networking outage) in\nthe host OS. (CVE-2016-3156)\n\nAndy Lutomirski discovered that the Linux kernel did not properly context-\nswitch IOPL on 64-bit PV Xen guests. An attacker in a guest OS could use\nthis to cause a denial of service (guest OS crash), gain privileges, or\nobtain sensitive information. (CVE-2016-3157)\n\nHector Marco and Ismael Ripoll discovered that the Linux kernel would\nimproperly disable Address Space Layout Randomization (ASLR) for x86\nprocesses running in 32 bit mode if stack-consumption resource limits were\ndisabled. A local attacker could use this to make it easier to exploit an\nexisting vulnerability in a setuid/setgid program. (CVE-2016-3672)\n\nIt was discovered that the Linux kernel's USB driver for IMS Passenger\nControl Unit devices did not properly validate the device's interfaces. An\nattacker with physical access could use this to cause a denial of service\n(system crash). (CVE-2016-3689)\n\nAndrey Konovalov discovered that the CDC Network Control Model USB driver\nin the Linux kernel did not cancel work events queued if a later error\noccurred, resulting in a use-after-free. An attacker with physical access\ncould use this to cause a denial of service (system crash). (CVE-2016-3951)\n\nIt was discovered that an out-of-bounds write could occur when handling\nincoming packets in the USB/IP implementation in the Linux kernel. A remote\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2016-3955)\n",
  "releases": {
    "xenial": {
      "allbinaries": {
        "linux-image-4.4.0-1013-snapdragon": {
          "pocket": "security",
          "version": "4.4.0-1013.14"
        }
      },
      "binaries": {
        "linux-image-4.4.0-1013-snapdragon": {
          "pocket": "security",
          "version": "4.4.0-1013.14"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-snapdragon/linux-snapdragon_4.4.0-1013.14.dsc": {
              "size": 3362,
              "md5": "eb124a0f7eaeb07de7174ff91263a60f"
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-snapdragon/linux-snapdragon_4.4.0.orig.tar.gz": {
              "size": 132860730,
              "md5": "2070b49688e8d7ee7ff4c33590afc698"
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/l/linux-snapdragon/linux-snapdragon_4.4.0-1013.14.diff.gz": {
              "size": 11962909,
              "md5": "8a21ff3eca544ca0bff37e1b1c186011"
            }
          }
        },
        "arm64": {
          "urls": {
            "http://ports.ubuntu.com/pool/universe/l/linux-snapdragon/linux-snapdragon-headers-4.4.0-1013_4.4.0-1013.14_arm64.deb": {
              "size": 9907970,
              "md5": "da6c4bb20853d8c5214ab09ea11067ee"
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-snapdragon/linux-image-4.4.0-1013-snapdragon_4.4.0-1013.14_arm64.deb": {
              "size": 53377742,
              "md5": "feb843f958a854a262ce9b57ea9d89d5"
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-snapdragon/linux-headers-4.4.0-1013-snapdragon_4.4.0-1013.14_arm64.deb": {
              "size": 756016,
              "md5": "e9ef68f2e6fbc0ab2316a59942afe686"
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-snapdragon/linux-snapdragon-tools-4.4.0-1013_4.4.0-1013.14_arm64.deb": {
              "size": 534600,
              "md5": "ae103a0b8742c8243054ce28e832d31b"
            },
            "http://ports.ubuntu.com/pool/universe/l/linux-snapdragon/linux-tools-4.4.0-1013-snapdragon_4.4.0-1013.14_arm64.deb": {
              "size": 1824,
              "md5": "7b9d5a4397179a92b8c0b82358dccb74"
            }
          }
        }
      },
      "sources": {
        "linux-snapdragon": {
          "version": "4.4.0-1013.14",
          "description": "Linux kernel for Snapdragon Processors"
        }
      }
    }
  },
  "title": "Linux kernel (Qualcomm Snapdragon) vulnerability",
  "timestamp": 1462567052.785615,
  "summary": "linux-snapdragon vulnerability",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2016-4557",
    "CVE-2016-2184",
    "CVE-2016-2185",
    "CVE-2016-2186",
    "CVE-2016-2188",
    "CVE-2016-3136",
    "CVE-2016-3137",
    "CVE-2016-3138",
    "CVE-2016-3140",
    "CVE-2016-3156",
    "CVE-2016-3157",
    "CVE-2016-3672",
    "CVE-2016-3689",
    "CVE-2016-3951",
    "CVE-2016-3955"
  ],
  "id": "USN-2965-4",
  "isummary": "Several security issues were fixed in the kernel.\n"
}
