{
  "description": "USN-3360-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nIt was discovered that the Linux kernel did not properly initialize a Wake-\non-Lan data structure. A local attacker could use this to expose sensitive\ninformation (kernel memory). (CVE-2014-9900)\n\nIt was discovered that the Linux kernel did not properly restrict access to\n/proc/iomem. A local attacker could use this to expose sensitive\ninformation. (CVE-2015-8944)\n\nIt was discovered that a use-after-free vulnerability existed in the\nperformance events and counters subsystem of the Linux kernel for ARM64. A\nlocal attacker could use this to cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2015-8955)\n\nIt was discovered that the SCSI generic (sg) driver in the Linux kernel\ncontained a double-free vulnerability. A local attacker could use this to\ncause a denial of service (system crash). (CVE-2015-8962)\n\nSasha Levin discovered that a race condition existed in the performance\nevents and counters subsystem of the Linux kernel when handling CPU unplug\nevents. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2015-8963)\n\nTilman Schmidt and Sasha Levin discovered a use-after-free condition in the\nTTY implementation in the Linux kernel. A local attacker could use this to\nexpose sensitive information (kernel memory). (CVE-2015-8964)\n\nIt was discovered that the fcntl64() system call in the Linux kernel did\nnot properly set memory limits when returning on 32-bit ARM processors. A\nlocal attacker could use this to gain administrative privileges.\n(CVE-2015-8966)\n\nIt was discovered that the system call table for ARM 64-bit processors in\nthe Linux kernel was not write-protected. An attacker could use this in\nconjunction with another kernel vulnerability to execute arbitrary code.\n(CVE-2015-8967)\n\nIt was discovered that the generic SCSI block layer in the Linux kernel did\nnot properly restrict write operations in certain situations. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly gain administrative privileges. (CVE-2016-10088)\n\nAlexander Potapenko discovered a race condition in the Advanced Linux Sound\nArchitecture (ALSA) subsystem in the Linux kernel. A local attacker could\nuse this to expose sensitive information (kernel memory).\n(CVE-2017-1000380)\n\nLi Qiang discovered that the DRM driver for VMware Virtual GPUs in the\nLinux kernel did not properly validate some ioctl arguments. A local\nattacker could use this to cause a denial of service (system crash).\n(CVE-2017-7346)\n\nTuomas Haanpää and Ari Kauppi discovered that the NFSv2 and NFSv3 server\nimplementations in the Linux kernel did not properly check for the end of\nbuffer. A remote attacker could use this to craft requests that cause a\ndenial of service (system crash) or possibly execute arbitrary code.\n(CVE-2017-7895)\n\nIt was discovered that an integer underflow existed in the Edgeport USB\nSerial Converter device driver of the Linux kernel. An attacker with\nphysical access could use this to expose sensitive information (kernel\nmemory). (CVE-2017-8924)\n\nIt was discovered that the USB ZyXEL omni.net LCD PLUS driver in the Linux\nkernel did not properly perform reference counting. A local attacker could\nuse this to cause a denial of service (tty exhaustion). (CVE-2017-8925)\n\nAndrey Konovalov discovered an IPv6 out-of-bounds read error in the Linux\nkernel's IPv6 stack. A local attacker could cause a denial of service or\npotentially other unspecified problems. (CVE-2017-9074)\n\nMurray McAllister discovered that the DRM driver for VMware Virtual GPUs in\nthe Linux kernel did not properly initialize memory. A local attacker could\nuse this to expose sensitive information (kernel memory). (CVE-2017-9605)\n\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-125.174~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise"
        }
      },
      "binaries": {
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.125.116"
        },
        "linux-image-3.13.0-125-generic": {
          "version": "3.13.0-125.174~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.125.116"
        },
        "linux-image-3.13.0-125-generic-lpae": {
          "version": "3.13.0-125.174~precise1"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1500665149.064828,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2014-9900",
    "CVE-2015-8944",
    "CVE-2015-8955",
    "CVE-2015-8962",
    "CVE-2015-8963",
    "CVE-2015-8964",
    "CVE-2015-8966",
    "CVE-2015-8967",
    "CVE-2016-10088",
    "CVE-2017-1000380",
    "CVE-2017-7346",
    "CVE-2017-7895",
    "CVE-2017-8924",
    "CVE-2017-8925",
    "CVE-2017-9074",
    "CVE-2017-9605"
  ],
  "id": "USN-3360-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}
