{
  "description": "Jiasheng Jiang discovered that the HSA Linux kernel driver for AMD Radeon\nGPU devices did not properly validate memory allocation in certain\nsituations, leading to a null pointer dereference vulnerability. A local\nattacker could use this to cause a denial of service (system crash).\n(CVE-2022-3108)\n\nZheng Wang discovered that the Intel i915 graphics driver in the Linux\nkernel did not properly handle certain error conditions, leading to a\ndouble-free. A local attacker could possibly use this to cause a denial of\nservice (system crash). (CVE-2022-3707)\n\nIt was discovered that the infrared transceiver USB driver did not properly\nhandle USB control messages. A local attacker with physical access could\nplug in a specially crafted USB device to cause a denial of service (memory\nexhaustion). (CVE-2022-3903)\n\nHaowei Yan discovered that a race condition existed in the Layer 2\nTunneling Protocol (L2TP) implementation in the Linux kernel. A local\nattacker could possibly use this to cause a denial of service (system\ncrash). (CVE-2022-4129)\n\nJordy Zomer and Alexandra Sandulescu discovered that syscalls invoking the\ndo_prlimit() function in the Linux kernel did not properly handle\nspeculative execution barriers. A local attacker could use this to expose\nsensitive information (kernel memory). (CVE-2023-0458)\n\nJordy Zomer and Alexandra Sandulescu discovered that the Linux kernel did\nnot properly implement speculative execution barriers in usercopy functions\nin certain situations. A local attacker could use this to expose sensitive\ninformation (kernel memory). (CVE-2023-0459)\n\nIt was discovered that the Human Interface Device (HID) support driver in\nthe Linux kernel contained a type confusion vulnerability in some\nsituations. A local attacker could use this to cause a denial of service\n(system crash). (CVE-2023-1073)\n\nIt was discovered that a memory leak existed in the SCTP protocol\nimplementation in the Linux kernel. A local attacker could use this to\ncause a denial of service (memory exhaustion). (CVE-2023-1074)\n\nIt was discovered that the TLS subsystem in the Linux kernel contained a\ntype confusion vulnerability in some situations. A local attacker could use\nthis to cause a denial of service (system crash) or possibly expose\nsensitive information. (CVE-2023-1075)\n\nIt was discovered that the TUN/TAP driver in the Linux kernel did not\nproperly initialize socket data. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2023-1076)\n\nIt was discovered that the Real-Time Scheduling Class implementation in the\nLinux kernel contained a type confusion vulnerability in some situations. A\nlocal attacker could use this to cause a denial of service (system crash).\n(CVE-2023-1077)\n\nIt was discovered that the Reliable Datagram Sockets (RDS) protocol\nimplementation in the Linux kernel contained a type confusion vulnerability\nin some situations. An attacker could use this to cause a denial of service\n(system crash). (CVE-2023-1078)\n\nIt was discovered that the ASUS HID driver in the Linux kernel did not\nproperly handle device removal, leading to a use-after-free vulnerability.\nA local attacker with physical access could plug in a specially crafted USB\ndevice to cause a denial of service (system crash). (CVE-2023-1079)\n\nDuoming Zhou discovered that a race condition existed in the infrared\nreceiver/transceiver driver in the Linux kernel, leading to a use-after-\nfree vulnerability. A privileged attacker could use this to cause a denial\nof service (system crash) or possibly execute arbitrary code.\n(CVE-2023-1118)\n\nIt was discovered that the Traffic-Control Index (TCINDEX) implementation\nin the Linux kernel contained a use-after-free vulnerability. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2023-1281)\n\nIt was discovered that the Broadcom FullMAC USB WiFi driver in the Linux\nkernel did not properly perform data buffer size validation in some\nsituations. A physically proximate attacker could use this to craft a\nmalicious USB device that when inserted, could cause a denial of service\n(system crash) or possibly expose sensitive information. (CVE-2023-1380)\n\nXingyuan Mo discovered that the x86 KVM implementation in the Linux kernel\ndid not properly initialize some data structures. A local attacker could\nuse this to expose sensitive information (kernel memory). (CVE-2023-1513)\n\nIt was discovered that the Xircom PCMCIA network device driver in the Linux\nkernel did not properly handle device removal events. A physically\nproximate attacker could use this to cause a denial of service (system\ncrash). (CVE-2023-1670)\n\nIt was discovered that the Traffic-Control Index (TCINDEX) implementation\nin the Linux kernel did not properly perform filter deactivation in some\nsituations. A local attacker could possibly use this to gain elevated\nprivileges. Please note that with the fix for this CVE, kernel support for\nthe TCINDEX classifier has been removed. (CVE-2023-1829)\n\nIt was discovered that a race condition existed in the Xen transport layer\nimplementation for the 9P file system protocol in the Linux kernel, leading\nto a use-after-free vulnerability. A local attacker could use this to cause\na denial of service (guest crash) or expose sensitive information (guest\nkernel memory). (CVE-2023-1859)\n\nJose Oliveira and Rodrigo Branco discovered that the Spectre Variant 2\nmitigations with prctl syscall were insufficient in some situations. A\nlocal attacker could possibly use this to expose sensitive information.\n(CVE-2023-1998)\n\nIt was discovered that a use-after-free vulnerability existed in the iSCSI\nTCP implementation in the Linux kernel. A local attacker could possibly use\nthis to cause a denial of service (system crash). (CVE-2023-2162)\n\nIt was discovered that the BigBen Interactive Kids' gamepad driver in the\nLinux kernel did not properly handle device removal, leading to a use-\nafter-free vulnerability. A local attacker with physical access could plug\nin a specially crafted USB device to cause a denial of service (system\ncrash). (CVE-2023-25012)\n\nJean-Baptiste Cayrou discovered that the shiftfs file system in the Ubuntu\nLinux kernel contained a race condition when handling inode locking in some\nsituations. A local attacker could use this to cause a denial of service\n(kernel deadlock). (CVE-2023-2612)\n\nLianhui Tang discovered that the MPLS implementation in the Linux kernel\ndid not properly handle certain sysctl allocation failure conditions,\nleading to a double-free vulnerability. An attacker could use this to cause\na denial of service or possibly execute arbitrary code. (CVE-2023-26545)\n\nIt was discovered that a use-after-free vulnerability existed in the HFS+\nfile system implementation in the Linux kernel. A local attacker could\npossibly use this to cause a denial of service (system crash).\n(CVE-2023-2985)\n\nReima Ishii discovered that the nested KVM implementation for Intel x86\nprocessors in the Linux kernel did not properly validate control registers\nin certain situations. An attacker in a guest VM could use this to cause a\ndenial of service (guest crash). (CVE-2023-30456)\n\nGwangun Jung discovered that the Quick Fair Queueing scheduler\nimplementation in the Linux kernel contained an out-of-bounds write\nvulnerability. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2023-31436)\n\nSanan Hasanov discovered that the framebuffer console driver in the Linux\nkernel did not properly perform checks for font dimension limits. A local\nattacker could use this to cause a denial of service (system crash).\n(CVE-2023-3161)\n\nPatryk Sondej and Piotr Krysiuk discovered that a race condition existed in\nthe netfilter subsystem of the Linux kernel when processing batch requests,\nleading to a use-after-free vulnerability. A local attacker could use this\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2023-32233)\n\nIt was discovered that the NET/ROM protocol implementation in the Linux\nkernel contained a race condition in some situations, leading to a use-\nafter-free vulnerability. A local attacker could use this to cause a denial\nof service (system crash) or possibly execute arbitrary code.\n(CVE-2023-32269)\n\n",
  "releases": {
    "focal": {
      "allbinaries": {
        "linux-modules-5.4.0-1024-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-xilinx-zynqmp",
          "version": "5.4.0-1024.28"
        },
        "linux-headers-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-meta-xilinx-zynqmp",
          "version": "5.4.0.1024.27"
        },
        "linux-image-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-meta-xilinx-zynqmp",
          "version": "5.4.0.1024.27"
        },
        "linux-tools-5.4.0-1024-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-xilinx-zynqmp",
          "version": "5.4.0-1024.28"
        },
        "linux-tools-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-meta-xilinx-zynqmp",
          "version": "5.4.0.1024.27"
        },
        "linux-xilinx-zynqmp-tools-5.4.0-1024": {
          "pocket": "security",
          "source": "linux-xilinx-zynqmp",
          "version": "5.4.0-1024.28"
        },
        "linux-image-5.4.0-1024-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-xilinx-zynqmp",
          "version": "5.4.0-1024.28"
        },
        "linux-buildinfo-5.4.0-1024-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-xilinx-zynqmp",
          "version": "5.4.0-1024.28"
        },
        "linux-headers-5.4.0-1024-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-xilinx-zynqmp",
          "version": "5.4.0-1024.28"
        },
        "linux-xilinx-zynqmp-headers-5.4.0-1024": {
          "pocket": "security",
          "source": "linux-xilinx-zynqmp",
          "version": "5.4.0-1024.28"
        },
        "linux-xilinx-zynqmp": {
          "pocket": "security",
          "source": "linux-meta-xilinx-zynqmp",
          "version": "5.4.0.1024.27"
        }
      },
      "binaries": {
        "linux-image-5.4.0-1024-xilinx-zynqmp": {
          "pocket": "security",
          "version": "5.4.0-1024.28"
        },
        "linux-image-xilinx-zynqmp": {
          "pocket": "security",
          "version": "5.4.0.1024.27"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-xilinx-zynqmp/linux-xilinx-zynqmp_5.4.0-1024.28.diff.gz": {
              "md5": "88aabead723a32c35b8e2a904f472048",
              "size": 13153165
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-xilinx-zynqmp/linux-meta-xilinx-zynqmp_5.4.0.1024.27.dsc": {
              "md5": "c2e1d3de1e96d1c51a0b6ba1c74b85af",
              "size": 2038
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-xilinx-zynqmp/linux-xilinx-zynqmp_5.4.0.orig.tar.gz": {
              "md5": "0707e4b2cbaf1428055d6615be04559e",
              "size": 170244619
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-meta-xilinx-zynqmp/linux-meta-xilinx-zynqmp_5.4.0.1024.27.tar.xz": {
              "md5": "be73b9cb0796e23bd4c53d09bd636de5",
              "size": 6592
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-xilinx-zynqmp/linux-xilinx-zynqmp_5.4.0-1024.28.dsc": {
              "md5": "1a9ec7c52d8a86284414866abc6219fb",
              "size": 4179
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-xilinx-zynqmp/linux-xilinx-zynqmp-headers-5.4.0-1024_5.4.0-1024.28_all.deb": {
              "md5": "321c84512bf4508cab3dd3e66b867d67",
              "size": 11367844
            }
          }
        },
        "arm64": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-meta-xilinx-zynqmp/linux-xilinx-zynqmp_5.4.0.1024.27_arm64.deb": {
              "md5": "cc48c96315ca470d12d9ea60fd87efa2",
              "size": 1936
            },
            "http://ports.ubuntu.com/pool/main/l/linux-xilinx-zynqmp/linux-image-5.4.0-1024-xilinx-zynqmp_5.4.0-1024.28_arm64.deb": {
              "md5": "7812292d42df17debc0a4e2607cf95cd",
              "size": 10830720
            },
            "http://ports.ubuntu.com/pool/main/l/linux-xilinx-zynqmp/linux-buildinfo-5.4.0-1024-xilinx-zynqmp_5.4.0-1024.28_arm64.deb": {
              "md5": "f3378c60f1e72665317c78bff3f73de4",
              "size": 480016
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-xilinx-zynqmp/linux-image-xilinx-zynqmp_5.4.0.1024.27_arm64.deb": {
              "md5": "04dab7392937a6c61e8c7b5d003d752b",
              "size": 2580
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-xilinx-zynqmp/linux-headers-xilinx-zynqmp_5.4.0.1024.27_arm64.deb": {
              "md5": "be7931cd472aa3e12f73f348209cd5a2",
              "size": 2528
            },
            "http://ports.ubuntu.com/pool/main/l/linux-xilinx-zynqmp/linux-xilinx-zynqmp-tools-5.4.0-1024_5.4.0-1024.28_arm64.deb": {
              "md5": "fff79023f523721a6a1e2fd61b753ebc",
              "size": 5051592
            },
            "http://ports.ubuntu.com/pool/main/l/linux-xilinx-zynqmp/linux-modules-5.4.0-1024-xilinx-zynqmp_5.4.0-1024.28_arm64.deb": {
              "md5": "bc62973ab882450d40bc4ccff55ae406",
              "size": 2407824
            },
            "http://ports.ubuntu.com/pool/main/l/linux-xilinx-zynqmp/linux-headers-5.4.0-1024-xilinx-zynqmp_5.4.0-1024.28_arm64.deb": {
              "md5": "63fbcbbc5cd4a13989233cd1b88c3d2f",
              "size": 850424
            },
            "http://ports.ubuntu.com/pool/main/l/linux-xilinx-zynqmp/linux-tools-5.4.0-1024-xilinx-zynqmp_5.4.0-1024.28_arm64.deb": {
              "md5": "ba95e366fe18382fa704b10157ecee47",
              "size": 1952
            },
            "http://ports.ubuntu.com/pool/main/l/linux-meta-xilinx-zynqmp/linux-tools-xilinx-zynqmp_5.4.0.1024.27_arm64.deb": {
              "md5": "23bc0bc7019c7b55d09d60fbff953060",
              "size": 2528
            }
          }
        }
      },
      "sources": {
        "linux-xilinx-zynqmp": {
          "version": "5.4.0-1024.28",
          "description": "Linux kernel for Xilinx ZynqMP processors"
        }
      }
    }
  },
  "title": "Linux kernel (Xilinx ZynqMP) vulnerabilities",
  "timestamp": 1689188995.868028,
  "summary": "linux-xilinx-zynqmp vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "isummary": "Several security issues were fixed in the Linux kernel.\n",
  "id": "USN-6222-1",
  "cves": [
    "CVE-2022-3108",
    "CVE-2022-3707",
    "CVE-2022-3903",
    "CVE-2022-4129",
    "CVE-2023-0458",
    "CVE-2023-0459",
    "CVE-2023-1073",
    "CVE-2023-1074",
    "CVE-2023-1075",
    "CVE-2023-1076",
    "CVE-2023-1077",
    "CVE-2023-1078",
    "CVE-2023-1079",
    "CVE-2023-1118",
    "CVE-2023-1281",
    "CVE-2023-1380",
    "CVE-2023-1513",
    "CVE-2023-1670",
    "CVE-2023-1829",
    "CVE-2023-1859",
    "CVE-2023-1998",
    "CVE-2023-2162",
    "CVE-2023-25012",
    "CVE-2023-2612",
    "CVE-2023-26545",
    "CVE-2023-2985",
    "CVE-2023-30456",
    "CVE-2023-31436",
    "CVE-2023-3161",
    "CVE-2023-32233",
    "CVE-2023-32269"
  ]
}
