{
  "description": "USN-3550-1 fixed several vulnerabilities in ClamAV. This update\nprovides the corresponding update for Ubuntu 12.04 ESM.\n\nOriginal advisory details:\n\n It was discovered that ClamAV incorrectly handled parsing certain mail\n messages. A remote attacker could use this issue to cause ClamAV to crash,\n resulting in a denial of service, or possibly execute arbitrary code.\n (CVE-2017-12374, CVE-2017-12375, CVE-2017-12379, CVE-2017-12380)\n\n It was discovered that ClamAV incorrectly handled parsing certain PDF\n files. A remote attacker could use this issue to cause ClamAV to crash,\n resulting in a denial of service, or possibly execute arbitrary code.\n (CVE-2017-12376)\n\n It was discovered that ClamAV incorrectly handled parsing certain mew\n packet files. A remote attacker could use this issue to cause ClamAV to\n crash, resulting in a denial of service, or possibly execute arbitrary\n code. (CVE-2017-12377)\n\n It was discovered that ClamAV incorrectly handled parsing certain TAR\n files. A remote attacker could possibly use this issue to cause ClamAV to\n crash, resulting in a denial of service. (CVE-2017-12378)\n\n In the default installation, attackers would be isolated by the ClamAV\n AppArmor profile.\n",
  "releases": {
    "precise": {
      "sources": {
        "clamav": {
          "version": "0.99.3+addedllvm-0ubuntu0.12.04.1",
          "description": "Anti-virus utility for Unix"
        }
      },
      "binaries": {
        "clamav": {
          "version": "0.99.3+addedllvm-0ubuntu0.12.04.1"
        }
      }
    }
  },
  "title": "ClamAV vulnerabilities",
  "timestamp": 1517846725.420655,
  "summary": "clamav vulnerabilities",
  "action": "This update uses a new upstream release, which includes additional bug\nfixes. In general, a standard system update will make all the necessary\nchanges.\n",
  "cves": [
    "CVE-2017-12374",
    "CVE-2017-12375",
    "CVE-2017-12376",
    "CVE-2017-12377",
    "CVE-2017-12378",
    "CVE-2017-12379",
    "CVE-2017-12380"
  ],
  "id": "USN-3550-2",
  "isummary": "Several security issues were fixed in ClamAV.\n"
}
