{
  "description": "\nDan Rosenberg discovered that several network ioctls did not clear kernel\nmemory correctly. A local user could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-3296, CVE-2010-3297)\n\nBrad Spengler discovered that stack memory for new a process was not\ncorrectly calculated. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-3858)\n\nDan Rosenberg discovered that the Linux kernel TIPC implementation\ncontained multiple integer signedness errors. A local attacker could\nexploit this to gain root privileges. (CVE-2010-3859)\n\nDan Rosenberg discovered that the CAN protocol on 64bit systems did not\ncorrectly calculate the size of certain buffers. A local attacker could\nexploit this to crash the system or possibly execute arbitrary code as the\nroot user. (CVE-2010-3874)\n\nNelson Elhage discovered that the Linux kernel IPv4 implementation did not\nproperly audit certain bytecodes in netlink messages. A local attacker\ncould exploit this to cause the kernel to hang, leading to a denial of\nservice. (CVE-2010-3880)\n\nDan Rosenberg discovered that IPC structures were not correctly initialized\non 64bit systems. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4073)\n\nDan Rosenberg discovered that multiple terminal ioctls did not correctly\ninitialize structure memory. A local attacker could exploit this to read\nportions of kernel stack memory, leading to a loss of privacy.\n(CVE-2010-4075, CVE-2010-4076, CVE-2010-4077)\n\nDan Rosenberg discovered that the RME Hammerfall DSP audio interface driver\ndid not correctly clear kernel memory. A local attacker could exploit this\nto read kernel stack memory, leading to a loss of privacy. (CVE-2010-4080,\nCVE-2010-4081)\n\nDan Rosenberg discovered that the VIA video driver did not correctly clear\nkernel memory. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4082)\n\nDan Rosenberg discovered that the semctl syscall did not correctly clear\nkernel memory. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4083)\n\nJames Bottomley discovered that the ICP vortex storage array controller\ndriver did not validate certain sizes. A local attacker on a 64bit system\ncould exploit this to crash the kernel, leading to a denial of service.\n(CVE-2010-4157)\n\nDan Rosenberg discovered that the Linux kernel L2TP implementation\ncontained multiple integer signedness errors. A local attacker could\nexploit this to to crash the kernel, or possibly gain root privileges.\n(CVE-2010-4160)\n\nDan Rosenberg discovered that certain iovec operations did not calculate\npage counts correctly. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4162)\n\nDan Rosenberg discovered that the SCSI subsystem did not correctly validate\niov segments. A local attacker with access to a SCSI device could send\nspecially crafted requests to crash the system, leading to a denial of\nservice. (CVE-2010-4163, CVE-2010-4668)\n\nDave Jones discovered that the mprotect system call did not correctly\nhandle merged VMAs. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4169)\n\nDan Rosenberg discovered that the RDS protocol did not correctly check\nioctl arguments. A local attacker could exploit this to crash the system,\nleading to a denial of service. (CVE-2010-4175)\n\nAlan Cox discovered that the HCI UART driver did not correctly check if a\nwrite operation was available. If the mmap_min-addr sysctl was changed from\nthe Ubuntu default to a value of 0, a local attacker could exploit this\nflaw to gain root privileges. (CVE-2010-4242)\n\nBrad Spengler discovered that the kernel did not correctly account for\nuserspace memory allocations during exec() calls. A local attacker could\nexploit this to consume all system memory, leading to a denial of service.\n(CVE-2010-4243)\n\nIt was discovered that multithreaded exec did not handle CPU timers\ncorrectly. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2010-4248)\n\nIt was discovered that named pipes did not correctly handle certain fcntl\ncalls. A local attacker could exploit this to crash the system, leading to\na denial of service. (CVE-2010-4256)\n\nDan Rosenburg discovered that the CAN subsystem leaked kernel addresses\ninto the /proc filesystem. A local attacker could use this to increase the\nchances of a successful memory corruption exploit. (CVE-2010-4565)\n\nDan Carpenter discovered that the Infiniband driver did not correctly\nhandle certain requests. A local user could exploit this to crash the\nsystem or potentially gain root privileges. (CVE-2010-4649, CVE-2011-1044)\n\nKees Cook discovered that some ethtool functions did not correctly clear\nheap memory. A local attacker with CAP_NET_ADMIN privileges could exploit\nthis to read portions of kernel heap memory, leading to a loss of privacy.\n(CVE-2010-4655)\n\nKees Cook discovered that the IOWarrior USB device driver did not correctly\ncheck certain size fields. A local attacker with physical access could plug\nin a specially crafted USB device to crash the system or potentially gain\nroot privileges. (CVE-2010-4656)\n\nGoldwyn Rodrigues discovered that the OCFS2 filesystem did not correctly\nclear memory when writing certain file holes. A local attacker could\nexploit this to read uninitialized data from the disk, leading to a loss of\nprivacy. (CVE-2011-0463)\n\nDan Carpenter discovered that the TTPCI DVB driver did not check certain\nvalues during an ioctl. If the dvb-ttpci module was loaded, a local\nattacker could exploit this to crash the system, leading to a denial of\nservice, or possibly gain root privileges. (CVE-2011-0521)\n\nJens Kuehnel discovered that the InfiniBand driver contained a race\ncondition. On systems using InfiniBand, a local attacker could send\nspecially crafted requests to crash the system, leading to a denial of\nservice. (CVE-2011-0695)\n\nDan Rosenberg discovered that XFS did not correctly initialize memory. A\nlocal attacker could make crafted ioctl calls to leak portions of kernel\nstack memory, leading to a loss of privacy. (CVE-2011-0711)\n\nRafael Dominguez Vega discovered that the caiaq Native Instruments USB\ndriver did not correctly validate string lengths. A local attacker with\nphysical access could plug in a specially crafted USB device to crash the\nsystem or potentially gain root privileges. (CVE-2011-0712)\n\nKees Cook reported that /proc/pid/stat did not correctly filter certain\nmemory locations. A local attacker could determine the memory layout of\nprocesses in an attempt to increase the chances of a successful memory\ncorruption exploit. (CVE-2011-0726)\n\nTimo Warns discovered that MAC partition parsing routines did not correctly\ncalculate block counts. A local attacker with physical access could plug in\na specially crafted block device to crash the system or potentially gain\nroot privileges. (CVE-2011-1010)\n\nTimo Warns discovered that LDM partition parsing routines did not correctly\ncalculate block counts. A local attacker with physical access could plug in\na specially crafted block device to crash the system, leading to a denial\nof service. (CVE-2011-1012)\n\nMatthiew Herrb discovered that the drm modeset interface did not correctly\nhandle a signed comparison. A local attacker could exploit this to crash\nthe system or possibly gain root privileges. (CVE-2011-1013)\n\nMarek Olšák discovered that the Radeon GPU drivers did not correctly\nvalidate certain registers. On systems with specific hardware, a local\nattacker could exploit this to write to arbitrary video memory.\n(CVE-2011-1016)\n\nTimo Warns discovered that the LDM disk partition handling code did not\ncorrectly handle certain values. By inserting a specially crafted disk\ndevice, a local attacker could exploit this to gain root privileges.\n(CVE-2011-1017)\n\nVasiliy Kulikov discovered that the CAP_SYS_MODULE capability was not\nneeded to load kernel modules. A local attacker with the CAP_NET_ADMIN\ncapability could load existing kernel modules, possibly increasing the\nattack surface available on the system. (CVE-2011-1019)\n\nIt was discovered that the /proc filesystem did not correctly handle\npermission changes when programs executed. A local attacker could hold open\nfiles to examine details about programs running with higher privileges,\npotentially increasing the chances of exploiting additional\nvulnerabilities. (CVE-2011-1020)\n\nVasiliy Kulikov discovered that the Bluetooth stack did not correctly clear\nmemory. A local attacker could exploit this to read kernel stack memory,\nleading to a loss of privacy. (CVE-2011-1078)\n\nVasiliy Kulikov discovered that the Bluetooth stack did not correctly check\nthat device name strings were NULL terminated. A local attacker could\nexploit this to crash the system, leading to a denial of service, or leak\ncontents of kernel stack memory, leading to a loss of privacy.\n(CVE-2011-1079)\n\nVasiliy Kulikov discovered that bridge network filtering did not check that\nname fields were NULL terminated. A local attacker could exploit this to\nleak contents of kernel stack memory, leading to a loss of privacy.\n(CVE-2011-1080)\n\nNelson Elhage discovered that the epoll subsystem did not correctly handle\ncertain structures. A local attacker could create malicious requests that\nwould hang the system, leading to a denial of service. (CVE-2011-1082)\n\nNeil Horman discovered that NFSv4 did not correctly handle certain orders\nof operation with ACL data. A remote attacker with access to an NFSv4 mount\ncould exploit this to crash the system, leading to a denial of service.\n(CVE-2011-1090)\n\nJohan Hovold discovered that the DCCP network stack did not correctly\nhandle certain packet combinations. A remote attacker could send specially\ncrafted network traffic that would crash the system, leading to a denial of\nservice. (CVE-2011-1093)\n\nPeter Huewe discovered that the TPM device did not correctly initialize\nmemory. A local attacker could exploit this to read kernel heap memory\ncontents, leading to a loss of privacy. (CVE-2011-1160)\n\nTimo Warns discovered that OSF partition parsing routines did not correctly\nclear memory. A local attacker with physical access could plug in a\nspecially crafted block device to read kernel memory, leading to a loss of\nprivacy. (CVE-2011-1163)\n\nDan Rosenberg discovered that some ALSA drivers did not correctly check the\nadapter index during ioctl calls. If this driver was loaded, a local\nattacker could make a specially crafted ioctl call to gain root privileges.\n(CVE-2011-1169)\n\nVasiliy Kulikov discovered that the netfilter code did not check certain\nstrings copied from userspace. A local attacker with netfilter access could\nexploit this to read kernel memory or crash the system, leading to a denial\nof service. (CVE-2011-1170, CVE-2011-1171, CVE-2011-1172, CVE-2011-2534)\n\nVasiliy Kulikov discovered that the Acorn Universal Networking driver did\nnot correctly initialize memory. A remote attacker could send specially\ncrafted traffic to read kernel stack memory, leading to a loss of privacy.\n(CVE-2011-1173)\n\nDan Rosenberg discovered that the IRDA subsystem did not correctly check\ncertain field sizes. If a system was using IRDA, a remote attacker could\nsend specially crafted traffic to crash the system or gain root privileges.\n(CVE-2011-1180)\n\nJulien Tinnes discovered that the kernel did not correctly validate the\nsignal structure from tkill(). A local attacker could exploit this to send\nsignals to arbitrary threads, possibly bypassing expected restrictions.\n(CVE-2011-1182)\n\nRyan Sweat discovered that the GRO code did not correctly validate memory.\nIn some configurations on systems using VLANs, a remote attacker could send\nspecially crafted traffic to crash the system, leading to a denial of\nservice. (CVE-2011-1478)\n\nDan Rosenberg discovered that the X.25 Rose network stack did not correctly\nhandle certain fields. If a system was running with Rose enabled, a remote\nattacker could send specially crafted traffic to gain root privileges.\n(CVE-2011-1493)\n\nDan Rosenberg discovered that MPT devices did not correctly validate\ncertain values in ioctl calls. If these drivers were loaded, a local\nattacker could exploit this to read arbitrary kernel memory, leading to a\nloss of privacy. (CVE-2011-1494, CVE-2011-1495)\n\nTimo Warns discovered that the GUID partition parsing routines did not\ncorrectly validate certain structures. A local attacker with physical\naccess could plug in a specially crafted block device to crash the system,\nleading to a denial of service. (CVE-2011-1577)\n\nTavis Ormandy discovered that the pidmap function did not correctly handle\nlarge requests. A local attacker could exploit this to crash the system,\nleading to a denial of service. (CVE-2011-1593)\n\nOliver Hartkopp and Dave Jones discovered that the CAN network driver did\nnot correctly validate certain socket structures. If this driver was\nloaded, a local attacker could crash the system, leading to a denial of\nservice. (CVE-2011-1598, CVE-2011-1748)\n\nVasiliy Kulikov discovered that the AGP driver did not check certain ioctl\nvalues. A local attacker with access to the video subsystem could exploit\nthis to crash the system, leading to a denial of service, or possibly gain\nroot privileges. (CVE-2011-1745, CVE-2011-2022)\n\nVasiliy Kulikov discovered that the AGP driver did not check the size of\ncertain memory allocations. A local attacker with access to the video\nsubsystem could exploit this to run the system out of memory, leading to a\ndenial of service. (CVE-2011-1746)\n\nDan Rosenberg discovered that the DCCP stack did not correctly handle\ncertain packet structures. A remote attacker could exploit this to crash\nthe system, leading to a denial of service. (CVE-2011-1770)\n\nVasiliy Kulikov and Dan Rosenberg discovered that ecryptfs did not\ncorrectly check the origin of mount points. A local attacker could exploit\nthis to trick the system into unmounting arbitrary mount points, leading to\na denial of service. (CVE-2011-1833)\n\nVasiliy Kulikov discovered that taskstats listeners were not correctly\nhandled. A local attacker could expoit this to exhaust memory and CPU\nresources, leading to a denial of service. (CVE-2011-2484)\n\nIt was discovered that Bluetooth l2cap and rfcomm did not correctly\ninitialize structures. A local attacker could exploit this to read portions\nof the kernel stack, leading to a loss of privacy. (CVE-2011-2492)\n\nFernando Gont discovered that the IPv6 stack used predictable fragment\nidentification numbers. A remote attacker could exploit this to exhaust\nnetwork resources, leading to a denial of service. (CVE-2011-2699)\n\nThe performance counter subsystem did not correctly handle certain\ncounters. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2011-2918)\n\nA flaw was found in the Linux kernel's /proc/*/*map* interface. A local,\nunprivileged user could exploit this flaw to cause a denial of service.\n(CVE-2011-3637)\n\nDan Rosenberg discovered flaws in the linux Rose (X.25 PLP) layer used by\namateur radio. A local user or a remote user on an X.25 network could\nexploit these flaws to execute arbitrary code as root. (CVE-2011-4913)\n\nBen Hutchings discovered several flaws in the Linux Rose (X.25 PLP) layer.\nA local user or a remote user on an X.25 network could exploit these flaws\nto execute arbitrary code as root. (CVE-2011-4914)\n",
  "releases": {
    "maverick": {
      "sources": {
        "linux-ti-omap4": {
          "version": "2.6.35-903.24",
          "description": "Linux kernel for OMAP4"
        }
      },
      "binaries": {
        "linux-image-2.6.35-903-omap4": {
          "version": "2.6.35-903.24"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ti-omap4/linux-ti-omap4_2.6.35-903.24.tar.gz": {
              "md5": "27899c00b0825522ff3d9f22650caacb",
              "size": 92444375
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ti-omap4/linux-ti-omap4_2.6.35-903.24.dsc": {
              "md5": "28b3f543c1208710473204cd64cc0565",
              "size": 1940
            }
          }
        },
        "armel": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/storage-core-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "bb1dc25758a46f8b4012a449b858da7a",
              "size": 47368
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/crypto-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "2c8c8748067425af9fea9ba9b0c5367b",
              "size": 44450
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/usb-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "f5195787854eea277da89a171335e600",
              "size": 67882
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/mouse-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "5d76e2ffbc33e02488ffce05400f4d0f",
              "size": 24984
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/squashfs-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "04c0b0b01c72b59d5250254448565cb7",
              "size": 15338
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/ppp-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "52fc6429a3c80b4ef714763ab608ff08",
              "size": 42696
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/parport-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "8d7cdc58273f73cfc4b298c9de0f2ff8",
              "size": 17404
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/vlan-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "be5a105bff07a9f38c58e62348caec99",
              "size": 22098
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/nic-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "c3dac4d2b237b7c8f2d380d34f183330",
              "size": 133070
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/linux-image-2.6.35-903-omap4_2.6.35-903.24_armel.deb": {
              "md5": "bd335d9f352db3b299f01f28e580e44a",
              "size": 14189350
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/scsi-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "9b0258e4965369ac218a239bcb6c3d5e",
              "size": 17592
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/md-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "adadba14f4a8780644a6f4d94e94197d",
              "size": 213526
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/block-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "fd272198045879b78256d8c1312618ff",
              "size": 23720
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/fs-core-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "429cc89fcbec07deaaa3cadf3eb504a1",
              "size": 543960
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/input-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "0be57634a2c7c31128b99ecb55f2a8f9",
              "size": 49674
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/linux-ti-omap4-tools-2.6.35-903_2.6.35-903.24_armel.deb": {
              "md5": "e0a489debadd6fd2c433b91cc36d0e5f",
              "size": 216236
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/nic-shared-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "35d0fe458b542bd6f1d11d354234fb8b",
              "size": 208010
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/sata-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "4b6bd6b017c3b99c5df0791afd16b35c",
              "size": 94764
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/fs-secondary-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "e6e4a71be4c050b9e485a2c06464c8f3",
              "size": 417600
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/fat-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "68dc3674626bf386fcf82e454d4b8398",
              "size": 2110
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/linux-headers-2.6.35-903_2.6.35-903.24_armel.deb": {
              "md5": "844880c218a050bdf864d54de142610b",
              "size": 10621300
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/irda-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "17763c49e5244928f0c27276e2c5f2ae",
              "size": 190022
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/kernel-image-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "6fca0baa4a754d7b0796ee240bd99c85",
              "size": 4161314
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/linux-headers-2.6.35-903-omap4_2.6.35-903.24_armel.deb": {
              "md5": "342fdaef6030455f43ce326b531b1cfc",
              "size": 593140
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/nic-usb-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "e03edae76c9565eca769ec026b76d628",
              "size": 167778
            },
            "http://ports.ubuntu.com/pool/main/l/linux-ti-omap4/plip-modules-2.6.35-903-omap4-di_2.6.35-903.24_armel.udeb": {
              "md5": "abe3acdd9a91972faef15a49237e27c3",
              "size": 7762
            }
          }
        }
      }
    }
  },
  "title": "Linux kernel (OMAP4) vulnerabilities",
  "timestamp": 1315944274.377322,
  "summary": "linux-ti-omap4 vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n",
  "isummary": "Multiple kernel flaws have been fixed.\n",
  "id": "USN-1202-1",
  "cves": [
    "CVE-2010-3296",
    "CVE-2010-3297",
    "CVE-2010-3858",
    "CVE-2010-3859",
    "CVE-2010-3874",
    "CVE-2010-3880",
    "CVE-2010-4073",
    "CVE-2010-4075",
    "CVE-2010-4076",
    "CVE-2010-4077",
    "CVE-2010-4080",
    "CVE-2010-4081",
    "CVE-2010-4082",
    "CVE-2010-4083",
    "CVE-2010-4157",
    "CVE-2010-4160",
    "CVE-2010-4162",
    "CVE-2010-4163",
    "CVE-2010-4169",
    "CVE-2010-4175",
    "CVE-2010-4242",
    "CVE-2010-4243",
    "CVE-2010-4248",
    "CVE-2010-4256",
    "CVE-2010-4565",
    "CVE-2010-4649",
    "CVE-2010-4655",
    "CVE-2010-4656",
    "CVE-2010-4668",
    "CVE-2011-0463",
    "CVE-2011-0521",
    "CVE-2011-0695",
    "CVE-2011-0711",
    "CVE-2011-0712",
    "CVE-2011-0726",
    "CVE-2011-1010",
    "CVE-2011-1012",
    "CVE-2011-1013",
    "CVE-2011-1016",
    "CVE-2011-1017",
    "CVE-2011-1019",
    "CVE-2011-1020",
    "CVE-2011-1044",
    "CVE-2011-1078",
    "CVE-2011-1079",
    "CVE-2011-1080",
    "CVE-2011-1082",
    "CVE-2011-1090",
    "CVE-2011-1093",
    "CVE-2011-1160",
    "CVE-2011-1163",
    "CVE-2011-1169",
    "CVE-2011-1170",
    "CVE-2011-1171",
    "CVE-2011-1172",
    "CVE-2011-1173",
    "CVE-2011-1180",
    "CVE-2011-1182",
    "CVE-2011-1478",
    "CVE-2011-1493",
    "CVE-2011-1494",
    "CVE-2011-1495",
    "CVE-2011-1577",
    "CVE-2011-1593",
    "CVE-2011-1598",
    "CVE-2011-1745",
    "CVE-2011-1746",
    "CVE-2011-1748",
    "CVE-2011-1770",
    "CVE-2011-1833",
    "CVE-2011-2022",
    "CVE-2011-2484",
    "CVE-2011-2492",
    "CVE-2011-2534",
    "CVE-2011-2699",
    "CVE-2011-2918",
    "CVE-2011-3637",
    "CVE-2011-4913",
    "CVE-2011-4914"
  ]
}