{
  "description": "USN-3620-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nJann Horn discovered that microprocessors utilizing speculative execution\nand branch prediction may allow unauthorized memory reads via sidechannel\nattacks. This flaw is known as Spectre. A local attacker could use this to\nexpose sensitive information, including kernel memory. (CVE-2017-5715)\n\nIt was discovered that the netlink 802.11 configuration interface in the\nLinux kernel did not properly validate some attributes passed from\nuserspace. A local attacker with the CAP_NET_ADMIN privilege could use this\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2017-11089)\n\nIt was discovered that a buffer overflow existed in the ioctl handling code\nin the ISDN subsystem of the Linux kernel. A local attacker could use this\nto cause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2017-12762)\n\nIt was discovered that the netfilter component of the Linux did not\nproperly restrict access to the connection tracking helpers list. A local\nattacker could use this to bypass intended access restrictions.\n(CVE-2017-17448)\n\nDmitry Vyukov discovered that the KVM implementation in the Linux kernel\ncontained an out-of-bounds read when handling memory-mapped I/O. A local\nattacker could use this to expose sensitive information. (CVE-2017-17741)\n\nIt was discovered that the Salsa20 encryption algorithm implementations in\nthe Linux kernel did not properly handle zero-length inputs. A local\nattacker could use this to cause a denial of service (system crash).\n(CVE-2017-17805)\n\nIt was discovered that the keyring implementation in the Linux kernel did\nnot properly check permissions when a key request was performed on a\ntask's default keyring. A local attacker could use this to add keys to\nunauthorized keyrings. (CVE-2017-17807)\n\nIt was discovered that the Broadcom NetXtremeII ethernet driver in the\nLinux kernel did not properly validate Generic Segment Offload (GSO) packet\nsizes. An attacker could use this to cause a denial of service (interface\nunavailability). (CVE-2018-1000026)\n\nIt was discovered that the Reliable Datagram Socket (RDS) implementation in\nthe Linux kernel contained an out-of-bounds write during RDMA page\nallocation. An attacker could use this to cause a denial of service (system\ncrash) or possibly execute arbitrary code. (CVE-2018-5332)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-144.193~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-3.13.0-144-generic-lpae": {
          "version": "3.13.0-144.193~precise1"
        },
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.144.135"
        },
        "linux-image-3.13.0-144-generic": {
          "version": "3.13.0-144.193~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.144.135"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1522891385.62226,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "isummary": "Several security issues were fixed in the Linux kernel.\n",
  "id": "USN-3620-2",
  "cves": [
    "CVE-2017-11089",
    "CVE-2017-12762",
    "CVE-2017-17448",
    "CVE-2017-17741",
    "CVE-2017-17805",
    "CVE-2017-17807",
    "CVE-2017-5715",
    "CVE-2018-1000026",
    "CVE-2018-5332"
  ]
}