{
  "description": "\nDan Rosenberg discovered that multiple terminal ioctls did not correctly\ninitialize structure memory. A local attacker could exploit this to read\nportions of kernel stack memory, leading to a loss of privacy.\n(CVE-2010-4076, CVE-2010-4077)\n\nAlex Shi and Eric Dumazet discovered that the network stack did not\ncorrectly handle packet backlogs. A remote attacker could exploit this by\nsending a large amount of network traffic to cause the system to run out of\nmemory, leading to a denial of service. (CVE-2010-4251, CVE-2010-4805)\n\nIt was discovered that the /proc filesystem did not correctly handle\npermission changes when programs executed. A local attacker could hold open\nfiles to examine details about programs running with higher privileges,\npotentially increasing the chances of exploiting additional\nvulnerabilities. (CVE-2011-1020)\n\nDan Rosenberg discovered that the X.25 Rose network stack did not correctly\nhandle certain fields. If a system was running with Rose enabled, a remote\nattacker could send specially crafted traffic to gain root privileges.\n(CVE-2011-1493)\n\nTimo Warns discovered that the GUID partition parsing routines did not\ncorrectly validate certain structures. A local attacker with physical\naccess could plug in a specially crafted block device to crash the system,\nleading to a denial of service. (CVE-2011-1577)\n\nIt was discovered that CIFS incorrectly handled authentication. When a user\nhad a CIFS share mounted that required authentication, a local user could\nmount the same share without knowing the correct password. (CVE-2011-1585)\n\nIt was discovered that the GRE protocol incorrectly handled netns\ninitialization. A remote attacker could send a packet while the ip_gre\nmodule was loading, and crash the system, leading to a denial of service.\n(CVE-2011-1767)\n\nIt was discovered that the IP/IP protocol incorrectly handled netns\ninitialization. A remote attacker could send a packet while the ipip module\nwas loading, and crash the system, leading to a denial of service.\n(CVE-2011-1768)\n\nBen Hutchings reported a flaw in the kernel's handling of corrupt LDM\npartitions. A local user could exploit this to cause a denial of service or\nescalate privileges. (CVE-2011-2182)\n\nAndrea Righi discovered a race condition in the KSM memory merging support.\nIf KSM was being used, a local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2011-2183)\n\nDan Rosenberg discovered that the IPv4 diagnostic routines did not\ncorrectly validate certain requests. A local attacker could exploit this to\nconsume CPU resources, leading to a denial of service. (CVE-2011-2213)\n\nVasiliy Kulikov discovered that taskstats listeners were not correctly\nhandled. A local attacker could expoit this to exhaust memory and CPU\nresources, leading to a denial of service. (CVE-2011-2484)\n\nIt was discovered that Bluetooth l2cap and rfcomm did not correctly\ninitialize structures. A local attacker could exploit this to read portions\nof the kernel stack, leading to a loss of privacy. (CVE-2011-2492)\n\nMauro Carvalho Chehab discovered that the si4713 radio driver did not\ncorrectly check the length of memory copies. If this hardware was\navailable, a local attacker could exploit this to crash the system or gain\nroot privileges. (CVE-2011-2700)\n\nHerbert Xu discovered that certain fields were incorrectly handled when\nGeneric Receive Offload (CVE-2011-2723)\n\nVasiliy Kulikov discovered that the Comedi driver did not correctly clear\nmemory. A local attacker could exploit this to read kernel stack memory,\nleading to a loss of privacy. (CVE-2011-2909)\n\nThe performance counter subsystem did not correctly handle certain\ncounters. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2011-2918)\n\nA flaw was found in the Linux kernel's /proc/*/*map* interface. A local,\nunprivileged user could exploit this flaw to cause a denial of service.\n(CVE-2011-3637)\n\nBen Hutchings discovered several flaws in the Linux Rose (X.25 PLP) layer.\nA local user or a remote user on an X.25 network could exploit these flaws\nto execute arbitrary code as root. (CVE-2011-4914)\n",
  "releases": {
    "lucid": {
      "sources": {
        "linux-ec2": {
          "version": "2.6.32-318.38",
          "description": "Linux kernel for EC2"
        }
      },
      "binaries": {
        "linux-image-2.6.32-318-ec2": {
          "version": "2.6.32-318.38"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2_2.6.32-318.38.diff.gz": {
              "size": 9271476,
              "md5": "866412aa67b7fbcea110b4a32b6fefd0"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2_2.6.32.orig.tar.gz": {
              "size": 81900940,
              "md5": "4b1f6f6fac43a23e783079db589fc7e2"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2_2.6.32-318.38.dsc": {
              "size": 2104,
              "md5": "64bdd8c59f872160ee0075faf89bfa39"
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2-source-2.6.32_2.6.32-318.38_all.deb": {
              "size": 69367830,
              "md5": "c26a4d2d8fe2931a59959df12e9d4c67"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-headers-2.6.32-318_2.6.32-318.38_all.deb": {
              "size": 10292420,
              "md5": "c08b2de7a5a36b203eafbad71df57f3a"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2-doc_2.6.32-318.38_all.deb": {
              "size": 6773726,
              "md5": "d52263b45fd87b122829fcf8fd3e50c1"
            }
          }
        },
        "amd64": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-image-2.6.32-318-ec2_2.6.32-318.38_amd64.deb": {
              "size": 20053902,
              "md5": "4a999dec922cd1800023890e851c14f7"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-headers-2.6.32-318-ec2_2.6.32-318.38_amd64.deb": {
              "size": 710556,
              "md5": "86534b71728ba43fc4c71fceebfb8e9f"
            }
          }
        },
        "i386": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-image-2.6.32-318-ec2_2.6.32-318.38_i386.deb": {
              "size": 19361286,
              "md5": "ef5640a14f392bfe5e80b89b10b6fc45"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-headers-2.6.32-318-ec2_2.6.32-318.38_i386.deb": {
              "size": 689314,
              "md5": "4d635f036f9bb040fbbb414661fd421d"
            }
          }
        }
      }
    }
  },
  "title": "Linux kernel (EC2) vulnerabilities",
  "timestamp": 1317075927.290501,
  "summary": "linux-ec2 vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed. If\nyou use linux-restricted-modules, you have to update that package as\nwell to get modules which work with the new kernel version. Unless you\nmanually uninstalled the standard kernel metapackages (e.g. linux-generic,\nlinux-server, linux-powerpc), a standard system upgrade will automatically\nperform this as well.\n",
  "cves": [
    "CVE-2010-4076",
    "CVE-2010-4077",
    "CVE-2010-4251",
    "CVE-2010-4805",
    "CVE-2011-1020",
    "CVE-2011-1493",
    "CVE-2011-1577",
    "CVE-2011-1585",
    "CVE-2011-1767",
    "CVE-2011-1768",
    "CVE-2011-2182",
    "CVE-2011-2183",
    "CVE-2011-2213",
    "CVE-2011-2484",
    "CVE-2011-2492",
    "CVE-2011-2700",
    "CVE-2011-2723",
    "CVE-2011-2909",
    "CVE-2011-2918",
    "CVE-2011-3637",
    "CVE-2011-4914"
  ],
  "id": "USN-1216-1",
  "isummary": "Multiple kernel flaws have been fixed.\n"
}
