{
  "description": "It was discovered that containerd insufficiently restricted permissions on\ncontainer root and plugin directories. If a user or automated system were\ntricked into launching a specially crafted container image, a remote\nattacker could traverse directory contents and modify files and execute\nprograms on the host file system, possibly leading to privilege escalation.\n(CVE-2021-41103)\n\nIt was discovered that containerd incorrectly handled file permission\nchanges. If a user or automated system were tricked into launching a\nspecially crafted container image, a remote attacker could change\npermissions on files on the host file system and possibly escalate\nprivileges. (CVE-2021-32760)\n\nIt was discovered that containerd allows attackers to gain access to read-\nonly copies of arbitrary files and directories on the host via a specially-\ncrafted image configuration. An attacker could possibly use this issue to\nobtain sensitive information. (CVE-2022-23648)\n\nIt was discovered that containerd incorrectly handled certain memory\noperations. A remote attacker could use this to cause a denial of service.\n(CVE-2022-31030)\n",
  "releases": {
    "xenial": {
      "sources": {
        "containerd": {
          "version": "1.2.6-0ubuntu1~16.04.6+esm2",
          "description": "daemon to control runC"
        }
      },
      "binaries": {
        "containerd": {
          "pocket": "esm-apps",
          "version": "1.2.6-0ubuntu1~16.04.6+esm2"
        }
      },
      "allbinaries": {
        "containerd": {
          "pocket": "esm-apps",
          "source": "containerd",
          "version": "1.2.6-0ubuntu1~16.04.6+esm2"
        },
        "golang-github-docker-containerd-dev": {
          "pocket": "esm-apps",
          "source": "containerd",
          "version": "1.2.6-0ubuntu1~16.04.6+esm2"
        }
      }
    }
  },
  "title": "containerd vulnerabilities",
  "timestamp": 1657892903.024458,
  "summary": "containerd vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "is_hidden": "false",
  "cves": [
    "CVE-2021-32760",
    "CVE-2021-41103",
    "CVE-2022-23648",
    "CVE-2022-31030"
  ],
  "id": "USN-5521-1",
  "isummary": "Several security issues were fixed in containerd.\n"
}
