{
  "action": "After a standard system update you need to restart any applications using\nRack to make all the necessary changes.\n",
  "cves": [
    "CVE-2022-30122",
    "CVE-2022-30123",
    "CVE-2022-44570",
    "CVE-2022-44571",
    "CVE-2022-44572",
    "CVE-2023-27530",
    "CVE-2023-27539",
    "CVE-2024-25126",
    "CVE-2024-26141",
    "CVE-2024-26146",
    "https://bugs.launchpad.net/ubuntu/+source/ruby-rack/+bug/2078711"
  ],
  "description": "It was discovered that Rack was not properly parsing data when processing\nmultipart POST requests. If a user or automated system were tricked into\nsending a specially crafted multipart POST request to an application using\nRack, a remote attacker could possibly use this issue to cause a denial of\nservice. (CVE-2022-30122)\n\nIt was discovered that Rack was not properly escaping untrusted data when\nperforming logging operations, which could cause shell escaped sequences\nto be written to a terminal. If a user or automated system were tricked\ninto sending a specially crafted request to an application using Rack, a\nremote attacker could possibly use this issue to execute arbitrary code in\nthe machine running the application. (CVE-2022-30123)\n\nIt was discovered that Rack did not properly structure regular expressions\nin some of its parsing components, which could result in uncontrolled\nresource consumption if an application using Rack received specially\ncrafted input. A remote attacker could possibly use this issue to cause a\ndenial of service. (CVE-2022-44570, CVE-2022-44571)\n\nIt was discovered that Rack did not properly structure regular expressions\nin its multipart parsing component, which could result in uncontrolled\nresource consumption if an application using Rack to parse multipart posts\nreceived specially crafted input. A remote attacker could possibly use\nthis issue to cause a denial of service. (CVE-2022-44572)\n\nIt was discovered that Rack incorrectly handled Multipart MIME parsing.\nA remote attacker could possibly use this issue to cause Rack to consume\nresources, leading to a denial of service. (CVE-2023-27530)\n\nIt was discovered that Rack incorrectly handled certain regular\nexpressions. A remote attacker could possibly use this issue to cause\nRack to consume resources, leading to a denial of service.\n(CVE-2023-27539)\n\nIt was discovered that Rack incorrectly parsed certain media types. A\nremote attacker could possibly use this issue to cause Rack to consume\nresources, leading to a denial of service. (CVE-2024-25126)\n\nIt was discovered that Rack incorrectly handled certain Range headers. A\nremote attacker could possibly use this issue to cause Rack to create\nlarge responses, leading to a denial of service. (CVE-2024-26141)\n\nIt was discovered that Rack incorrectly handled certain crafted headers. A\nremote attacker could possibly use this issue to cause Rack to consume\nresources, leading to a denial of service. (CVE-2024-26146)\n",
  "id": "USN-7036-1",
  "isummary": "Several security issues were fixed in Rack.\n",
  "releases": {
    "jammy": {
      "allbinaries": {
        "ruby-rack": {
          "pocket": "security",
          "source": "ruby-rack",
          "version": "2.1.4-5ubuntu1.1"
        }
      },
      "archs": {
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/universe/r/ruby-rack/ruby-rack_2.1.4-5ubuntu1.1_all.deb": {
              "md5": "bb2511e7974806c8dbb53b8eb6b484e8",
              "size": 108374
            }
          }
        },
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/universe/r/ruby-rack/ruby-rack_2.1.4-5ubuntu1.1.debian.tar.xz": {
              "md5": "1dc5da93b53361e863f5fcabb36602e6",
              "size": 15580
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/r/ruby-rack/ruby-rack_2.1.4-5ubuntu1.1.dsc": {
              "md5": "31a01ff161817024095648e689f586ee",
              "size": 2280
            },
            "http://security.ubuntu.com/ubuntu/pool/universe/r/ruby-rack/ruby-rack_2.1.4.orig.tar.gz": {
              "md5": "92633b2d98f6caa2fdaebcd0b15eb42d",
              "size": 251772
            }
          }
        }
      },
      "binaries": {
        "ruby-rack": {
          "pocket": "security",
          "version": "2.1.4-5ubuntu1.1"
        }
      },
      "sources": {
        "ruby-rack": {
          "description": "modular Ruby webserver interface",
          "version": "2.1.4-5ubuntu1.1"
        }
      }
    }
  },
  "summary": "ruby-rack vulnerabilities",
  "timestamp": 1727324386.522367,
  "title": "Rack vulnerabilities"
}
