{
  "description": "USN-3798-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 LTS.\n\nDmitry Vyukov discovered that the key management subsystem in the Linux\nkernel did not properly restrict adding a key that already exists but is\nnegatively instantiated. A local attacker could use this to cause a denial\nof service (system crash) or possibly execute arbitrary code.\n(CVE-2015-8539)\n\nIt was discovered that a use-after-free vulnerability existed in the device\ndriver for XCeive xc2028/xc3028 tuners in the Linux kernel. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2016-7913)\n\nPengfei Ding (丁鹏飞), Chenfu Bao (包沉浮), and Lenx Wei (韦韬)\ndiscovered a race condition in the generic SCSI driver (sg) of the Linux\nkernel. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2017-0794)\n\nEric Biggers discovered that the key management subsystem in the Linux\nkernel did not properly restrict adding a key that already exists but is\nuninstantiated. A local attacker could use this to cause a denial of\nservice (system crash) or possibly execute arbitrary code. (CVE-2017-15299)\n\nIt was discovered that a NULL pointer dereference could be triggered in the\nOCFS2 file system implementation in the Linux kernel. A local attacker\ncould use this to cause a denial of service (system crash).\n(CVE-2017-18216)\n\nLuo Quan and Wei Yang discovered that a race condition existed in the\nAdvanced Linux Sound Architecture (ALSA) subsystem of the Linux kernel when\nhandling ioctl()s. A local attacker could use this to cause a denial of\nservice (system deadlock). (CVE-2018-1000004)\n\n范龙飞 discovered that a race condition existed in the Advanced Linux\nSound Architecture (ALSA) subsystem of the Linux kernel that could lead to\na use- after-free or an out-of-bounds buffer access. A local attacker with\naccess to /dev/snd/seq could use this to cause a denial of service (system\ncrash) or possibly execute arbitrary code. (CVE-2018-7566)\n\nIt was discovered that a buffer overflow existed in the NFC Logical Link\nControl Protocol (llcp) implementation in the Linux kernel. An attacker\ncould use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2018-9518)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-161.211~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.161.151"
        },
        "linux-image-3.13.0-161-generic": {
          "version": "3.13.0-161.211~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.161.151"
        },
        "linux-image-3.13.0-161-generic-lpae": {
          "version": "3.13.0-161.211~precise1"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1540264120.795152,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2015-8539",
    "CVE-2016-7913",
    "CVE-2017-0794",
    "CVE-2017-15299",
    "CVE-2017-18216",
    "CVE-2018-1000004",
    "CVE-2018-7566",
    "CVE-2018-9518"
  ],
  "id": "USN-3798-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}