{
  "description": "Thor Larholm discovered that PHPMailer, as used by Moodle, did not\ncorrectly escape email addresses.  A local attacker with direct access\nto the Moodle database could exploit this to execute arbitrary commands\nas the web server user. (CVE-2007-3215)\n\nNigel McNie discovered that fetching https URLs did not correctly escape\nshell meta-characters.  An authenticated remote attacker could execute\narbitrary commands as the web server user, if curl was installed and\nconfigured. (CVE-2008-4796, MSA-09-0003)\n\nIt was discovered that Smarty (also included in Moodle), did not\ncorrectly filter certain inputs.  An authenticated remote attacker could\nexploit this to execute arbitrary PHP commands as the web server user.\n(CVE-2008-4810, CVE-2008-4811, CVE-2009-1669)\n\nIt was discovered that the unused SpellChecker extension in Moodle did not\ncorrectly handle temporary files.  If the tool had been locally modified,\nit could be made to overwrite arbitrary local files via symlinks.\n(CVE-2008-5153)\n\nMike Churchward discovered that Moodle did not correctly filter Wiki page\ntitles in certain areas.  An authenticated remote attacker could exploit\nthis to cause cross-site scripting (XSS), which could be used to modify\nor steal confidential data of other users within the same web domain.\n(CVE-2008-5432, MSA-08-0022)\n\nIt was discovered that the HTML sanitizer, \"Login as\" feature, and logging\nin Moodle did not correctly handle certain inputs.  An authenticated\nremote attacker could exploit this to generate XSS, which could be used\nto modify or steal confidential data of other users within the same\nweb domain.  (CVE-2008-5619, CVE-2009-0500, CVE-2009-0502, MSA-08-0026,\nMSA-09-0004, MSA-09-0007)\n\nIt was discovered that the HotPot module in Moodle did not correctly\nfilter SQL inputs.  An authenticated remote attacker could execute\narbitrary SQL commands as the moodle database user, leading to a loss\nof privacy or denial of service.  (CVE-2008-6124, MSA-08-0010)\n\nKevin Madura discovered that the forum actions and messaging settings\nin Moodle were not protected from cross-site request forgery (CSRF).\nIf an authenticated user were tricked into visiting a malicious\nwebsite while logged into Moodle, a remote attacker could change the\nuser's configurations or forum content.  (CVE-2009-0499, MSA-09-0008,\nMSA-08-0023)\n\nDaniel Cabezas discovered that Moodle would leak usernames from the\nCalendar Export tool.  A remote attacker could gather a list of users,\nleading to a loss of privacy.  (CVE-2009-0501, MSA-09-0006)\n\nChristian Eibl discovered that the TeX filter in Moodle allowed any\nfunction to be used.  An authenticated remote attacker could post\na specially crafted TeX formula to execute arbitrary TeX functions,\npotentially reading any file accessible to the web server user, leading\nto a loss of privacy.  (CVE-2009-1171, MSA-09-0009)\n\nJohannes Kuhn discovered that Moodle did not correctly validate user\npermissions when attempting to switch user accounts.  An authenticated\nremote attacker could switch to any other Moodle user, leading to a loss\nof privacy.  (MSA-08-0003)\n\nHanno Boeck discovered that unconfigured Moodle instances contained\nXSS vulnerabilities.  An unauthenticated remote attacker could exploit\nthis to modify or steal confidential data of other users within the same\nweb domain.  (MSA-08-0004)\n\nDebbie McDonald, Mauno Korpelainen, Howard Miller, and Juan Segarra\nMontesinos discovered that when users were deleted from Moodle, their\nprofiles and avatars were still visible.  An authenticated remote attacker\ncould exploit this to store information in profiles even after they were\nremoved, leading to spam traffic.  (MSA-08-0015, MSA-09-0001, MSA-09-0002)\n\nLars Vogdt discovered that Moodle did not correctly filter certain inputs.\nAn authenticated remote attacker could exploit this to generate XSS from\nwhich they could modify or steal confidential data of other users within\nthe same web domain.  (MSA-08-0021)\n\nIt was discovered that Moodle did not correctly filter inputs for group\ncreation, mnet, essay question, HOST param, wiki param, and others.\nAn authenticated remote attacker could exploit this to generate XSS\nfrom which they could modify or steal confidential data of other users\nwithin the same web domain.  (MDL-9288, MDL-11759, MDL-12079, MDL-12793,\nMDL-14806)\n\nIt was discovered that Moodle did not correctly filter SQL inputs when\nperforming a restore.  An attacker authenticated as a Moodle administrator\ncould execute arbitrary SQL commands as the moodle database user,\nleading to a loss of privacy or denial of service. (MDL-11857)\n",
  "releases": {
    "hardy": {
      "sources": {
        "moodle": {
          "version": "1.8.2-1ubuntu4.2"
        }
      },
      "binaries": {
        "moodle": {
          "version": "1.8.2-1ubuntu4.2"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2-1ubuntu4.2.diff.gz": {
              "md5": "b0164bfaf9023bc534d2a7b6a8a8c718",
              "size": 40258
            },
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2.orig.tar.gz": {
              "md5": "4e6afcfd567571af0638533d157f9181",
              "size": 10157112
            },
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2-1ubuntu4.2.dsc": {
              "md5": "e32f8b5963d5c1a1710073d4e5a88415",
              "size": 703
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2-1ubuntu4.2_all.deb": {
              "md5": "967ddb24a756fa4ba683b66835eb734d",
              "size": 9292594
            }
          }
        }
      }
    },
    "intrepid": {
      "sources": {
        "moodle": {
          "version": "1.8.2-1.2ubuntu2.1"
        }
      },
      "binaries": {
        "moodle": {
          "version": "1.8.2-1.2ubuntu2.1"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2-1.2ubuntu2.1.dsc": {
              "md5": "f001011ebd7f3ad66fc797a26194393c",
              "size": 1107
            },
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2.orig.tar.gz": {
              "md5": "4e6afcfd567571af0638533d157f9181",
              "size": 10157112
            },
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2-1.2ubuntu2.1.diff.gz": {
              "md5": "92c36cd38c72494817858ceefe55db23",
              "size": 48171
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/m/moodle/moodle_1.8.2-1.2ubuntu2.1_all.deb": {
              "md5": "af5fbc6ef05185b6cc3b65f22d49b13e",
              "size": 9298070
            }
          }
        }
      }
    }
  },
  "title": "Moodle vulnerabilities",
  "timestamp": 1245873613.114186,
  "summary": "moodle vulnerabilities",
  "action": "After a standard system upgrade you need to access the Moodle instance\nand accept the database update to clear any invalid cached data.\n",
  "id": "USN-791-1",
  "cves": [
    "CVE-2007-3215",
    "CVE-2008-4796",
    "CVE-2008-4810",
    "CVE-2008-4811",
    "CVE-2008-5153",
    "CVE-2008-5432",
    "CVE-2008-5619",
    "CVE-2008-6124",
    "CVE-2009-0499",
    "CVE-2009-0500",
    "CVE-2009-0501",
    "CVE-2009-0502",
    "CVE-2009-1171",
    "CVE-2009-1669"
  ]
}