{
  "description": "CAN-2005-1751:\n\n  The php4-dev package ships a copy of the \"shtool\" utility in\n  /usr/lib/php4/build/, which provides useful functionality for\n  developers of software packages.  Eric Romang discovered that shtool\n  created temporary files in an insecure manner. This could allow\n  a symlink attack to create or overwrite arbitrary files with the\n  privileges of the user invoking the shtool program.\n\nCAN-1005-1759:\n\n  The creation of temporary files in shtool was also vulnerable to a\n  race condition which allowed a local user to read the contents of the\n  temporary file. However, this file does not usually contain sensitive\n  information since shtool is usually used for building software\n  packages.\n\nCAN-2005-2498:\n\n  Stefan Esser discovered another remote code execution vulnerability in\n  the XMLRPC module of the PEAR (PHP Extension and Application\n  Repository) extension of PHP. By sending specially crafted XMLRPC\n  requests to an affected web server, a remote attacker could exploit\n  this to execute arbitrary code with the web server's privileges.\n\n  In Ubuntu, the PEAR extension is unsupported (it is contained in the\n  php4-pear package which is part of universe). However, since this is\n  a highly critical vulnerability, that package was fixed anyway.\n\n  Please note that many applications contain a copy of the affected\n  XMLRPC code, which must be fixed separately. The following packages\n  may also be affected, but are unsupported in Ubuntu:\n\n  - drupal\n  - wordpress\n  - phpwiki\n  - horde3\n  - ewiki\n  - egroupware\n  - phpgroupware\n\n  These packages might be fixed by the community later.\n\n  The following common third party applications might be affected as\n  well, but not packaged for Ubuntu:\n\n  - Serendipity\n  - Postnuke\n  - tikiwiki\n  - phpwebsite\n\n  If you run any affected software, please check whether you are\n  affected and upgrade it as soon as possible to protect your\n  server.",
  "releases": {
    "hoary": {
      "binaries": {
        "php4-pear": {
          "version": ""
        },
        "php4-dev": {
          "version": ""
        }
      }
    },
    "warty": {
      "binaries": {
        "php4-pear": {
          "version": ""
        },
        "php4-dev": {
          "version": ""
        }
      }
    }
  },
  "title": "PHP4 vulnerabilities",
  "timestamp": 1124583567,
  "summary": "php4 vulnerabilities",
  "id": "USN-171-1",
  "cves": [
    "CVE-2005-1751",
    "CVE-2005-1759",
    "CVE-2005-2498"
  ]
}