{
  "description": "Jann Horn discovered that microprocessors utilizing speculative execution\nand branch prediction may allow unauthorized memory reads via sidechannel\nattacks. This flaw is known as Spectre. A local attacker could use this to\nexpose sensitive information, including kernel memory.\n",
  "releases": {
    "precise": {
      "sources": {
        "linux": {
          "version": "3.2.0-133.179",
          "description": "Linux kernel"
        }
      },
      "binaries": {
        "linux-image-3.2.0-133-generic-pae": {
          "version": "3.2.0-133.179"
        },
        "linux-image-generic": {
          "version": "3.2.0.133.148"
        },
        "linux-image-generic-pae": {
          "version": "3.2.0.133.148"
        },
        "linux-image-3.2.0-133-generic": {
          "version": "3.2.0-133.179"
        }
      }
    }
  },
  "title": "Linux kernel vulnerabilities",
  "timestamp": 1519258243.274368,
  "summary": "linux vulnerabilities",
  "action": "Please note that fully mitigating CVE-2017-5715 (Spectre Variant 2)\nrequires corresponding processor microcode/firmware updates or,\nin virtual environments, hypervisor updates. On i386 and amd64\narchitectures, the IBRS and IBPB features are required to enable the\nkernel mitigations. Ubuntu is working with Intel and AMD to provide\nfuture microcode updates that implement IBRS and IBPB as they are made\navailable. Ubuntu users with a processor from a different vendor should\ncontact the vendor to identify necessary firmware updates. Ubuntu\nwill provide corresponding QEMU updates in the future for users of\nself-hosted virtual environments in coordination with upstream QEMU.\nUbuntu users in cloud environments should contact the cloud provider\nto confirm that the hypervisor has been updated to expose the new\nCPU features to virtual machines.\n\nAfter a standard system update you need to reboot your computer to\napply the necessary changes.\n",
  "isummary": "Several security issues were fixed in the Linux kernel.\n",
  "id": "USN-3580-1",
  "cves": [
    "CVE-2017-5715",
    "CVE-2017-5753",
    "https://wiki.ubuntu.com/SecurityTeam/KnowledgeBase/SpectreAndMeltdown"
  ]
}