{
  "description": "USN-3933-1 fixed vulnerabilities in the Linux kernel for Ubuntu 14.04\nLTS. This update provides the corresponding updates for the Linux\nHardware Enablement (HWE) kernel from Ubuntu 14.04 LTS for Ubuntu\n12.04 ESM.\n\nIt was discovered that an information leak vulnerability existed in the\nBluetooth implementation of the Linux kernel. An attacker within Bluetooth\nrange could possibly expose sensitive information (kernel memory).\n(CVE-2017-1000410)\n\nIt was discovered that the USB serial device driver in the Linux kernel did\nnot properly validate baud rate settings when debugging is enabled. A local\nattacker could use this to cause a denial of service (system crash).\n(CVE-2017-18360)\n\nMathias Payer and Hui Peng discovered a use-after-free vulnerability in the\nAdvanced Linux Sound Architecture (ALSA) subsystem. A physically proximate\nattacker could use this to cause a denial of service (system crash).\n(CVE-2018-19824)\n\nShlomi Oberman, Yuli Shapiro, and Ran Menscher discovered an information\nleak in the Bluetooth implementation of the Linux kernel. An attacker\nwithin Bluetooth range could use this to expose sensitive information\n(kernel memory). (CVE-2019-3459, CVE-2019-3460)\n\nJann Horn discovered that the KVM implementation in the Linux kernel\ncontained a use-after-free vulnerability. An attacker in a guest VM with\naccess to /dev/kvm could use this to cause a denial of service (guest VM\ncrash). (CVE-2019-6974)\n\nFelix Wilhelm discovered that an information leak vulnerability existed in\nthe KVM subsystem of the Linux kernel, when nested virtualization is used.\nA local attacker could use this to expose sensitive information (host\nsystem memory to a guest VM). (CVE-2019-7222)\n\nJann Horn discovered that the mmap implementation in the Linux kernel did\nnot properly check for the mmap minimum address in some situations. A local\nattacker could use this to assist exploiting a kernel NULL pointer\ndereference vulnerability. (CVE-2019-9213)\n",
  "releases": {
    "precise": {
      "allbinaries": {
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.168.157"
        },
        "linux-image-3.13.0-168-generic": {
          "version": "3.13.0-168.218~precise1"
        },
        "linux-image-3.13.0-168-lowlatency": {
          "version": "3.13.0-168.218~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.168.157"
        },
        "linux-image-3.13.0-168-generic-lpae": {
          "version": "3.13.0-168.218~precise1"
        }
      },
      "binaries": {
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.168.157"
        },
        "linux-image-3.13.0-168-generic": {
          "version": "3.13.0-168.218~precise1"
        },
        "linux-image-3.13.0-168-lowlatency": {
          "version": "3.13.0-168.218~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.168.157"
        },
        "linux-image-3.13.0-168-generic-lpae": {
          "version": "3.13.0-168.218~precise1"
        }
      },
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-168.218~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1554242141.577358,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed.\nUnless you manually uninstalled the standard kernel metapackages\n(e.g. linux-generic, linux-generic-lts-RELEASE, linux-virtual,\nlinux-powerpc), a standard system upgrade will automatically perform\nthis as well.\n",
  "cves": [
    "CVE-2017-1000410",
    "CVE-2017-18360",
    "CVE-2018-19824",
    "CVE-2019-3459",
    "CVE-2019-3460",
    "CVE-2019-6974",
    "CVE-2019-7222",
    "CVE-2019-9213"
  ],
  "id": "USN-3933-2",
  "isummary": "Several security issues were fixed in the Linux kernel.\n"
}
