{
  "description": "Emmanuel Dreyfus discovered that third-party modules using the\nap_get_basic_auth_pw() function outside of the authentication phase may\nlead to authentication requirements being bypassed. This update adds a new\nap_get_basic_auth_components() function for use by third-party modules.\n(CVE-2017-3167)\n\nVasileios Panopoulos discovered that the Apache mod_ssl module may crash\nwhen third-party modules call ap_hook_process_connection() during an HTTP\nrequest to an HTTPS port. (CVE-2017-3169)\n\nJavier Jiménez discovered that the Apache HTTP Server incorrectly handled\nparsing certain requests. A remote attacker could possibly use this issue\nto cause the Apache HTTP Server to crash, resulting in a denial of service.\n(CVE-2017-7668)\n\nChenQin and Hanno Böck discovered that the Apache mod_mime module\nincorrectly handled certain Content-Type response headers. A remote\nattacker could possibly use this issue to cause the Apache HTTP Server to\ncrash, resulting in a denial of service. (CVE-2017-7679)\n\nDavid Dennerline and Régis Leroy discovered that the Apache HTTP Server\nincorrectly handled unusual whitespace when parsing requests, contrary to\nspecifications. When being used in combination with a proxy or backend\nserver, a remote attacker could possibly use this issue to perform an\ninjection attack and pollute cache. This update may introduce compatibility\nissues with clients that do not strictly follow HTTP protocol\nspecifications. A new configuration option \"HttpProtocolOptions Unsafe\" can\nbe used to revert to the previous unsafe behaviour in problematic\nenvironments. (CVE-2016-8743)\n",
  "releases": {
    "precise": {
      "sources": {
        "apache2": {
          "version": "2.2.22-1ubuntu1.12",
          "description": "Apache HTTP server"
        }
      },
      "binaries": {
        "apache2.2-bin": {
          "version": "2.2.22-1ubuntu1.12"
        }
      }
    }
  },
  "title": "Apache HTTP Server vulnerabilities",
  "timestamp": 1501517273.734959,
  "summary": "apache2 vulnerabilities",
  "action": "In general, a standard system update will make all the necessary changes.\n",
  "isummary": "Several security issues were fixed in Apache HTTP Server.\n",
  "id": "USN-3373-1",
  "cves": [
    "CVE-2016-8743",
    "CVE-2017-3167",
    "CVE-2017-3169",
    "CVE-2017-7668",
    "CVE-2017-7679"
  ]
}