{
  "description": "\nThomas Pollet discovered that the RDS network protocol did not check\ncertain iovec buffers. A local attacker could exploit this to crash the\nsystem or possibly execute arbitrary code as the root user. (CVE-2010-3865)\n\nVasiliy Kulikov discovered that the Linux kernel X.25 implementation did\nnot correctly clear kernel memory. A local attacker could exploit this to\nread kernel stack memory, leading to a loss of privacy. (CVE-2010-3875)\n\nVasiliy Kulikov discovered that the Linux kernel sockets implementation did\nnot properly initialize certain structures. A local attacker could exploit\nthis to read kernel stack memory, leading to a loss of privacy.\n(CVE-2010-3876)\n\nVasiliy Kulikov discovered that the TIPC interface did not correctly\ninitialize certain structures. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-3877)\n\nNelson Elhage discovered that the Linux kernel IPv4 implementation did not\nproperly audit certain bytecodes in netlink messages. A local attacker\ncould exploit this to cause the kernel to hang, leading to a denial of\nservice. (CVE-2010-3880)\n\nIt was discovered that multithreaded exec did not handle CPU timers\ncorrectly. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2010-4248)\n\nKrishna Gudipati discovered that the bfa adapter driver did not correctly\ninitialize certain structures. A local attacker could read files in /sys to\ncrash the system, leading to a denial of service. (CVE-2010-4343)\n\nTavis Ormandy discovered that the install_special_mapping function could\nbypass the mmap_min_addr restriction. A local attacker could exploit this\nto mmap 4096 bytes below the mmap_min_addr area, possibly improving the\nchances of performing NULL pointer dereference attacks. (CVE-2010-4346)\n\nIt was discovered that the ICMP stack did not correctly handle certain\nunreachable messages. If a remote attacker were able to acquire a socket\nlock, they could send specially crafted traffic that would crash the\nsystem, leading to a denial of service. (CVE-2010-4526)\n\nDan Rosenberg discovered that the OSS subsystem did not handle name\ntermination correctly. A local attacker could exploit this crash the system\nor gain root privileges. (CVE-2010-4527)\n\nAn error was reported in the kernel's ORiNOCO wireless driver's handling of\nTKIP countermeasures. This reduces the amount of time an attacker needs\nbreach a wireless network using WPA+TKIP for security. (CVE-2010-4648)\n\nDan Carpenter discovered that the Infiniband driver did not correctly\nhandle certain requests. A local user could exploit this to crash the\nsystem or potentially gain root privileges. (CVE-2010-4649, CVE-2011-1044)\n\nAn error was discovered in the kernel's handling of CUSE (Character device\nin Userspace). A local attacker might exploit this flaw to escalate\nprivilege, if access to /dev/cuse has been modified to allow non-root\nusers. (CVE-2010-4650)\n\nA flaw was found in the kernel's Integrity Measurement Architecture (IMA).\nChanges made by an attacker might not be discovered by IMA, if SELinux was\ndisabled, and a new IMA rule was loaded. (CVE-2011-0006)\n",
  "releases": {
    "lucid": {
      "sources": {
        "linux-ec2": {
          "version": "2.6.32-313.26",
          "description": "Linux kernel for EC2"
        }
      },
      "binaries": {
        "linux-image-2.6.32-313-ec2": {
          "version": "2.6.32-313.26"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2_2.6.32-313.26.dsc": {
              "md5": "552a2f768dd9ebb658ffa7290d78618f",
              "size": 2104
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2_2.6.32.orig.tar.gz": {
              "md5": "4b1f6f6fac43a23e783079db589fc7e2",
              "size": 81900940
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2_2.6.32-313.26.diff.gz": {
              "md5": "8cdaceb98706fe4a05ae00a5da39b42d",
              "size": 9006451
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-headers-2.6.32-313_2.6.32-313.26_all.deb": {
              "md5": "0b79b03ef63f936c4ec70afe1fb9f175",
              "size": 10042660
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2-source-2.6.32_2.6.32-313.26_all.deb": {
              "md5": "ce725a131a4a4450795d6b7b2ca9b17c",
              "size": 68190678
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-ec2-doc_2.6.32-313.26_all.deb": {
              "md5": "1f1387d40cfc16fbd07b6fbb2ff911ab",
              "size": 6430856
            }
          }
        },
        "amd64": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-image-2.6.32-313-ec2_2.6.32-313.26_amd64.deb": {
              "md5": "10cba12c56655afb94862979b703c0b0",
              "size": 20005422
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-headers-2.6.32-313-ec2_2.6.32-313.26_amd64.deb": {
              "md5": "4cd99928f8a74ce1860b42d8f092fbd3",
              "size": 691132
            }
          }
        },
        "i386": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-image-2.6.32-313-ec2_2.6.32-313.26_i386.deb": {
              "md5": "7dd28c8c0238f99f31bcfab4f9fc8433",
              "size": 19230428
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-ec2/linux-headers-2.6.32-313-ec2_2.6.32-313.26_i386.deb": {
              "md5": "c34756e6bff43f09d721b0dbe63cc0a4",
              "size": 656470
            }
          }
        }
      }
    }
  },
  "title": "Linux kernel vulnerabilities",
  "timestamp": 1299107259.266512,
  "summary": "linux-ec2 vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed. If\nyou use linux-restricted-modules, you have to update that package as\nwell to get modules which work with the new kernel version. Unless you\nmanually uninstalled the standard kernel metapackages (e.g. linux-generic,\nlinux-server, linux-powerpc), a standard system upgrade will automatically\nperform this as well.\n",
  "isummary": "Multiple kernel flaws.\n",
  "id": "USN-1080-2",
  "cves": [
    "CVE-2010-3865",
    "CVE-2010-3875",
    "CVE-2010-3876",
    "CVE-2010-3877",
    "CVE-2010-3880",
    "CVE-2010-4248",
    "CVE-2010-4343",
    "CVE-2010-4346",
    "CVE-2010-4526",
    "CVE-2010-4527",
    "CVE-2010-4648",
    "CVE-2010-4649",
    "CVE-2010-4650",
    "CVE-2011-0006",
    "CVE-2011-1044"
  ]
}