{
  "description": "\nChanam Park reported a Null pointer flaw in the Linux kernel's Ceph client.\nA remote attacker could exploit this flaw to cause a denial of service\n(system crash). (CVE-2013-1059)\n\nAn information leak was discovered in the Linux kernel's fanotify\ninterface. A local user could exploit this flaw to obtain sensitive\ninformation from kernel memory. (CVE-2013-2148)\n\nJonathan Salwan discovered an information leak in the Linux kernel's cdrom\ndriver. A local user can exploit this leak to obtain sensitive information\nfrom kernel memory if the CD-ROM drive is malfunctioning. (CVE-2013-2164)\n\nKees Cook discovered a format string vulnerability in the Linux kernel's\ndisk block layer. A local user with administrator privileges could exploit\nthis flaw to gain kernel privileges. (CVE-2013-2851)\n\nKees Cook discovered a format string vulnerability in the Broadcom B43\nwireless driver for the Linux kernel. A local user could exploit this flaw\nto gain administrative privileges. (CVE-2013-2852)\n\nHannes Frederic Sowa discovered that the Linux kernel's IPv6 stack does not\ncorrectly handle Router Advertisement (RA) message in some cases. A remote\nattacker could exploit this flaw to cause a denial of service (system\ncrash). (CVE-2013-4125)\n\nA vulnerability was discovered in the Linux kernel's vhost net driver. A\nlocal user could cause a denial of service (system crash) by powering on a\nvirtual machine. (CVE-2013-4127)\n\nMarcus Moeller and Ken Fallon discovered that the CIFS incorrectly built\ncertain paths. A local attacker with access to a CIFS partition could\nexploit this to crash the system, leading to a denial of service.\n(CVE-2013-4247)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-raring": {
          "version": "3.8.0-29.42~precise1",
          "description": "Linux hardware enablement kernel from Raring"
        }
      },
      "binaries": {
        "linux-image-3.8.0-29-generic": {
          "version": "3.8.0-29.42~precise1"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/": {
              "size": 6350,
              "md5": "5e131b7a0f51c1a5d5e29533b8e459c1"
            }
          }
        },
        "all": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/": {
              "size": 12176808,
              "md5": "5c68867e41c91548e36fb3c20a3cf4b7"
            }
          }
        },
        "amd64": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/": {
              "size": 123176,
              "md5": "e5580ec54da36c7e9228c934cd932adb"
            }
          }
        },
        "i386": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/": {
              "size": 73152,
              "md5": "01594452a7b6b8a38671403f4f6cd5e8"
            }
          }
        },
        "armhf": {
          "urls": {
            "http://ports.ubuntu.com/pool/": {
              "size": 55480,
              "md5": "64f40c2516cb4222a4581a3cb1b3cd25"
            }
          }
        }
      }
    }
  },
  "title": "Linux kernel (Raring HWE) vulnerabilities",
  "timestamp": 1377004934.101314,
  "summary": "linux-lts-raring vulnerabilities",
  "action": "After a standard system update you need to reboot your computer to make\nall the necessary changes.\n\nATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed. If\nyou use linux-restricted-modules, you have to update that package as\nwell to get modules which work with the new kernel version. Unless you\nmanually uninstalled the standard kernel metapackages (e.g. linux-generic,\nlinux-server, linux-powerpc), a standard system upgrade will automatically\nperform this as well.\n",
  "cves": [
    "CVE-2013-1059",
    "CVE-2013-2148",
    "CVE-2013-2164",
    "CVE-2013-2851",
    "CVE-2013-2852",
    "CVE-2013-4125",
    "CVE-2013-4127",
    "CVE-2013-4247"
  ],
  "id": "USN-1936-1",
  "isummary": "Several security issues were fixed in the kernel.\n"
}
