{
  "description": "\nDan Rosenberg discovered that the RDS network protocol did not correctly\ncheck certain parameters. A local attacker could exploit this gain root\nprivileges. (CVE-2010-3904)\n\nNelson Elhage discovered several problems with the Acorn Econet protocol\ndriver. A local user could cause a denial of service via a NULL pointer\ndereference, escalate privileges by overflowing the kernel stack, and\nassign Econet addresses to arbitrary interfaces. (CVE-2010-3848,\nCVE-2010-3849, CVE-2010-3850)\n\nBen Hutchings discovered that the ethtool interface did not correctly check\ncertain sizes. A local attacker could perform malicious ioctl calls that\ncould crash the system, leading to a denial of service. (CVE-2010-2478,\nCVE-2010-3084)\n\nEric Dumazet discovered that many network functions could leak kernel stack\ncontents. A local attacker could exploit this to read portions of kernel\nmemory, leading to a loss of privacy. (CVE-2010-2942, CVE-2010-3477)\n\nDave Chinner discovered that the XFS filesystem did not correctly order\ninode lookups when exported by NFS. A remote attacker could exploit this to\nread or write disk blocks that had changed file assignment or had become\nunlinked, leading to a loss of privacy. (CVE-2010-2943)\n\nTavis Ormandy discovered that the IRDA subsystem did not correctly shut\ndown. A local attacker could exploit this to cause the system to crash or\npossibly gain root privileges. (CVE-2010-2954)\n\nBrad Spengler discovered that the wireless extensions did not correctly\nvalidate certain request sizes. A local attacker could exploit this to read\nportions of kernel memory, leading to a loss of privacy. (CVE-2010-2955)\n\nTavis Ormandy discovered that the session keyring did not correctly check\nfor its parent. On systems without a default session keyring, a local\nattacker could exploit this to crash the system, leading to a denial of\nservice. (CVE-2010-2960)\n\nKees Cook discovered that the Intel i915 graphics driver did not correctly\nvalidate memory regions. A local attacker with access to the video card\ncould read and write arbitrary kernel memory to gain root privileges.\n(CVE-2010-2962)\n\nKees Cook discovered that the V4L1 32bit compat interface did not correctly\nvalidate certain parameters. A local attacker on a 64bit system with access\nto a video device could exploit this to gain root privileges.\n(CVE-2010-2963)\n\nTavis Ormandy discovered that the AIO subsystem did not correctly validate\ncertain parameters. A local attacker could exploit this to crash the system\nor possibly gain root privileges. (CVE-2010-3067)\n\nDan Rosenberg discovered that certain XFS ioctls leaked kernel stack\ncontents. A local attacker could exploit this to read portions of kernel\nmemory, leading to a loss of privacy. (CVE-2010-3078)\n\nRobert Swiecki discovered that ftrace did not correctly handle mutexes. A\nlocal attacker could exploit this to crash the kernel, leading to a denial\nof service. (CVE-2010-3079)\n\nTavis Ormandy discovered that the OSS sequencer device did not correctly\nshut down. A local attacker could exploit this to crash the system or\npossibly gain root privileges. (CVE-2010-3080)\n\nDan Rosenberg discovered that several network ioctls did not clear kernel\nmemory correctly. A local user could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-3296, CVE-2010-3297,\nCVE-2010-3298)\n\nDan Rosenberg discovered that the ROSE driver did not correctly check\nparameters. A local attacker with access to a ROSE network device could\nexploit this to crash the system or possibly gain root privileges.\n(CVE-2010-3310)\n\nThomas Dreibholz discovered that SCTP did not correctly handle appending\npacket chunks. A remote attacker could send specially crafted traffic to\ncrash the system, leading to a denial of service. (CVE-2010-3432)\n\nDan Rosenberg discovered that the CD driver did not correctly check\nparameters. A local attacker could exploit this to read arbitrary kernel\nmemory, leading to a loss of privacy. (CVE-2010-3437)\n\nDan Rosenberg discovered that the Sound subsystem did not correctly\nvalidate parameters. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-3442)\n\nDan Jacobson discovered that ThinkPad video output was not correctly access\ncontrolled. A local attacker could exploit this to hang the system, leading\nto a denial of service. (CVE-2010-3448)\n\nIt was discovered that KVM did not correctly initialize certain CPU\nregisters. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2010-3698)\n\nDan Rosenberg discovered that SCTP did not correctly handle HMAC\ncalculations. A remote attacker could send specially crafted traffic that\nwould crash the system, leading to a denial of service. (CVE-2010-3705)\n\nBrad Spengler discovered that stack memory for new a process was not\ncorrectly calculated. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-3858)\n\nDan Rosenberg discovered that the Linux kernel TIPC implementation\ncontained multiple integer signedness errors. A local attacker could\nexploit this to gain root privileges. (CVE-2010-3859)\n\nKees Cook discovered that the ethtool interface did not correctly clear\nkernel memory. A local attacker could read kernel heap memory, leading to a\nloss of privacy. (CVE-2010-3861)\n\nThomas Pollet discovered that the RDS network protocol did not check\ncertain iovec buffers. A local attacker could exploit this to crash the\nsystem or possibly execute arbitrary code as the root user. (CVE-2010-3865)\n\nDan Rosenberg discovered that the Linux kernel X.25 implementation\nincorrectly parsed facilities. A remote attacker could exploit this to\ncrash the kernel, leading to a denial of service. (CVE-2010-3873)\n\nDan Rosenberg discovered that the CAN protocol on 64bit systems did not\ncorrectly calculate the size of certain buffers. A local attacker could\nexploit this to crash the system or possibly execute arbitrary code as the\nroot user. (CVE-2010-3874)\n\nVasiliy Kulikov discovered that the Linux kernel X.25 implementation did\nnot correctly clear kernel memory. A local attacker could exploit this to\nread kernel stack memory, leading to a loss of privacy. (CVE-2010-3875)\n\nVasiliy Kulikov discovered that the Linux kernel sockets implementation did\nnot properly initialize certain structures. A local attacker could exploit\nthis to read kernel stack memory, leading to a loss of privacy.\n(CVE-2010-3876)\n\nVasiliy Kulikov discovered that the TIPC interface did not correctly\ninitialize certain structures. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-3877)\n\nNelson Elhage discovered that the Linux kernel IPv4 implementation did not\nproperly audit certain bytecodes in netlink messages. A local attacker\ncould exploit this to cause the kernel to hang, leading to a denial of\nservice. (CVE-2010-3880)\n\nVasiliy Kulikov discovered that kvm did not correctly clear memory. A local\nattacker could exploit this to read portions of the kernel stack, leading\nto a loss of privacy. (CVE-2010-3881)\n\nKees Cook and Vasiliy Kulikov discovered that the shm interface did not\nclear kernel memory correctly. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-4072)\n\nDan Rosenberg discovered that IPC structures were not correctly initialized\non 64bit systems. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4073)\n\nDan Rosenberg discovered that multiple terminal ioctls did not correctly\ninitialize structure memory. A local attacker could exploit this to read\nportions of kernel stack memory, leading to a loss of privacy.\n(CVE-2010-4075)\n\nDan Rosenberg discovered that the ivtv V4L driver did not correctly\ninitialize certian structures. A local attacker could exploit this to read\nkernel stack memory, leading to a loss of privacy. (CVE-2010-4079)\n\nDan Rosenberg discovered that the RME Hammerfall DSP audio interface driver\ndid not correctly clear kernel memory. A local attacker could exploit this\nto read kernel stack memory, leading to a loss of privacy. (CVE-2010-4080,\nCVE-2010-4081)\n\nDan Rosenberg discovered that the VIA video driver did not correctly clear\nkernel memory. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4082)\n\nDan Rosenberg discovered that the semctl syscall did not correctly clear\nkernel memory. A local attacker could exploit this to read kernel stack\nmemory, leading to a loss of privacy. (CVE-2010-4083)\n\nJames Bottomley discovered that the ICP vortex storage array controller\ndriver did not validate certain sizes. A local attacker on a 64bit system\ncould exploit this to crash the kernel, leading to a denial of service.\n(CVE-2010-4157)\n\nDan Rosenberg discovered that the socket filters did not correctly\ninitialize structure memory. A local attacker could create malicious\nfilters to read portions of kernel stack memory, leading to a loss of\nprivacy. (CVE-2010-4158)\n\nDan Rosenberg discovered that the Linux kernel L2TP implementation\ncontained multiple integer signedness errors. A local attacker could\nexploit this to to crash the kernel, or possibly gain root privileges.\n(CVE-2010-4160)\n\nDan Rosenberg discovered that certain iovec operations did not calculate\npage counts correctly. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4162)\n\nDan Rosenberg discovered that the SCSI subsystem did not correctly validate\niov segments. A local attacker with access to a SCSI device could send\nspecially crafted requests to crash the system, leading to a denial of\nservice. (CVE-2010-4163, CVE-2010-4668)\n\nDan Rosenberg discovered multiple flaws in the X.25 facilities parsing. If\na system was using X.25, a remote attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4164)\n\nSteve Chen discovered that setsockopt did not correctly check MSS values. A\nlocal attacker could make a specially crafted socket call to crash the\nsystem, leading to a denial of service. (CVE-2010-4165)\n\nDave Jones discovered that the mprotect system call did not correctly\nhandle merged VMAs. A local attacker could exploit this to crash the\nsystem, leading to a denial of service. (CVE-2010-4169)\n\nDan Rosenberg discovered that the RDS protocol did not correctly check\nioctl arguments. A local attacker could exploit this to crash the system,\nleading to a denial of service. (CVE-2010-4175)\n\nAlan Cox discovered that the HCI UART driver did not correctly check if a\nwrite operation was available. If the mmap_min-addr sysctl was changed from\nthe Ubuntu default to a value of 0, a local attacker could exploit this\nflaw to gain root privileges. (CVE-2010-4242)\n\nIt was discovered that multithreaded exec did not handle CPU timers\ncorrectly. A local attacker could exploit this to crash the system, leading\nto a denial of service. (CVE-2010-4248)\n\nVegard Nossum discovered that memory garbage collection was not handled\ncorrectly for active sockets. A local attacker could exploit this to\nallocate all available kernel memory, leading to a denial of service.\n(CVE-2010-4249)\n\nNelson Elhage discovered that the kernel did not correctly handle process\ncleanup after triggering a recoverable kernel bug. If a local attacker were\nable to trigger certain kinds of kernel bugs, they could create a specially\ncrafted process to gain root privileges. (CVE-2010-4258)\n\nKrishna Gudipati discovered that the bfa adapter driver did not correctly\ninitialize certain structures. A local attacker could read files in /sys to\ncrash the system, leading to a denial of service. (CVE-2010-4343)\n\nTavis Ormandy discovered that the install_special_mapping function could\nbypass the mmap_min_addr restriction. A local attacker could exploit this\nto mmap 4096 bytes below the mmap_min_addr area, possibly improving the\nchances of performing NULL pointer dereference attacks. (CVE-2010-4346)\n\nIt was discovered that the ICMP stack did not correctly handle certain\nunreachable messages. If a remote attacker were able to acquire a socket\nlock, they could send specially crafted traffic that would crash the\nsystem, leading to a denial of service. (CVE-2010-4526)\n\nDan Rosenberg discovered that the OSS subsystem did not handle name\ntermination correctly. A local attacker could exploit this crash the system\nor gain root privileges. (CVE-2010-4527)\n\nAn error was reported in the kernel's ORiNOCO wireless driver's handling of\nTKIP countermeasures. This reduces the amount of time an attacker needs\nbreach a wireless network using WPA+TKIP for security. (CVE-2010-4648)\n\nDan Carpenter discovered that the Infiniband driver did not correctly\nhandle certain requests. A local user could exploit this to crash the\nsystem or potentially gain root privileges. (CVE-2010-4649, CVE-2011-1044)\n\nAn error was discovered in the kernel's handling of CUSE (Character device\nin Userspace). A local attacker might exploit this flaw to escalate\nprivilege, if access to /dev/cuse has been modified to allow non-root\nusers. (CVE-2010-4650)\n\nKees Cook discovered that some ethtool functions did not correctly clear\nheap memory. A local attacker with CAP_NET_ADMIN privileges could exploit\nthis to read portions of kernel heap memory, leading to a loss of privacy.\n(CVE-2010-4655)\n\nKees Cook discovered that the IOWarrior USB device driver did not correctly\ncheck certain size fields. A local attacker with physical access could plug\nin a specially crafted USB device to crash the system or potentially gain\nroot privileges. (CVE-2010-4656)\n\nJoel Becker discovered that OCFS2 did not correctly validate on-disk\nsymlink structures. If an attacker were able to trick a user or automated\nsystem into mounting a specially crafted filesystem, it could crash the\nsystem or expose kernel memory, leading to a loss of privacy.\n(CVE-2010-NNN2)\n\nA flaw was found in the kernel's Integrity Measurement Architecture (IMA).\nChanges made by an attacker might not be discovered by IMA, if SELinux was\ndisabled, and a new IMA rule was loaded. (CVE-2011-0006)\n\nDan Carpenter discovered that the TTPCI DVB driver did not check certain\nvalues during an ioctl. If the dvb-ttpci module was loaded, a local\nattacker could exploit this to crash the system, leading to a denial of\nservice, or possibly gain root privileges. (CVE-2011-0521)\n\nRafael Dominguez Vega discovered that the caiaq Native Instruments USB\ndriver did not correctly validate string lengths. A local attacker with\nphysical access could plug in a specially crafted USB device to crash the\nsystem or potentially gain root privileges. (CVE-2011-0712)\n\nTimo Warns discovered that MAC partition parsing routines did not correctly\ncalculate block counts. A local attacker with physical access could plug in\na specially crafted block device to crash the system or potentially gain\nroot privileges. (CVE-2011-1010)\n\nTimo Warns discovered that LDM partition parsing routines did not correctly\ncalculate block counts. A local attacker with physical access could plug in\na specially crafted block device to crash the system, leading to a denial\nof service. (CVE-2011-1012)\n\nNelson Elhage discovered that the epoll subsystem did not correctly handle\ncertain structures. A local attacker could create malicious requests that\nwould hang the system, leading to a denial of service. (CVE-2011-1082)\n\nJohan Hovold discovered that the DCCP network stack did not correctly\nhandle certain packet combinations. A remote attacker could send specially\ncrafted network traffic that would crash the system, leading to a denial of\nservice. (CVE-2011-1093)\n",
  "releases": {
    "lucid": {
      "sources": {
        "linux-mvl-dove": {
          "version": "2.6.32-216.33",
          "description": "Block storage devices (udeb)"
        }
      },
      "binaries": {
        "linux-image-2.6.32-216-dove": {
          "version": "2.6.32-216.33"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-mvl-dove/linux-mvl-dove_2.6.32-216.33.diff.gz": {
              "size": 7629785,
              "md5": "10a442d5149f374d91647eee1131a244"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-mvl-dove/linux-mvl-dove_2.6.32.orig.tar.gz": {
              "size": 81900940,
              "md5": "4b1f6f6fac43a23e783079db589fc7e2"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-mvl-dove/linux-mvl-dove_2.6.32-216.33.dsc": {
              "size": 1426,
              "md5": "1c1ae71e7d8d0ac580d070190099317b"
            }
          }
        },
        "armel": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/kernel-image-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 3697714,
              "md5": "1ed6334e24e8f39b5297697be9d43c32"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/plip-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 8502,
              "md5": "26a885c1ad255a588b0f19a462dc0258"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/input-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 51674,
              "md5": "3909e00438c4a4745069bac12a1c2cb0"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/mouse-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 36128,
              "md5": "7f3c64a240fe1f20e8b0b7bbd08ba2c9"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/fat-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 4858,
              "md5": "da7caaa9a954230134eeb6ca2e1ae5d6"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/crypto-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 60836,
              "md5": "8a2347762bfd88d6cd11762559b31bc9"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nic-usb-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 111636,
              "md5": "523c1722daeec8b9d5c812dc654ed3b6"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/md-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 217320,
              "md5": "b1badf13ddb4078b3ef19e2ce9cd15e0"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nic-shared-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 215926,
              "md5": "56c448eafed5bc97db9a650143222a97"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/linux-image-2.6.32-216-dove_2.6.32-216.33_armel.deb": {
              "size": 16056640,
              "md5": "fdbe14522676dc8671f7a2668a3d964d"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/usb-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 76060,
              "md5": "f6cc06fd55a4cd2008a945fb96ee69fe"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nic-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 687538,
              "md5": "82c67cce03b161ebdf6e5cb7a5290e96"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/parport-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 33788,
              "md5": "fe6ca570f566bbc2a0524b0538c4a01d"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/ppp-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 57290,
              "md5": "86b9e09bef4600656c7bfa126b1424b7"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nfs-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 308630,
              "md5": "7e39cd12ff338e9c52f6d5409593cf3a"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/linux-headers-2.6.32-216-dove_2.6.32-216.33_armel.deb": {
              "size": 764044,
              "md5": "4a1fb599c05440c49d59c4a835ee69ae"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/fs-core-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 555128,
              "md5": "739fa40e465de910fef6dc127e888684"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/fs-secondary-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 138590,
              "md5": "b4a297fc18ad3a04a3f210e70361dec8"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/block-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 219790,
              "md5": "adbd9025fff4823c6e76ed1a83732dde"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/linux-headers-2.6.32-216_2.6.32-216.33_armel.deb": {
              "size": 10242462,
              "md5": "5f90b0186995ce359a6ae35b89f8a584"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/scsi-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 14260,
              "md5": "9322109be33a219aa08c26888f7d53bd"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/firewire-core-modules-2.6.32-216-dove-di_2.6.32-216.33_armel.udeb": {
              "size": 86606,
              "md5": "1101c2d85dc874b002fec02dc91b4e9a"
            }
          }
        }
      }
    },
    "maverick": {
      "sources": {
        "linux-mvl-dove": {
          "version": "2.6.32-416.33",
          "description": "Block storage devices (udeb)"
        }
      },
      "binaries": {
        "linux-image-2.6.32-416-dove": {
          "version": "2.6.32-416.33"
        }
      },
      "archs": {
        "source": {
          "urls": {
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-mvl-dove/linux-mvl-dove_2.6.32-416.33.tar.gz": {
              "size": 90276205,
              "md5": "53779b30af86ffb7c4c9330ce0892653"
            },
            "http://security.ubuntu.com/ubuntu/pool/main/l/linux-mvl-dove/linux-mvl-dove_2.6.32-416.33.dsc": {
              "size": 1155,
              "md5": "973108dba3858a860043a5a2a6b5fa99"
            }
          }
        },
        "armel": {
          "urls": {
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/input-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 56470,
              "md5": "11343afa90d062d35e8ee4d04392315a"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/fs-secondary-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 157288,
              "md5": "4cf5eaf4a491518bce5d3ba828892e18"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nfs-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 338846,
              "md5": "e7f8f841b7b1bbebcf39112cfd7b4968"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/kernel-image-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 3998446,
              "md5": "d96bb8ed4d5256f3b9e1d82147e34742"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/linux-headers-2.6.32-416-dove_2.6.32-416.33_armel.deb": {
              "size": 782358,
              "md5": "f9ddf5a5f778e29e4412d44b6ed3e0ed"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nic-usb-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 122258,
              "md5": "ad995a31be5f5ff1e614ca5ebb0a8264"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/plip-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 10376,
              "md5": "5d40952502a33ed0ab9dba1e30c9dbcf"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/scsi-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 15182,
              "md5": "70d5b20f4f42754994c542c9beb051e1"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/crypto-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 69288,
              "md5": "2c88af96a9d69ad25daf9cbd6403a559"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/block-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 267512,
              "md5": "f8b909552cab1c2dbcb42b7a69280145"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/linux-image-2.6.32-416-dove_2.6.32-416.33_armel.deb": {
              "size": 17981618,
              "md5": "e364479d3e93001888eaa914a3f554cb"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/parport-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 38132,
              "md5": "03a36ae8ff4501fc00f1e08f32f2ff2f"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/linux-headers-2.6.32-416_2.6.32-416.33_armel.deb": {
              "size": 10237228,
              "md5": "6771914efc0b995d1feb09db65e65f17"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/mouse-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 39184,
              "md5": "7c9900898bcc1bb28beeb5917750b417"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/fat-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 4908,
              "md5": "b954f16b25e5d873d1d79298e8627db4"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/ppp-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 64696,
              "md5": "8b4af44f42fc454ff118a12938c9d85b"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/usb-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 86228,
              "md5": "13c13e73665ca947df1d0516effac435"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/fs-core-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 616670,
              "md5": "b09e0fd87b4e810afa20322464a7ac63"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nic-shared-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 238426,
              "md5": "348c9bdf966a5a3dde67d687f116e31a"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/md-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 236554,
              "md5": "6979d5a5cd2967d5e1fac6be7d53eb28"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/firewire-core-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 96660,
              "md5": "dd89814e86c8b0e84cfa30ee6c22fedd"
            },
            "http://ports.ubuntu.com/pool/main/l/linux-mvl-dove/nic-modules-2.6.32-416-dove-di_2.6.32-416.33_armel.udeb": {
              "size": 796006,
              "md5": "39aee60cb92774dc50af3c6ae3c4d09b"
            }
          }
        }
      }
    }
  },
  "title": "Linux Kernel vulnerabilities (Marvell Dove)",
  "timestamp": 1301083050.379392,
  "summary": "linux-mvl-dove vulnerabilities",
  "action": "ATTENTION: Due to an unavoidable ABI change the kernel updates have\nbeen given a new version number, which requires you to recompile and\nreinstall all third party kernel modules you might have installed. If\nyou use linux-restricted-modules, you have to update that package as\nwell to get modules which work with the new kernel version. Unless you\nmanually uninstalled the standard kernel metapackages (e.g. linux-generic,\nlinux-server, linux-powerpc), a standard system upgrade will automatically\nperform this as well.\n",
  "cves": [
    "CVE-2010-2478",
    "CVE-2010-2942",
    "CVE-2010-2943",
    "CVE-2010-2954",
    "CVE-2010-2955",
    "CVE-2010-2960",
    "CVE-2010-2962",
    "CVE-2010-2963",
    "CVE-2010-3067",
    "CVE-2010-3078",
    "CVE-2010-3079",
    "CVE-2010-3080",
    "CVE-2010-3084",
    "CVE-2010-3296",
    "CVE-2010-3297",
    "CVE-2010-3298",
    "CVE-2010-3310",
    "CVE-2010-3432",
    "CVE-2010-3437",
    "CVE-2010-3442",
    "CVE-2010-3448",
    "CVE-2010-3477",
    "CVE-2010-3698",
    "CVE-2010-3705",
    "CVE-2010-3848",
    "CVE-2010-3849",
    "CVE-2010-3850",
    "CVE-2010-3858",
    "CVE-2010-3859",
    "CVE-2010-3861",
    "CVE-2010-3865",
    "CVE-2010-3873",
    "CVE-2010-3874",
    "CVE-2010-3875",
    "CVE-2010-3876",
    "CVE-2010-3877",
    "CVE-2010-3880",
    "CVE-2010-3881",
    "CVE-2010-3904",
    "CVE-2010-4072",
    "CVE-2010-4073",
    "CVE-2010-4075",
    "CVE-2010-4079",
    "CVE-2010-4080",
    "CVE-2010-4081",
    "CVE-2010-4082",
    "CVE-2010-4083",
    "CVE-2010-4157",
    "CVE-2010-4158",
    "CVE-2010-4160",
    "CVE-2010-4162",
    "CVE-2010-4163",
    "CVE-2010-4164",
    "CVE-2010-4165",
    "CVE-2010-4169",
    "CVE-2010-4175",
    "CVE-2010-4242",
    "CVE-2010-4248",
    "CVE-2010-4249",
    "CVE-2010-4258",
    "CVE-2010-4343",
    "CVE-2010-4346",
    "CVE-2010-4526",
    "CVE-2010-4527",
    "CVE-2010-4648",
    "CVE-2010-4649",
    "CVE-2010-4650",
    "CVE-2010-4655",
    "CVE-2010-4656",
    "CVE-2010-4668",
    "CVE-2010-NNN2",
    "CVE-2011-0006",
    "CVE-2011-0521",
    "CVE-2011-0712",
    "CVE-2011-1010",
    "CVE-2011-1012",
    "CVE-2011-1044",
    "CVE-2011-1082",
    "CVE-2011-1093"
  ],
  "id": "USN-1093-1",
  "isummary": "An attacker could send crafted input to the kernel and cause it to\ncrash.\n"
}
