{
  "description": "USN-3655-1 fixed vulnerabilities and added mitigations in the Linux\nkernel for Ubuntu 14.04 LTS. This update provides the corresponding\nupdates for the Linux Hardware Enablement (HWE) kernel from Ubuntu\n14.04 LTS for Ubuntu 12.04 ESM.\n\nJann Horn and Ken Johnson discovered that microprocessors utilizing\nspeculative execution of a memory read may allow unauthorized memory\nreads via a sidechannel attack. This flaw is known as Spectre\nVariant 4. A local attacker could use this to expose sensitive\ninformation, including kernel memory. (CVE-2018-3639)\n\nJan H. Schönherr discovered that the Xen subsystem did not properly handle\nblock IO merges correctly in some situations. An attacker in a guest vm\ncould use this to cause a denial of service (host crash) or possibly gain\nadministrative privileges in the host. (CVE-2017-12134)\n\nIt was discovered that the Bluetooth HIP Protocol implementation in the\nLinux kernel did not properly validate HID connection setup information. An\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2017-13220)\n\nIt was discovered that a buffer overread vulnerability existed in the\nkeyring subsystem of the Linux kernel. A local attacker could possibly use\nthis to expose sensitive information (kernel memory). (CVE-2017-13305)\n\nIt was discovered that the netlink subsystem in the Linux kernel did not\nproperly restrict observations of netlink messages to the appropriate net\nnamespace. A local attacker could use this to expose sensitive information\n(kernel netlink traffic). (CVE-2017-17449)\n\nIt was discovered that a race condition existed in the i8042 serial device\ndriver implementation in the Linux kernel. A physically proximate attacker\ncould use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2017-18079)\n\nIt was discovered that a race condition existed in the Device Mapper\ncomponent of the Linux kernel. A local attacker could use this to cause a\ndenial of service (system crash). (CVE-2017-18203)\n\nIt was discovered that a race condition existed in the OCFS2 file system\nimplementation in the Linux kernel. A local attacker could use this to\ncause a denial of service (kernel deadlock). (CVE-2017-18204)\n\nIt was discovered that an infinite loop could occur in the madvise(2)\nimplementation in the Linux kernel in certain circumstances. A local\nattacker could use this to cause a denial of service (system hang).\n(CVE-2017-18208)\n\nKefeng Wang discovered that a race condition existed in the memory locking\nimplementation in the Linux kernel. A local attacker could use this to\ncause a denial of service. (CVE-2017-18221)\n\nSilvio Cesare discovered a buffer overwrite existed in the NCPFS\nimplementation in the Linux kernel. A remote attacker controlling a\nmalicious NCPFS server could use this to cause a denial of service (system\ncrash) or possibly execute arbitrary code. (CVE-2018-8822)\n",
  "releases": {
    "precise": {
      "sources": {
        "linux-lts-trusty": {
          "version": "3.13.0-149.199~precise1",
          "description": "Linux hardware enablement kernel from Trusty for Precise ESM"
        }
      },
      "binaries": {
        "linux-image-generic-lpae-lts-trusty": {
          "version": "3.13.0.149.140"
        },
        "linux-image-3.13.0-149-generic": {
          "version": "3.13.0-149.199~precise1"
        },
        "linux-image-generic-lts-trusty": {
          "version": "3.13.0.149.140"
        },
        "linux-image-3.13.0-149-generic-lpae": {
          "version": "3.13.0-149.199~precise1"
        }
      }
    }
  },
  "title": "Linux kernel (Trusty HWE) vulnerabilities",
  "timestamp": 1526960668.059904,
  "summary": "linux-lts-trusty vulnerabilities",
  "action": "Please note that fully mitigating CVE-2018-3639 (Spectre Variant 4)\nmay require corresponding processor microcode/firmware updates or,\nin virtual environments, hypervisor updates. On i386 and amd64\narchitectures, the SSBD feature is required to enable the kernel\nmitigations. BIOS vendors will be making updates available for Intel\nprocessors that implement SSBD. Ubuntu users with a processor from\na different vendor should contact the vendor to identify necessary\nfirmware updates. Ubuntu users in cloud environments should contact\nthe cloud provider to confirm that the hypervisor has been updated\nto expose the new CPU features to virtual machines.\n",
  "cves": [
    "CVE-2017-12134",
    "CVE-2017-13220",
    "CVE-2017-13305",
    "CVE-2017-17449",
    "CVE-2017-18079",
    "CVE-2017-18203",
    "CVE-2017-18204",
    "CVE-2017-18208",
    "CVE-2017-18221",
    "CVE-2018-3639",
    "CVE-2018-8822",
    "https://wiki.ubuntu.com/SecurityTeam/KnowledgeBase/Variant4"
  ],
  "id": "USN-3655-2",
  "isummary": "Several security issues were addressed in the Linux kernel.\n"
}
