{
  "schema_version": "1.7.0",
  "id": "USN-5877-1",
  "summary": "linux-gke-5.15 vulnerabilities",
  "details": "Kyle Zeng discovered that the sysctl implementation in the Linux kernel\ncontained a stack-based buffer overflow. A local attacker could use this to\ncause a denial of service (system crash) or execute arbitrary code.\n(CVE-2022-4378)\n\nTamás Koczka discovered that the Bluetooth L2CAP handshake implementation\nin the Linux kernel contained multiple use-after-free vulnerabilities. A\nphysically proximate attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2022-42896)\n\nMingwei Zhang discovered that the KVM implementation for AMD processors in\nthe Linux kernel did not properly handle cache coherency with Secure\nEncrypted Virtualization (SEV). A local attacker could possibly use this to\ncause a denial of service (host system crash). (CVE-2022-0171)\n\nIt was discovered that a race condition existed in the Android Binder IPC\nsubsystem in the Linux kernel, leading to a use-after-free vulnerability. A\nlocal attacker could use this to cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2022-20421)\n\nDavid Leadbeater discovered that the netfilter IRC protocol tracking\nimplementation in the Linux Kernel incorrectly handled certain message\npayloads in some situations. A remote attacker could possibly use this to\ncause a denial of service or bypass firewall filtering. (CVE-2022-2663)\n\nIt was discovered that the Intel 740 frame buffer driver in the Linux\nkernel contained a divide by zero vulnerability. A local attacker could use\nthis to cause a denial of service (system crash). (CVE-2022-3061)\n\nIt was discovered that the sound subsystem in the Linux kernel contained a\nrace condition in some situations. A local attacker could use this to cause\na denial of service (system crash). (CVE-2022-3303)\n\nIt was discovered that a memory leak existed in the Unix domain socket\nimplementation of the Linux kernel. A local attacker could use this to\ncause a denial of service (memory exhaustion). (CVE-2022-3543)\n\nGwnaun Jung discovered that the SFB packet scheduling implementation in the\nLinux kernel contained a use-after-free vulnerability. A local attacker\ncould use this to cause a denial of service (system crash) or possibly\nexecute arbitrary code. (CVE-2022-3586)\n\nIt was discovered that the Bluetooth HCI implementation in the Linux kernel\ndid not properly deallocate memory in some situations. An attacker could\npossibly use this cause a denial of service (memory exhaustion).\n(CVE-2022-3619)\n\nIt was discovered that the hugetlb implementation in the Linux kernel\ncontained a race condition in some situations. A local attacker could use\nthis to cause a denial of service (system crash) or expose sensitive\ninformation (kernel memory). (CVE-2022-3623)\n\nIt was discovered that the Broadcom FullMAC USB WiFi driver in the Linux\nkernel did not properly perform bounds checking in some situations. A\nphysically proximate attacker could use this to craft a malicious USB\ndevice that when inserted, could cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2022-3628)\n\nIt was discovered that a use-after-free vulnerability existed in the\nBluetooth stack in the Linux kernel. A local attacker could use this to\ncause a denial of service (system crash) or possibly execute arbitrary\ncode. (CVE-2022-3640)\n\nIt was discovered that the Xen netback driver in the Linux kernel did not\nproperly handle packets structured in certain ways. An attacker in a guest\nVM could possibly use this to cause a denial of service (host NIC\navailability). (CVE-2022-3643)\n\nIt was discovered that the NILFS2 file system implementation in the Linux\nkernel did not properly deallocate memory in certain error conditions. An\nattacker could use this to cause a denial of service (memory exhaustion).\n(CVE-2022-3646)\n\nKhalid Masum discovered that the NILFS2 file system implementation in the\nLinux kernel did not properly handle certain error conditions, leading to a\nuse-after-free vulnerability. A local attacker could use this to cause a\ndenial of service or possibly execute arbitrary code. (CVE-2022-3649)\n\nJann Horn discovered a race condition existed in the Linux kernel when\nunmapping VMAs in certain situations, resulting in possible use-after-free\nvulnerabilities. A local attacker could possibly use this to cause a denial\nof service (system crash) or execute arbitrary code. (CVE-2022-39188)\n\nHyunwoo Kim discovered that an integer overflow vulnerability existed in\nthe PXA3xx graphics driver in the Linux kernel. A local attacker could\npossibly use this to cause a denial of service (system crash).\n(CVE-2022-39842)\n\nIt was discovered that a race condition existed in the EFI capsule loader\ndriver in the Linux kernel, leading to a use-after-free vulnerability. A\nlocal attacker could use this to cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2022-40307)\n\nZheng Wang and Zhuorao Yang discovered that the RealTek RTL8712U wireless\ndriver in the Linux kernel contained a use-after-free vulnerability. A\nlocal attacker could use this to cause a denial of service (system crash)\nor possibly execute arbitrary code. (CVE-2022-4095)\n\nIt was discovered that a race condition existed in the SMSC UFX USB driver\nimplementation in the Linux kernel, leading to a use-after-free\nvulnerability. A physically proximate attacker could use this to cause a\ndenial of service (system crash) or possibly execute arbitrary code.\n(CVE-2022-41849)\n\nIt was discovered that a race condition existed in the Roccat HID driver in\nthe Linux kernel, leading to a use-after-free vulnerability. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2022-41850)\n\nTamás Koczka discovered that the Bluetooth L2CAP implementation in the\nLinux kernel did not properly initialize memory in some situations. A\nphysically proximate attacker could possibly use this to expose sensitive\ninformation (kernel memory). (CVE-2022-42895)\n\nIt was discovered that the USB monitoring (usbmon) component in the Linux\nkernel did not properly set permissions on memory mapped in to user space\nprocesses. A local attacker could use this to cause a denial of service\n(system crash) or possibly execute arbitrary code. (CVE-2022-43750)\n\nIt was discovered that an integer overflow vulnerability existed in the\nBluetooth subsystem in the Linux kernel. A physically proximate attacker\ncould use this to cause a denial of service (system crash).\n(CVE-2022-45934)\n\nIt was discovered that the USB core subsystem in the Linux kernel did not\nproperly handle nested reset events. A local attacker with physical access\ncould plug in a specially crafted USB device to cause a denial of service\n(kernel deadlock). (CVE-2022-4662)\n\nArnaud Gatignol, Quentin Minster, Florent Saudel and Guillaume Teissier\ndiscovered that the KSMBD implementation in the Linux kernel did not\nproperly validate user-supplied data in some situations. An authenticated\nattacker could use this to cause a denial of service (system crash), expose\nsensitive information (kernel memory) or possibly execute arbitrary code.\n(CVE-2022-47940)\n\nIt was discovered that a race condition existed in the qdisc implementation\nin the Linux kernel, leading to a use-after-free vulnerability. A local\nattacker could use this to cause a denial of service (system crash) or\npossibly execute arbitrary code. (CVE-2023-0590)\n\n",
  "aliases": [],
  "upstream": [
    "UBUNTU-CVE-2022-0171",
    "UBUNTU-CVE-2022-2663",
    "UBUNTU-CVE-2022-3061",
    "UBUNTU-CVE-2022-3303",
    "UBUNTU-CVE-2022-3543",
    "UBUNTU-CVE-2022-3586",
    "UBUNTU-CVE-2022-3619",
    "UBUNTU-CVE-2022-3623",
    "UBUNTU-CVE-2022-3628",
    "UBUNTU-CVE-2022-3640",
    "UBUNTU-CVE-2022-3643",
    "UBUNTU-CVE-2022-3646",
    "UBUNTU-CVE-2022-3649",
    "UBUNTU-CVE-2022-4095",
    "UBUNTU-CVE-2022-4378",
    "UBUNTU-CVE-2022-4662",
    "UBUNTU-CVE-2022-20421",
    "UBUNTU-CVE-2022-39188",
    "UBUNTU-CVE-2022-39842",
    "UBUNTU-CVE-2022-40307",
    "UBUNTU-CVE-2022-41849",
    "UBUNTU-CVE-2022-41850",
    "UBUNTU-CVE-2022-42895",
    "UBUNTU-CVE-2022-42896",
    "UBUNTU-CVE-2022-43750",
    "UBUNTU-CVE-2022-45934",
    "UBUNTU-CVE-2022-47940",
    "UBUNTU-CVE-2023-0590"
  ],
  "related": [],
  "published": "2023-02-15T23:05:01.870323Z",
  "modified": "2025-09-16T07:47:00Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:20.04:LTS",
        "name": "linux-gke-5.15",
        "purl": "pkg:deb/ubuntu/linux-gke-5.15@5.15.0-1027.32~20.04.1?arch=source&distro=focal"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "5.15.0-1027.32~20.04.1"
            }
          ]
        }
      ],
      "versions": [
        "5.15.0-1011.14~20.04.1",
        "5.15.0-1014.17~20.04.1",
        "5.15.0-1015.18~20.04.1",
        "5.15.0-1016.19~20.04.1",
        "5.15.0-1019.23~20.04.1",
        "5.15.0-1020.25~20.04.1",
        "5.15.0-1023.28~20.04.2"
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "binary_name": "linux-buildinfo-5.15.0-1027-gke",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-gke-5.15-headers-5.15.0-1027",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-gke-5.15-tools-5.15.0-1027",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-headers-5.15.0-1027-gke",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-image-unsigned-5.15.0-1027-gke",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-modules-5.15.0-1027-gke",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-modules-extra-5.15.0-1027-gke",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-modules-iwlwifi-5.15.0-1027-gke",
            "binary_version": "5.15.0-1027.32~20.04.1"
          },
          {
            "binary_name": "linux-tools-5.15.0-1027-gke",
            "binary_version": "5.15.0-1027.32~20.04.1"
          }
        ],
        "availability": "No subscription required"
      },
      "database_specific": {
        "cves_map": {
          "ecosystem": "Ubuntu:20.04:LTS",
          "cves": [
            "CVE-2022-0171",
            "CVE-2022-2663",
            "CVE-2022-3061",
            "CVE-2022-3303",
            "CVE-2022-3543",
            "CVE-2022-3586",
            "CVE-2022-3619",
            "CVE-2022-3623",
            "CVE-2022-3628",
            "CVE-2022-3640",
            "CVE-2022-3643",
            "CVE-2022-3646",
            "CVE-2022-3649",
            "CVE-2022-4095",
            "CVE-2022-4378",
            "CVE-2022-4662",
            "CVE-2022-20421",
            "CVE-2022-39188",
            "CVE-2022-39842",
            "CVE-2022-40307",
            "CVE-2022-41849",
            "CVE-2022-41850",
            "CVE-2022-42895",
            "CVE-2022-42896",
            "CVE-2022-43750",
            "CVE-2022-45934",
            "CVE-2022-47940",
            "CVE-2023-0590"
          ]
        }
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-5877-1"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-0171"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-2663"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3061"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3303"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3543"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3586"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3619"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3623"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3628"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3640"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3643"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3646"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-3649"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-4095"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-4378"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-4662"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-20421"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-39188"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-39842"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-40307"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-41849"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-41850"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-42895"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-42896"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-43750"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-45934"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2022-47940"
    },
    {
      "type": "REPORT",
      "url": "https://ubuntu.com/security/CVE-2023-0590"
    }
  ]
}