{
  "schema_version": "1.7.0",
  "id": "USN-2702-3",
  "summary": "firefox regression",
  "details": "USN-2702-1 fixed vulnerabilities in Firefox. After upgrading, some users\nin the US reported that their default search engine switched to Yahoo.\nThis update fixes the problem.\n\nWe apologize for the inconvenience.\n\nOriginal advisory details:\n\n Gary Kwong, Christian Holler, Byron Campen, Tyson Smith, Bobby Holley,\n Chris Coulson, and Eric Rahm discovered multiple memory safety issues in\n Firefox. If a user were tricked in to opening a specially crafted website,\n an attacker could potentially exploit these to cause a denial of service\n via application crash, or execute arbitrary code with the privileges of\n the user invoking Firefox. (CVE-2015-4473, CVE-2015-4474)\n \n Aki Helin discovered an out-of-bounds read when playing malformed MP3\n content in some circumstances. If a user were tricked in to opening a\n specially crafted website, an attacker could potentially exploit this to\n obtain sensitive information, cause a denial of service via application\n crash, or execute arbitrary code with the privileges of the user invoking\n Firefox. (CVE-2015-4475)\n \n A use-after-free was discovered during MediaStream playback in some\n circumstances. If a user were tricked in to opening a specially crafted\n website, an attacker could potentially exploit this to cause a denial of\n service via application crash or execute arbitrary code with the\n priviliges of the user invoking Firefox. (CVE-2015-4477)\n \n André Bargull discovered that non-configurable properties on javascript\n objects could be redefined when parsing JSON. If a user were tricked in to\n opening a specially crafted website, an attacker could potentially exploit\n this to bypass same-origin restrictions. (CVE-2015-4478)\n \n Multiple integer overflows were discovered in libstagefright. If a user\n were tricked in to opening a specially crafted website, an attacker could\n potentially exploit these to cause a denial of service via application\n crash, or execute arbitrary code with the privileges of the user invoking\n Firefox. (CVE-2015-4479, CVE-2015-4480, CVE-2015-4493)\n \n Jukka Jylänki discovered a crash that occurs because javascript does not\n properly gate access to Atomics or SharedArrayBuffers in some\n circumstances. If a user were tricked in to opening a specially crafted\n website, an attacker could potentially exploit this to cause a denial of\n service. (CVE-2015-4484)\n \n Abhishek Arya discovered 2 buffer overflows in libvpx when decoding\n malformed WebM content in some circumstances. If a user were tricked in\n to opening a specially crafted website, an attacker could potentially\n exploit these to cause a denial of service via application crash, or\n execute arbitrary code with the privileges of the user invoking Firefox.\n (CVE-2015-4485, CVE-2015-4486)\n \n Ronald Crane reported 3 security issues. If a user were tricked in to\n opening a specially crafted website, an attacker could potentially\n exploit these, in combination with another security vulnerability, to\n cause a denial of service via application crash, or execute arbitrary\n code with the privileges of the user invoking Firefox. (CVE-2015-4487,\n CVE-2015-4488, CVE-2015-4489)\n \n Christoph Kerschbaumer discovered an issue with Mozilla's implementation\n of Content Security Policy (CSP), which could allow for a more permissive\n usage in some cirucumstances. An attacker could potentially exploit this\n to conduct cross-site scripting (XSS) attacks. (CVE-2015-4490)\n \n Gustavo Grieco discovered a heap overflow in gdk-pixbuf. If a user were\n tricked in to opening a specially crafted website, an attacker could\n potentially exploit this to cause a denial of service via application\n crash or execute arbitrary code with the priviliges of the user invoking\n Firefox. (CVE-2015-4491)\n \n Looben Yang discovered a use-after-free when using XMLHttpRequest with\n shared workers in some circumstances. If a user were tricked in to opening\n a specially crafted website, an attacker could potentially exploit this to\n cause a denial of service via application crash or execute arbitrary code\n with the priviliges of the user invoking Firefox. (CVE-2015-4492)\n",
  "aliases": [],
  "upstream": [],
  "related": [],
  "published": "2015-08-20T19:07:40.182523Z",
  "modified": "2025-09-16T07:46:29Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:14.04:LTS",
        "name": "firefox",
        "purl": "pkg:deb/ubuntu/firefox@40.0+build4-0ubuntu0.14.04.4?arch=source&distro=trusty"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "40.0+build4-0ubuntu0.14.04.4"
            }
          ]
        }
      ],
      "versions": [
        "24.0+build1-0ubuntu1",
        "25.0+build3-0ubuntu0.13.10.1",
        "28.0~b2+build1-0ubuntu2",
        "28.0+build1-0ubuntu1",
        "28.0+build2-0ubuntu1",
        "28.0+build2-0ubuntu2",
        "29.0+build1-0ubuntu0.14.04.2",
        "30.0+build1-0ubuntu0.14.04.3",
        "31.0+build1-0ubuntu0.14.04.1",
        "32.0+build1-0ubuntu0.14.04.1",
        "32.0.3+build1-0ubuntu0.14.04.1",
        "33.0+build2-0ubuntu0.14.04.1",
        "34.0+build2-0ubuntu0.14.04.1",
        "35.0+build3-0ubuntu0.14.04.2",
        "35.0.1+build1-0ubuntu0.14.04.1",
        "36.0+build2-0ubuntu0.14.04.4",
        "36.0.1+build2-0ubuntu0.14.04.1",
        "36.0.4+build1-0ubuntu0.14.04.1",
        "37.0+build2-0ubuntu0.14.04.1",
        "37.0.1+build1-0ubuntu0.14.04.1",
        "37.0.2+build1-0ubuntu0.14.04.1",
        "38.0+build3-0ubuntu0.14.04.1",
        "39.0+build5-0ubuntu0.14.04.1",
        "39.0.3+build2-0ubuntu0.14.04.1",
        "40.0+build4-0ubuntu0.14.04.1"
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "binary_name": "firefox",
            "binary_version": "40.0+build4-0ubuntu0.14.04.4"
          },
          {
            "binary_name": "firefox-dev",
            "binary_version": "40.0+build4-0ubuntu0.14.04.4"
          },
          {
            "binary_name": "firefox-globalmenu",
            "binary_version": "40.0+build4-0ubuntu0.14.04.4"
          },
          {
            "binary_name": "firefox-mozsymbols",
            "binary_version": "40.0+build4-0ubuntu0.14.04.4"
          },
          {
            "binary_name": "firefox-testsuite",
            "binary_version": "40.0+build4-0ubuntu0.14.04.4"
          }
        ],
        "availability": "No subscription required"
      },
      "database_specific": {
        "cves_map": {
          "ecosystem": "Ubuntu:14.04:LTS",
          "cves": []
        }
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-2702-3"
    },
    {
      "type": "REPORT",
      "url": "https://launchpad.net/bugs/1485741"
    }
  ]
}