{
  "schema_version": "1.7.0",
  "id": "USN-2743-2",
  "summary": "ubufox update",
  "details": "USN-2743-1 fixed vulnerabilities in Firefox. This update provides the\ncorresponding update for Ubufox.\n\nOriginal advisory details:\n\n Andrew Osmond, Olli Pettay, Andrew Sutherland, Christian Holler, David\n Major, Andrew McCreight, Cameron McCormack, Bob Clary and Randell Jesup\n discovered multiple memory safety issues in Firefox. If a user were\n tricked in to opening a specially crafted website, an attacker could\n potentially exploit these to cause a denial of service via application\n crash, or execute arbitrary code with the privileges of the user invoking\n Firefox. (CVE-2015-4500, CVE-2015-4501)\n \n André Bargull discovered that when a web page creates a scripted proxy\n for the window with a handler defined a certain way, a reference to the\n inner window will be passed, rather than that of the outer window.\n (CVE-2015-4502)\n \n Felix Gröbert discovered an out-of-bounds read in the QCMS color\n management library in some circumstances. If a user were tricked in to\n opening a specially crafted website, an attacker could potentially exploit\n this to cause a denial of service via application crash, or obtain\n sensitive information. (CVE-2015-4504)\n \n Khalil Zhani discovered a buffer overflow when parsing VP9 content in some\n circumstances. If a user were tricked in to opening a specially crafted\n website, an attacker could potentially exploit this to cause a denial of\n service via application crash, or execute arbitrary code with the\n privileges of the user invoking Firefox. (CVE-2015-4506)\n \n Spandan Veggalam discovered a crash while using the debugger API in some\n circumstances. If a user were tricked in to opening a specially crafted\n website whilst using the debugger, an attacker could potentially exploit\n this to execute arbitrary code with the privileges of the user invoking\n Firefox. (CVE-2015-4507)\n \n Juho Nurminen discovered that the URL bar could display the wrong URL in\n reader mode in some circumstances. If a user were tricked in to opening a\n specially crafted website, an attacker could potentially exploit this to\n conduct URL spoofing attacks. (CVE-2015-4508)\n \n A use-after-free was discovered when manipulating HTML media content in\n some circumstances. If a user were tricked in to opening a specially\n crafted website, an attacker could potentially exploit this to cause a\n denial of service via application crash, or execute arbitrary code with\n the privileges of the user invoking Firefox. (CVE-2015-4509)\n \n Looben Yang discovered a use-after-free when using a shared worker with\n IndexedDB in some circumstances. If a user were tricked in to opening a\n specially crafted website, an attacker could potentially exploit this to\n cause a denial of service via application crash, or execute arbitrary code\n with the privileges of the user invoking Firefox. (CVE-2015-4510)\n \n Francisco Alonso discovered an out-of-bounds read during 2D canvas\n rendering in some circumstances. If a user were tricked in to opening a\n specially crafted website, an attacker could potentially exploit this to\n obtain sensitive information. (CVE-2015-4512)\n \n Jeff Walden discovered that changes could be made to immutable properties\n in some circumstances. If a user were tricked in to opening a specially\n crafted website, an attacker could potentially exploit this to execute\n arbitrary script in a privileged scope. (CVE-2015-4516)\n \n Ronald Crane reported multiple vulnerabilities. If a user were tricked in\n to opening a specially crafted website, an attacker could potentially\n exploit these to cause a denial of service via application crash, or\n execute arbitrary code with the privileges of the user invoking Firefox.\n (CVE-2015-4517, CVE-2015-4521, CVE-2015-4522, CVE-2015-7174,\n CVE-2015-7175, CVE-2015-7176, CVE-2015-7177, CVE-2015-7180)\n \n Mario Gomes discovered that dragging and dropping an image after a\n redirect exposes the redirected URL to scripts. An attacker could\n potentially exploit this to obtain sensitive information. (CVE-2015-4519)\n \n Ehsan Akhgari discovered 2 issues with CORS preflight requests. An\n attacker could potentially exploit these to bypass CORS restrictions.\n (CVE-2015-4520)\n",
  "aliases": [],
  "upstream": [],
  "related": [],
  "published": "2015-09-22T22:23:42.072239Z",
  "modified": "2025-09-16T07:46:30Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:14.04:LTS",
        "name": "ubufox",
        "purl": "pkg:deb/ubuntu/ubufox@3.2-0ubuntu0.14.04.1?arch=source&distro=trusty"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "3.2-0ubuntu0.14.04.1"
            }
          ]
        }
      ],
      "versions": [
        "2.8-0ubuntu1",
        "2.9-0ubuntu0.14.04.1",
        "3.0-0ubuntu0.14.04.1",
        "3.1-0ubuntu0.14.04.1"
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "binary_name": "ubufox",
            "binary_version": "3.2-0ubuntu0.14.04.1"
          },
          {
            "binary_name": "xul-ext-ubufox",
            "binary_version": "3.2-0ubuntu0.14.04.1"
          }
        ],
        "availability": "No subscription required"
      },
      "database_specific": {
        "cves_map": {
          "ecosystem": "Ubuntu:14.04:LTS",
          "cves": []
        }
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-2743-2"
    },
    {
      "type": "REPORT",
      "url": "https://launchpad.net/bugs/1498681"
    }
  ]
}