{
  "schema_version": "1.7.0",
  "id": "USN-7330-2",
  "summary": "ansible regression",
  "details": "USN-7330-1 fixed vulnerabilities in Ansible. The update introduced a\nregression when attempting to install Ansible on Ubuntu 16.04 LTS.\nThis update fixes the problem.\n\nWe apologize for the inconvenience.\n\nOriginal advisory details:\n\n It was discovered that Ansible did not properly verify certain fields\n of X.509 certificates. An attacker could possibly use this issue to\n spoof SSL servers if they were able to intercept network communications.\n This issue only affected Ubuntu 14.04 LTS. (CVE-2015-3908)\n \n Martin Carpenter discovered that certain connection plugins for Ansible\n did not properly restrict users. An attacker with local access could\n possibly use this issue to escape a restricted environment via symbolic\n links misuse. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-6240)\n \n Robin Schneider discovered that Ansible's apt_key module did not properly\n verify key fingerprints. A remote attacker could possibly use this issue\n to perform key injection, leading to the access of sensitive information.\n This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS.\n (CVE-2016-8614)\n \n It was discovered that Ansible would expose passwords in certain\n instances. An attacker could possibly use specially crafted input\n related to this issue to access sensitive information. This issue only\n affected  Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2019-10206)\n \n It was discovered that Ansible incorrectly logged sensitive information.\n An attacker with local access could possibly use this issue to access\n sensitive information. This issue only affected Ubuntu 14.04 LTS, Ubuntu\n 16.04 LTS, and Ubuntu 18.04 LTS. (CVE-2019-14846)\n \n It was discovered that Ansible's solaris_zone module accepted input\n without performing input checking. A remote attacker could possibly use\n this issue to enable the execution of arbitrary code. This issue only\n affected Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2019-14904)\n \n It was discovered that Ansible did not generate sufficiently random\n values, which could lead to the exposure of passwords. An attacker\n could possibly use this issue to access sensitive information. This\n issue only affected Ubuntu 16.04 LTS and Ubuntu 18.04 LTS.\n (CVE-2020-10729)\n \n It was discovered that Ansible's svn module could disclose passwords to\n users within the same node. An attacker could possibly use this issue to\n access sensitive information. (CVE-2020-1739)\n",
  "aliases": [],
  "upstream": [],
  "related": [],
  "published": "2025-03-28T16:32:05.618284Z",
  "modified": "2025-09-16T07:48:05Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:Pro:16.04:LTS",
        "name": "ansible",
        "purl": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=source&distro=esm-apps/xenial"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.0.0.2-2ubuntu1.3+esm6"
            }
          ]
        }
      ],
      "versions": [
        "1.9.2+dfsg-2",
        "1.9.4-1",
        "2.0.0.2-2",
        "2.0.0.2-2ubuntu1",
        "2.0.0.2-2ubuntu1.1",
        "2.0.0.2-2ubuntu1.2",
        "2.0.0.2-2ubuntu1.3",
        "2.0.0.2-2ubuntu1.3+esm1",
        "2.0.0.2-2ubuntu1.3+esm2",
        "2.0.0.2-2ubuntu1.3+esm3",
        "2.0.0.2-2ubuntu1.3+esm4",
        "2.0.0.2-2ubuntu1.3+esm5"
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "binary_name": "ansible",
            "binary_version": "2.0.0.2-2ubuntu1.3+esm6"
          },
          {
            "binary_name": "ansible-fireball",
            "binary_version": "2.0.0.2-2ubuntu1.3+esm6"
          },
          {
            "binary_name": "ansible-node-fireball",
            "binary_version": "2.0.0.2-2ubuntu1.3+esm6"
          }
        ],
        "availability": "Available with Ubuntu Pro: https://ubuntu.com/pro"
      },
      "database_specific": {
        "cves_map": {
          "ecosystem": "Ubuntu:Pro:16.04:LTS",
          "cves": []
        }
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-7330-2"
    },
    {
      "type": "REPORT",
      "url": "https://launchpad.net/bugs/2104925"
    }
  ]
}