{
  "schema_version": "1.7.0",
  "id": "USN-2505-2",
  "summary": "firefox regression",
  "details": "USN-2505-1 fixed vulnerabilities in Firefox. This update removed the\ndeprecated \"-remote\" command-line switch that some older software still\ndepends on. This update fixes the problem.\n\nWe apologize for the inconvenience.\n\nOriginal advisory details:\n\n Matthew Noorenberghe discovered that allowlisted Mozilla domains could\n make UITour API calls from background tabs. If one of these domains were\n compromised and open in a background tab, an attacker could potentially\n exploit this to conduct clickjacking attacks. (CVE-2015-0819)\n \n Jan de Mooij discovered an issue that affects content using the Caja\n Compiler. If web content loads specially crafted code, this could be used\n to bypass sandboxing security measures provided by Caja. (CVE-2015-0820)\n \n Armin Razmdjou discovered that opening hyperlinks with specific mouse\n and key combinations could allow a Chrome privileged URL to be opened\n without context restrictions being preserved. If a user were tricked in to\n opening a specially crafted website, an attacker could potentially exploit\n this to bypass security restrictions. (CVE-2015-0821)\n \n Armin Razmdjou discovered that contents of locally readable files could\n be made available via manipulation of form autocomplete in some\n circumstances. If a user were tricked in to opening a specially crafted\n website, an attacker could potentially exploit this to obtain sensitive\n information. (CVE-2015-0822)\n \n Atte Kettunen discovered a use-after-free in the OpenType Sanitiser (OTS)\n in some circumstances. If a user were tricked in to opening a specially\n crafted website, an attacker could potentially exploit this to cause a\n denial of service via application crash. (CVE-2015-0823)\n \n Atte Kettunen discovered a crash when drawing images using Cairo in some\n circumstances. If a user were tricked in to opening a specially crafted\n website, an attacker could potentially exploit this to cause a denial of\n service. (CVE-2015-0824)\n \n Atte Kettunen discovered a buffer underflow during playback of MP3 files\n in some circumstances. If a user were tricked in to opening a specially\n crafted website, an attacker could potentially exploit this to obtain\n sensitive information. (CVE-2015-0825)\n \n Atte Kettunen discovered a buffer overflow during CSS restyling in some\n circumstances. If a user were tricked in to opening a specially crafted\n website, an attacker could potentially exploit this to cause a denial of\n service via application crash, or execute arbitrary code with the\n privileges of the user invoking Firefox. (CVE-2015-0826)\n \n Abhishek Arya discovered an out-of-bounds read and write when rendering\n SVG content in some circumstances. If a user were tricked in to opening\n a specially crafted website, an attacker could potentially exploit this\n to obtain sensitive information. (CVE-2015-0827)\n \n A buffer overflow was discovered in libstagefright during video playback\n in some circumstances. If a user were tricked in to opening a specially\n crafted website, an attacker could potentially exploit this to cause a\n denial of service via application crash, or execute arbitrary code with\n the privileges of the user invoking Firefox. (CVE-2015-0829)\n \n Daniele Di Proietto discovered that WebGL could cause a crash in some\n circumstances. If a user were tricked in to opening a specially crafted\n website, an attacker could potentially exploit this to cause a denial of\n service. (CVE-2015-0830)\n \n Paul Bandha discovered a use-after-free in IndexedDB. If a user were\n tricked in to opening a specially crafted website, an attacker could\n potentially exploit this to cause a denial of service via application\n crash, or execute arbitrary code with the privileges of the user invoking\n Firefox. (CVE-2015-0831)\n \n Muneaki Nishimura discovered that a period appended to a hostname could\n bypass key pinning and HSTS in some circumstances. A remote attacker could\n potentially exploit this to conduct a machine-in-the-middle (MITM) attack.\n (CVE-2015-0832)\n \n Alexander Kolesnik discovered that Firefox would attempt plaintext\n connections to servers when handling turns: and stuns: URIs. A remote\n attacker could potentially exploit this by conducting a Machine-in-the-middle\n (MITM) attack in order to obtain credentials. (CVE-2015-0834)\n  \n Carsten Book, Christoph Diehl, Gary Kwong, Jan de Mooij, Liz Henry, Byron\n Campen, Tom Schuster, Ryan VanderMeulen, Christian Holler, Jesse Ruderman,\n Randell Jesup, Robin Whittleton, Jon Coppeard, and Nikhil Marathe\n discovered multiple memory safety issues in Firefox. If a user were\n tricked in to opening a specially crafted website, an attacker could\n potentially exploit these to cause a denial of service via application\n crash, or execute arbitrary code with the privileges of the user invoking\n Firefox. (CVE-2015-0835, CVE-2015-0836)\n",
  "aliases": [],
  "upstream": [],
  "related": [],
  "published": "2015-03-09T17:43:05.914961Z",
  "modified": "2025-09-16T07:46:29Z",
  "affected": [
    {
      "package": {
        "ecosystem": "Ubuntu:14.04:LTS",
        "name": "firefox",
        "purl": "pkg:deb/ubuntu/firefox@36.0.1+build2-0ubuntu0.14.04.1?arch=source&distro=trusty"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "36.0.1+build2-0ubuntu0.14.04.1"
            }
          ]
        }
      ],
      "versions": [
        "24.0+build1-0ubuntu1",
        "25.0+build3-0ubuntu0.13.10.1",
        "28.0~b2+build1-0ubuntu2",
        "28.0+build1-0ubuntu1",
        "28.0+build2-0ubuntu1",
        "28.0+build2-0ubuntu2",
        "29.0+build1-0ubuntu0.14.04.2",
        "30.0+build1-0ubuntu0.14.04.3",
        "31.0+build1-0ubuntu0.14.04.1",
        "32.0+build1-0ubuntu0.14.04.1",
        "32.0.3+build1-0ubuntu0.14.04.1",
        "33.0+build2-0ubuntu0.14.04.1",
        "34.0+build2-0ubuntu0.14.04.1",
        "35.0+build3-0ubuntu0.14.04.2",
        "35.0.1+build1-0ubuntu0.14.04.1",
        "36.0+build2-0ubuntu0.14.04.4"
      ],
      "ecosystem_specific": {
        "binaries": [
          {
            "binary_name": "firefox",
            "binary_version": "36.0.1+build2-0ubuntu0.14.04.1"
          },
          {
            "binary_name": "firefox-dev",
            "binary_version": "36.0.1+build2-0ubuntu0.14.04.1"
          },
          {
            "binary_name": "firefox-globalmenu",
            "binary_version": "36.0.1+build2-0ubuntu0.14.04.1"
          },
          {
            "binary_name": "firefox-mozsymbols",
            "binary_version": "36.0.1+build2-0ubuntu0.14.04.1"
          },
          {
            "binary_name": "firefox-testsuite",
            "binary_version": "36.0.1+build2-0ubuntu0.14.04.1"
          }
        ],
        "availability": "No subscription required"
      },
      "database_specific": {
        "cves_map": {
          "ecosystem": "Ubuntu:14.04:LTS",
          "cves": []
        }
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://ubuntu.com/security/notices/USN-2505-2"
    },
    {
      "type": "REPORT",
      "url": "https://launchpad.net/bugs/1425972"
    },
    {
      "type": "REPORT",
      "url": "https://launchpad.net/bugs/1429115"
    }
  ]
}