{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6639-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.120130",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6639-1",
                "name": "USN-6639-1",
                "description": "It was discovered that a race condition existed in the ATM (Asynchronous Transfer Mode) subsystem of the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-51780)  It was discovered that a race condition existed in the AppleTalk networking subsystem of the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-51781)  It was discovered that a race condition existed in the Rose X.25 protocol implementation in the Linux kernel, leading to a use-after- free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-51782)  Alon Zahavi discovered that the NVMe-oF/TCP subsystem of the Linux kernel did not properly handle connect command payloads in certain situations, leading to an out-of-bounds read vulnerability. A remote attacker could use this to expose sensitive information (kernel memory). (CVE-2023-6121)  Jann Horn discovered that a race condition existed in the Linux kernel when handling io_uring over sockets, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6531)  Xingyuan Mo discovered that the netfilter subsystem in the Linux kernel did not properly handle dynset expressions passed from userspace, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-6622)  It was discovered that the IGMP protocol implementation in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6932)  Robert Morris discovered that the CIFS network file system implementation in the Linux kernel did not properly validate certain server commands fields, leading to an out-of-bounds read vulnerability. An attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2024-0565)  Dan Carpenter discovered that the netfilter subsystem in the Linux kernel did not store data in properly sized memory locations. A local user could use this to cause a denial of service (system crash). (CVE-2024-0607)  Jann Horn discovered that the TLS subsystem in the Linux kernel did not properly handle spliced messages, leading to an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2024-0646)  Yang Chaoming discovered that the KSMBD implementation in the Linux kernel did not properly validate request buffer sizes, leading to an out-of-bounds read vulnerability. An attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2024-22705)",
                "aliases": [
                    "CVE-2023-6121",
                    "CVE-2023-6531",
                    "CVE-2023-6622",
                    "CVE-2023-6932",
                    "CVE-2023-51780",
                    "CVE-2023-51781",
                    "CVE-2023-51782",
                    "CVE-2024-0565",
                    "CVE-2024-0607",
                    "CVE-2024-0646",
                    "CVE-2024-22705"
                ]
            },
            "timestamp": "2024-02-15 04:33:26.327786",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1@6.1.0-1033.33?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.1.0-1033-oem-dbgsym@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-ipu6-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-ivsc-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1033@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1033@6.1.0-1033.33?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1033@6.1.0-1033.33?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1033@6.1.0-1033.33?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1033@6.1.0-1033.33?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1033@6.1.0-1033.33?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1033@6.1.0-1033.33?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-6.1.0-1033@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1033.33?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1033.33?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1033.33?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1033.33?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1033.33?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1033.33?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1033.33?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-6.1.0-1033-oem@6.1.0-1033.33?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}