{
  "metadata": {
    "@context": "https://openvex.dev/ns/v0.2.0",
    "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6385-1",
    "author": "Canonical Ltd.",
    "timestamp": "2025-07-16T05:54:25.936181",
    "version": 3
  },
  "statements": [
    {
      "vulnerability": {
        "@id": "https://ubuntu.com/security/notices/USN-6385-1",
        "name": "USN-6385-1",
        "description": "It was discovered that some AMD x86-64 processors with SMT enabled could speculatively execute instructions using a return address from a sibling thread. A local attacker could possibly use this to expose sensitive information. (CVE-2022-27672)  William Zhao discovered that the Traffic Control (TC) subsystem in the Linux kernel did not properly handle network packet retransmission in certain situations. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2022-4269)  Jordy Zomer and Alexandra Sandulescu discovered that syscalls invoking the do_prlimit() function in the Linux kernel did not properly handle speculative execution barriers. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-0458)  It was discovered that the TLS subsystem in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1075)  It was discovered that the TUN/TAP driver in the Linux kernel did not properly initialize socket data. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-1076, CVE-2023-4194)  It was discovered that the IPv6 implementation in the Linux kernel contained a high rate of hash collisions in connection lookup table. A remote attacker could use this to cause a denial of service (excessive CPU consumption). (CVE-2023-1206)  It was discovered that the Broadcom FullMAC USB WiFi driver in the Linux kernel did not properly perform data buffer size validation in some situations. A physically proximate attacker could use this to craft a malicious USB device that when inserted, could cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1380)  It was discovered that a race condition existed in the btrfs file system implementation in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1611)  Ruihan Li discovered that the bluetooth subsystem in the Linux kernel did not properly perform permissions checks when handling HCI sockets. A physically proximate attacker could use this to cause a denial of service (bluetooth communication). (CVE-2023-2002)  Tavis Ormandy discovered that some AMD processors did not properly handle speculative execution of certain vector register instructions. A local attacker could use this to expose sensitive information. (CVE-2023-20593)  It was discovered that a use-after-free vulnerability existed in the iSCSI TCP implementation in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-2162)  Juan Jose Lopez Jaimez, Meador Inge, Simon Scannell, and Nenad Stojanovski discovered that the BPF verifier in the Linux kernel did not properly mark registers for precision tracking in certain situations, leading to an out- of-bounds access vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-2163)  It was discovered that the perf subsystem in the Linux kernel contained a use-after-free vulnerability. A privileged local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-2235)  Zheng Zhang discovered that the device-mapper implementation in the Linux kernel did not properly handle locking during table_clear() operations. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2023-2269)  Wei Chen discovered that the DVB USB AZ6027 driver in the Linux kernel contained a null pointer dereference when handling certain messages from user space. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-28328)  It was discovered that a race condition existed in the TLS subsystem in the Linux kernel, leading to a use-after-free or a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-28466)  It was discovered that a race condition existed in the f2fs file system in the Linux kernel, leading to a null pointer dereference vulnerability. An attacker could use this to construct a malicious f2fs image that, when mounted and operated on, could cause a denial of service (system crash). (CVE-2023-2898)  It was discovered that the IP-VLAN network driver for the Linux kernel did not properly initialize memory in some situations, leading to an out-of- bounds write vulnerability. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3090)  It was discovered that the Ricoh R5C592 MemoryStick card reader driver in the Linux kernel contained a race condition during module unload, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3141)  Gwangun Jung discovered that the Quick Fair Queueing scheduler implementation in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-31436)  It was discovered that the Qualcomm MSM DPU driver in the Linux kernel did not properly validate memory allocations in certain situations, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-3220)  It was discovered that the NET/ROM protocol implementation in the Linux kernel contained a race condition in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-32269)  It was discovered that the netfilter subsystem in the Linux kernel did not properly handle some error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3390)  It was discovered that the universal 32bit network packet classifier implementation in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3609)  It was discovered that the netfilter subsystem in the Linux kernel did not properly handle certain error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3610)  It was discovered that the Quick Fair Queueing network scheduler implementation in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3611)  It was discovered that the network packet classifier with netfilter/firewall marks implementation in the Linux kernel did not properly handle reference counting, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3776)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle table rules flush in certain circumstances. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-3777)  It was discovered that the NFC implementation in the Linux kernel contained a use-after-free vulnerability when performing peer-to-peer communication in certain conditions. A privileged attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2023-3863)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle rule additions to bound chains in certain circumstances. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-3995)  It was discovered that the netfilter subsystem in the Linux kernel did not properly handle PIPAPO element removal, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-4004)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle bound chain deactivation in certain circumstances. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-4015)  It was discovered that the bluetooth subsystem in the Linux kernel did not properly handle L2CAP socket release, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-40283)  It was discovered that some network classifier implementations in the Linux kernel contained use-after-free vulnerabilities. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4128)  Maxim Suhanov discovered that the exFAT file system implementation in the Linux kernel did not properly check a file name length, leading to an out- of-bounds write vulnerability. An attacker could use this to construct a malicious exFAT image that, when mounted and operated on, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4273)  Lonial Con discovered that the netfilter subsystem in the Linux kernel contained a memory leak when handling certain element flush operations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-4569)",
        "aliases": [
          "CVE-2022-4269",
          "CVE-2022-27672",
          "CVE-2023-0458",
          "CVE-2023-1075",
          "CVE-2023-1076",
          "CVE-2023-1206",
          "CVE-2023-1380",
          "CVE-2023-1611",
          "CVE-2023-2002",
          "CVE-2023-2162",
          "CVE-2023-2163",
          "CVE-2023-2235",
          "CVE-2023-2269",
          "CVE-2023-2898",
          "CVE-2023-3090",
          "CVE-2023-3141",
          "CVE-2023-3220",
          "CVE-2023-3390",
          "CVE-2023-3609",
          "CVE-2023-3610",
          "CVE-2023-3611",
          "CVE-2023-3776",
          "CVE-2023-3777",
          "CVE-2023-3863",
          "CVE-2023-3995",
          "CVE-2023-4004",
          "CVE-2023-4015",
          "CVE-2023-4128",
          "CVE-2023-4194",
          "CVE-2023-4273",
          "CVE-2023-4569",
          "CVE-2023-20593",
          "CVE-2023-28328",
          "CVE-2023-28466",
          "CVE-2023-31436",
          "CVE-2023-32269",
          "CVE-2023-40283"
        ]
      },
      "timestamp": "2023-09-19 17:44:43.163923",
      "products": [
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0@6.0.0-1021.21?arch=source&distro=jammy"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-buildinfo-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-headers-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.0.0-1021-oem-dbgsym@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-modules-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-modules-ipu6-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-modules-ivsc-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-headers-6.0.0-1021@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-headers-6.0.0-1021@6.0.0-1021.21?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-headers-6.0.0-1021@6.0.0-1021.21?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-headers-6.0.0-1021@6.0.0-1021.21?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-headers-6.0.0-1021@6.0.0-1021.21?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-headers-6.0.0-1021@6.0.0-1021.21?arch=riscv64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-headers-6.0.0-1021@6.0.0-1021.21?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-6.0.0-1021@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-host@6.0.0-1021.21?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-host@6.0.0-1021.21?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-host@6.0.0-1021.21?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-host@6.0.0-1021.21?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-host@6.0.0-1021.21?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-host@6.0.0-1021.21?arch=riscv64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-oem-6.0-tools-host@6.0.0-1021.21?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-tools-6.0.0-1021-oem@6.0.0-1021.21?arch=amd64"
        }
      ],
      "status": "fixed",
      "status_notes": "Several security issues were fixed in the Linux kernel."
    }
  ]
}