{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6093-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:42.115427",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6093-1",
                "name": "USN-6093-1",
                "description": "It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel did not properly perform filter deactivation in some situations. A local attacker could possibly use this to gain elevated privileges. Please note that with the fix for this CVE, kernel support for the TCINDEX classifier has been removed. (CVE-2023-1829)  It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1281)  Jiasheng Jiang discovered that the HSA Linux kernel driver for AMD Radeon GPU devices did not properly validate memory allocation in certain situations, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3108)  It was discovered that the infrared transceiver USB driver did not properly handle USB control messages. A local attacker with physical access could plug in a specially crafted USB device to cause a denial of service (memory exhaustion). (CVE-2022-3903)  Haowei Yan discovered that a race condition existed in the Layer 2 Tunneling Protocol (L2TP) implementation in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-4129)  Jordy Zomer and Alexandra Sandulescu discovered that syscalls invoking the do_prlimit() function in the Linux kernel did not properly handle speculative execution barriers. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-0458)  It was discovered that the Human Interface Device (HID) support driver in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-1073)  It was discovered that a memory leak existed in the SCTP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2023-1074)  Lianhui Tang discovered that the MPLS implementation in the Linux kernel did not properly handle certain sysctl allocation failure conditions, leading to a double-free vulnerability. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-26545)",
                "aliases": [
                    "CVE-2022-3108",
                    "CVE-2022-3903",
                    "CVE-2022-4129",
                    "CVE-2023-0458",
                    "CVE-2023-1073",
                    "CVE-2023-1074",
                    "CVE-2023-1281",
                    "CVE-2023-1829",
                    "CVE-2023-26545"
                ]
            },
            "timestamp": "2023-05-22 13:29:37.746042",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield@5.4.0-1062.68?arch=source&distro=focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1062@5.4.0-1062.68?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1062@5.4.0-1062.68?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1062@5.4.0-1062.68?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1062@5.4.0-1062.68?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1062@5.4.0-1062.68?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1062@5.4.0-1062.68?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1062@5.4.0-1062.68?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-tools-5.4.0-1062@5.4.0-1062.68?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1062-bluefield@5.4.0-1062.68?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1062-bluefield@5.4.0-1062.68?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1062-bluefield@5.4.0-1062.68?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1062-bluefield-dbgsym@5.4.0-1062.68?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1062-bluefield@5.4.0-1062.68?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1062-bluefield@5.4.0-1062.68?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}