{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4536-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:39.600073",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4536-1",
                "name": "USN-4536-1",
                "description": "Youssouf Boulouiz discovered that SPIP incorrectly handled login error messages. A remote attacker could potentially exploit this to conduct cross-site scripting (XSS) attacks. (CVE-2019-16392)  Gilles Vincent discovered that SPIP incorrectly handled password reset requests. A remote attacker could possibly use this issue to cause SPIP to enumerate registered users. (CVE-2019-16394)  Guillaume Fahrner discovered that SPIP did not properly sanitize input. A remote authenticated attacker could possibly use this issue to execute arbitrary code on the host server. (CVE-2019-11071)  Sylvain Lefevre discovered that SPIP incorrectly handled user authorization. A remote attacker could possibly use this issue to modify and publish content and modify the database. (CVE-2019-16391)  It was discovered that SPIP did not properly sanitize input. A remote attacker could, through cross-site scripting (XSS) and PHP injection, exploit this to inject arbitrary web script or HTML. (CVE-2017-15736)  Alexis Zucca discovered that SPIP incorrectly handled the media plugin. A remote authenticated attacker could possibly use this issue to write to the database. (CVE-2019-19830)  Christophe Laffont discovered that SPIP incorrectly handled redirect URLs. An attacker could use this issue to cause SPIP to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2019-16393)",
                "aliases": [
                    "CVE-2017-15736",
                    "CVE-2019-11071",
                    "CVE-2019-16391",
                    "CVE-2019-16392",
                    "CVE-2019-16393",
                    "CVE-2019-16394",
                    "CVE-2019-19830"
                ]
            },
            "timestamp": "2020-09-24 16:01:23.297550",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/spip@3.1.4-4~deb9u3build0.18.04.1?arch=source&distro=bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/spip@3.1.4-4~deb9u3build0.18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/spip@3.1.4-4~deb9u3build0.18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/spip@3.1.4-4~deb9u3build0.18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/spip@3.1.4-4~deb9u3build0.18.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/spip@3.1.4-4~deb9u3build0.18.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/spip@3.1.4-4~deb9u3build0.18.04.1?arch=s390x"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in SPIP."
        }
    ]
}