{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2570-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:28.513876",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2570-1",
                "name": "USN-2570-1",
                "description": "An issue was discovered in the HTML parser in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to bypass same-origin restrictions. (CVE-2015-1235)  An issue was discovered in the Web Audio API implementation in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to bypass same-origin restrictions. (CVE-2015-1236)  A use-after-free was discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1237)  An out-of-bounds write was discovered in Skia. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1238)  An out-of-bounds read was discovered in the WebGL implementation. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash. (CVE-2015-1240)  An issue was discovered with the interaction of page navigation and touch event handling. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to conduct \"tap jacking\" attacks. (CVE-2015-1241)  A type confusion bug was discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1242)  It was discovered that websocket connections were not upgraded whenever a HSTS policy is active. A remote attacker could potentially exploit this to conduct a machine-in-the-middle (MITM) attack. (CVE-2015-1244)  An out-of-bounds read was discovered in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash. (CVE-2015-1246)  Multiple security issues were discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1249)  A use-after-free was discovered in the file picker implementation. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1321)  Multiple security issues were discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-3333)",
                "aliases": [
                    "CVE-2015-1235",
                    "CVE-2015-1236",
                    "CVE-2015-1237",
                    "CVE-2015-1238",
                    "CVE-2015-1240",
                    "CVE-2015-1241",
                    "CVE-2015-1242",
                    "CVE-2015-1244",
                    "CVE-2015-1246",
                    "CVE-2015-1249",
                    "CVE-2015-1321",
                    "CVE-2015-3333"
                ]
            },
            "timestamp": "2015-04-27 18:13:50.523430",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/oxide-qt@1.6.5-0ubuntu0.14.04.1?arch=src?distro=ubuntu/trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.6.5-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.6.5-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.6.5-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.6.5-0ubuntu0.14.04.1?arch=i386"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in Oxide."
        }
    ]
}