{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4385-2",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:26.410725",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4385-2",
                "name": "USN-4385-2",
                "description": "USN-4385-1 provided updated Intel Processor Microcode. Unfortunately, that update prevented certain processors in the Intel Skylake family (06_4EH) from booting successfully. Additonally, on Ubuntu 20.04 LTS, late loading of microcode was enabled, which could lead to system instability. This update reverts the microcode update for the Skylake processor family and disables the late loading option on Ubuntu 20.04 LTS.  Please note that the 'dis_ucode_ldr' kernel command line option can be added in the boot menu to disable microcode loading for system recovery.  We apologize for the inconvenience.  Original advisory details:   It was discovered that memory contents previously stored in  microarchitectural special registers after RDRAND, RDSEED, and SGX EGETKEY  read operations on Intel client and Xeon E3 processors may be briefly  exposed to processes on the same or different processor cores. A local  attacker could use this to expose sensitive information. (CVE-2020-0543)   It was discovered that on some Intel processors, partial data values  previously read from a vector register on a physical core may be propagated  into unused portions of the store buffer. A local attacker could possible  use this to expose sensitive information. (CVE-2020-0548)   It was discovered that on some Intel processors, data from the most  recently evicted modified L1 data cache (L1D) line may be propagated into  an unused (invalid) L1D fill buffer. A local attacker could possibly use  this to expose sensitive information. (CVE-2020-0549)",
                "aliases": []
            },
            "timestamp": "2020-06-10 23:50:51.007014",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.14.04.1?arch=src?distro=esm/trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.16.04.1?arch=src?distro=ubuntu/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.16.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.18.04.1?arch=src?distro=ubuntu/bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.18.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.20.04.2?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/intel-microcode@3.20200609.0ubuntu0.20.04.2?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "USN-4385-1 introduced a regression in the Intel Microcode for some processors."
        }
    ]
}