{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2521-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:36.375317",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2521-1",
                "name": "USN-2521-1",
                "description": "Several out-of-bounds write bugs were discovered in Skia. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1213, CVE-2015-1214, CVE-2015-1215)  A use-after-free was discovered in the V8 bindings in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1216)  Multiple type confusion bugs were discovered in the V8 bindings in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1217, CVE-2015-1230)  Multiple use-after-free bugs were discovered in the DOM implementation in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1218, CVE-2015-1223)  An integer overflow was discovered in Skia. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1219)  A use-after-free was discovered in the GIF image decoder in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1220)  A use-after-free was discovered in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1221)  Multiple use-after-free bugs were discovered in the service worker implementation in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1222)  An out-of-bounds read was discovered in the VPX decoder implementation in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash. (CVE-2015-1224)  It was discovered that Blink did not initialize memory for image drawing in some circumstances. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to read uninitialized memory. (CVE-2015-1227)  It was discovered that Blink did not initialize memory for a data structure in some circumstances. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1228)  It was discovered that a web proxy returning a 407 response could inject cookies in to the originally requested domain. If a user connected to a malicious web proxy, an attacker could potentially exploit this to conduct session-fixation attacks. (CVE-2015-1229)  Multiple security issues were discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1231)  Multiple security issues were discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-2238)",
                "aliases": [
                    "CVE-2015-1213",
                    "CVE-2015-1214",
                    "CVE-2015-1215",
                    "CVE-2015-1216",
                    "CVE-2015-1217",
                    "CVE-2015-1218",
                    "CVE-2015-1219",
                    "CVE-2015-1220",
                    "CVE-2015-1221",
                    "CVE-2015-1222",
                    "CVE-2015-1223",
                    "CVE-2015-1224",
                    "CVE-2015-1227",
                    "CVE-2015-1228",
                    "CVE-2015-1229",
                    "CVE-2015-1230",
                    "CVE-2015-1231",
                    "CVE-2015-2238"
                ]
            },
            "timestamp": "2015-03-10 15:28:14.926912",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/oxide-qt@1.5.5-0ubuntu0.14.04.3?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.5.5-0ubuntu0.14.04.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.5.5-0ubuntu0.14.04.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.5.5-0ubuntu0.14.04.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.5.5-0ubuntu0.14.04.3?arch=i386"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in Oxide."
        }
    ]
}