{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5000-2",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:25.863630",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5000-2",
                "name": "USN-5000-2",
                "description": "USN-5000-1 fixed vulnerabilities in the Linux kernel for Ubuntu 20.04 LTS and the Linux HWE kernel for Ubuntu 18.04 LTS. This update provides the corresponding updates for the Linux KVM kernel for Ubuntu 20.04 LTS.  Norbert Slusarek discovered a race condition in the CAN BCM networking protocol of the Linux kernel leading to multiple use-after-free vulnerabilities. A local attacker could use this issue to execute arbitrary code. (CVE-2021-3609)  Piotr Krysiuk discovered that the eBPF implementation in the Linux kernel did not properly enforce limits for pointer operations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-33200)  Mathy Vanhoef discovered that the Linux kernel’s WiFi implementation did not properly clear received fragments from memory in some situations. A physically proximate attacker could possibly use this issue to inject packets or expose sensitive information. (CVE-2020-24586)  Mathy Vanhoef discovered that the Linux kernel’s WiFi implementation incorrectly handled encrypted fragments. A physically proximate attacker could possibly use this issue to decrypt fragments. (CVE-2020-24587)  Mathy Vanhoef discovered that the Linux kernel’s WiFi implementation incorrectly handled certain malformed frames. If a user were tricked into connecting to a malicious server, a physically proximate attacker could use this issue to inject packets. (CVE-2020-24588)  Mathy Vanhoef discovered that the Linux kernel’s WiFi implementation incorrectly handled EAPOL frames from unauthenticated senders. A physically proximate attacker could inject malicious packets to cause a denial of service (system crash). (CVE-2020-26139)  Mathy Vanhoef discovered that the Linux kernel’s WiFi implementation did not properly verify certain fragmented frames. A physically proximate attacker could possibly use this issue to inject or decrypt packets. (CVE-2020-26141)  Mathy Vanhoef discovered that the Linux kernel’s WiFi implementation accepted plaintext fragments in certain situations. A physically proximate attacker could use this issue to inject packets. (CVE-2020-26145)  Mathy Vanhoef discovered that the Linux kernel’s WiFi implementation could reassemble mixed encrypted and plaintext fragments. A physically proximate attacker could possibly use this issue to inject packets or exfiltrate selected fragments. (CVE-2020-26147)  Or Cohen discovered that the SCTP implementation in the Linux kernel contained a race condition in some situations, leading to a use-after-free condition. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-23133)  Or Cohen and Nadav Markus discovered a use-after-free vulnerability in the nfc implementation in the Linux kernel. A privileged local attacker could use this issue to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-23134)  Piotr Krysiuk discovered that the eBPF implementation in the Linux kernel did not properly prevent speculative loads in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2021-31829)  It was discovered that a race condition in the kernel Bluetooth subsystem could lead to use-after-free of slab objects. An attacker could use this issue to possibly execute arbitrary code. (CVE-2021-32399)  It was discovered that a use-after-free existed in the Bluetooth HCI driver of the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-33034)  It was discovered that an out-of-bounds (OOB) memory access flaw existed in the f2fs module of the Linux kernel. A local attacker could use this issue to cause a denial of service (system crash). (CVE-2021-3506)",
                "aliases": [
                    "CVE-2020-24586",
                    "CVE-2020-24587",
                    "CVE-2020-24588",
                    "CVE-2020-26139",
                    "CVE-2020-26141",
                    "CVE-2020-26145",
                    "CVE-2020-26147",
                    "CVE-2021-3506",
                    "CVE-2021-3609",
                    "CVE-2021-23133",
                    "CVE-2021-23134",
                    "CVE-2021-31829",
                    "CVE-2021-32399",
                    "CVE-2021-33034"
                ]
            },
            "timestamp": "2021-06-25 21:56:40.181074",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm@5.4.0-1041.42?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1041-kvm@5.4.0-1041.42?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1041-kvm@5.4.0-1041.42?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1041-kvm@5.4.0-1041.42?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1041-kvm-dbgsym@5.4.0-1041.42?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-headers-5.4.0-1041@5.4.0-1041.42?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-headers-5.4.0-1041@5.4.0-1041.42?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-headers-5.4.0-1041@5.4.0-1041.42?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-headers-5.4.0-1041@5.4.0-1041.42?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-headers-5.4.0-1041@5.4.0-1041.42?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-headers-5.4.0-1041@5.4.0-1041.42?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-headers-5.4.0-1041@5.4.0-1041.42?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-kvm-tools-5.4.0-1041@5.4.0-1041.42?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1041-kvm@5.4.0-1041.42?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1041-kvm@5.4.0-1041.42?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}