{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5377-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:40.910617",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5377-1",
                "name": "USN-5377-1",
                "description": "It was discovered that the network traffic control implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1055)  Yiqi Sun and Kevin Wang discovered that the cgroups implementation in the Linux kernel did not properly restrict access to the cgroups v1 release_agent feature. A local attacker could use this to gain administrative privileges. (CVE-2022-0492)  Jürgen Groß discovered that the Xen subsystem within the Linux kernel did not adequately limit the number of events driver domains (unprivileged PV backends) could send to other guest VMs. An attacker in a driver domain could use this to cause a denial of service in other guest VMs. (CVE-2021-28711, CVE-2021-28712, CVE-2021-28713)  Jürgen Groß discovered that the Xen network backend driver in the Linux kernel did not adequately limit the amount of queued packets when a guest did not process them. An attacker in a guest VM can use this to cause a denial of service (excessive kernel memory consumption) in the network backend domain. (CVE-2021-28714, CVE-2021-28715)  It was discovered that the simulated networking device driver for the Linux kernel did not properly initialize memory in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2021-4135)  Brendan Dolan-Gavitt discovered that the Marvell WiFi-Ex USB device driver in the Linux kernel did not properly handle some error conditions. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2021-43976)  It was discovered that the ARM Trusted Execution Environment (TEE) subsystem in the Linux kernel contained a race condition leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2021-44733)  It was discovered that the Phone Network protocol (PhoNet) implementation in the Linux kernel did not properly perform reference counting in some error conditions. A local attacker could possibly use this to cause a denial of service (memory exhaustion). (CVE-2021-45095)  Wenqing Liu discovered that the f2fs file system in the Linux kernel did not properly validate the last xattr entry in an inode. An attacker could use this to construct a malicious f2fs image that, when mounted and operated on, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-45469)  It was discovered that the Reliable Datagram Sockets (RDS) protocol implementation in the Linux kernel did not properly deallocate memory in some error conditions. A local attacker could possibly use this to cause a denial of service (memory exhaustion). (CVE-2021-45480)  Samuel Page discovered that the Transparent Inter-Process Communication (TIPC) protocol implementation in the Linux kernel contained a stack-based buffer overflow. A remote attacker could use this to cause a denial of service (system crash) for systems that have a TIPC bearer configured. (CVE-2022-0435)  It was discovered that the IPsec implementation in the Linux kernel did not properly allocate enough memory when performing ESP transformations, leading to a heap-based buffer overflow. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-27666)",
                "aliases": [
                    "CVE-2021-4135",
                    "CVE-2021-28711",
                    "CVE-2021-28712",
                    "CVE-2021-28713",
                    "CVE-2021-28714",
                    "CVE-2021-28715",
                    "CVE-2021-43976",
                    "CVE-2021-44733",
                    "CVE-2021-45095",
                    "CVE-2021-45469",
                    "CVE-2021-45480",
                    "CVE-2022-0435",
                    "CVE-2022-0492",
                    "CVE-2022-1055",
                    "CVE-2022-27666"
                ]
            },
            "timestamp": "2022-04-13 02:49:23.925710",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield@5.4.0-1032.35?arch=source&distro=focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1032@5.4.0-1032.35?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1032@5.4.0-1032.35?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1032@5.4.0-1032.35?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1032@5.4.0-1032.35?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1032@5.4.0-1032.35?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1032@5.4.0-1032.35?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1032@5.4.0-1032.35?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-tools-5.4.0-1032@5.4.0-1032.35?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1032-bluefield@5.4.0-1032.35?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1032-bluefield@5.4.0-1032.35?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1032-bluefield@5.4.0-1032.35?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1032-bluefield-dbgsym@5.4.0-1032.35?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1032-bluefield@5.4.0-1032.35?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1032-bluefield@5.4.0-1032.35?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}