{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4118-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:38.833928",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4118-1",
                "name": "USN-4118-1",
                "description": "It was discovered that the alarmtimer implementation in the Linux kernel contained an integer overflow vulnerability. A local attacker could use this to cause a denial of service. (CVE-2018-13053)  Wen Xu discovered that the XFS filesystem implementation in the Linux kernel did not properly track inode validations. An attacker could use this to construct a malicious XFS image that, when mounted, could cause a denial of service (system crash). (CVE-2018-13093)  Wen Xu discovered that the f2fs file system implementation in the Linux kernel did not properly validate metadata. An attacker could use this to construct a malicious f2fs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-13096, CVE-2018-13097, CVE-2018-13098, CVE-2018-13099, CVE-2018-13100, CVE-2018-14614, CVE-2018-14615, CVE-2018-14616)  Wen Xu and Po-Ning Tseng discovered that btrfs file system implementation in the Linux kernel did not properly validate metadata. An attacker could use this to construct a malicious btrfs image that, when mounted, could cause a denial of service (system crash). (CVE-2018-14609, CVE-2018-14610, CVE-2018-14611, CVE-2018-14612, CVE-2018-14613)  Wen Xu discovered that the HFS+ filesystem implementation in the Linux kernel did not properly handle malformed catalog data in some situations. An attacker could use this to construct a malicious HFS+ image that, when mounted, could cause a denial of service (system crash). (CVE-2018-14617)  Vasily Averin and Pavel Tikhomirov discovered that the cleancache subsystem of the Linux kernel did not properly initialize new files in some situations. A local attacker could use this to expose sensitive information. (CVE-2018-16862)  Hui Peng and Mathias Payer discovered that the Option USB High Speed driver in the Linux kernel did not properly validate metadata received from the device. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2018-19985)  Hui Peng and Mathias Payer discovered that the USB subsystem in the Linux kernel did not properly handle size checks when handling an extra USB descriptor. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2018-20169)  Zhipeng Xie discovered that an infinite loop could be triggered in the CFS Linux kernel process scheduler. A local attacker could possibly use this to cause a denial of service. (CVE-2018-20784)  It was discovered that a use-after-free error existed in the block layer subsystem of the Linux kernel when certain failure conditions occurred. A local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-20856)  Eli Biham and Lior Neumann discovered that the Bluetooth implementation in the Linux kernel did not properly validate elliptic curve parameters during Diffie-Hellman key exchange in some situations. An attacker could use this to expose sensitive information. (CVE-2018-5383)  It was discovered that the Intel Wi-Fi device driver in the Linux kernel did not properly validate certain Tunneled Direct Link Setup (TDLS). A physically proximate attacker could use this to cause a denial of service (Wi-Fi disconnect). (CVE-2019-0136)  It was discovered that a heap buffer overflow existed in the Marvell Wireless LAN device driver for the Linux kernel. An attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-10126)  It was discovered that the Bluetooth UART implementation in the Linux kernel did not properly check for missing tty operations. A local attacker could use this to cause a denial of service. (CVE-2019-10207)  Amit Klein and Benny Pinkas discovered that the Linux kernel did not sufficiently randomize IP ID values generated for connectionless networking protocols. A remote attacker could use this to track particular Linux devices. (CVE-2019-10638)  Amit Klein and Benny Pinkas discovered that the location of kernel addresses could be exposed by the implementation of connection-less network protocols in the Linux kernel. A remote attacker could possibly use this to assist in the exploitation of another vulnerability in the Linux kernel. (CVE-2019-10639)  Adam Zabrocki discovered that the Intel i915 kernel mode graphics driver in the Linux kernel did not properly restrict mmap() ranges in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-11085)  It was discovered that an integer overflow existed in the Linux kernel when reference counting pages, leading to potential use-after-free issues. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-11487)  Jann Horn discovered that a race condition existed in the Linux kernel when performing core dumps. A local attacker could use this to cause a denial of service (system crash) or expose sensitive information. (CVE-2019-11599)  It was discovered that a null pointer dereference vulnerability existed in the LSI Logic MegaRAID driver in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2019-11810)  It was discovered that a race condition leading to a use-after-free existed in the Reliable Datagram Sockets (RDS) protocol implementation in the Linux kernel. The RDS protocol is disabled via blocklist by default in Ubuntu.  If enabled, a local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-11815)  It was discovered that the ext4 file system implementation in the Linux kernel did not properly zero out memory in some situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2019-11833)  It was discovered that the Bluetooth Human Interface Device Protocol (HIDP) implementation in the Linux kernel did not properly verify strings were NULL terminated in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2019-11884)  It was discovered that a NULL pointer dereference vulnerabilty existed in the Near-field communication (NFC) implementation in the Linux kernel. An attacker could use this to cause a denial of service (system crash). (CVE-2019-12818)  It was discovered that the MDIO bus devices subsystem in the Linux kernel improperly dropped a device reference in an error condition, leading to a use-after-free. An attacker could use this to cause a denial of service (system crash). (CVE-2019-12819)  It was discovered that a NULL pointer dereference vulnerability existed in the Near-field communication (NFC) implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2019-12984)  Jann Horn discovered a use-after-free vulnerability in the Linux kernel when accessing LDT entries in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-13233)  Jann Horn discovered that the ptrace implementation in the Linux kernel did not properly record credentials in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly gain administrative privileges. (CVE-2019-13272)  It was discovered that the GTCO tablet input driver in the Linux kernel did not properly bounds check the initial HID report sent by the device. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-13631)  It was discovered that the floppy driver in the Linux kernel did not properly validate meta data, leading to a buffer overread. A local attacker could use this to cause a denial of service (system crash). (CVE-2019-14283)  It was discovered that the floppy driver in the Linux kernel did not properly validate ioctl() calls, leading to a division-by-zero. A local attacker could use this to cause a denial of service (system crash). (CVE-2019-14284)  Tuba Yavuz discovered that a race condition existed in the DesignWare USB3 DRD Controller device driver in the Linux kernel. A physically proximate attacker could use this to cause a denial of service. (CVE-2019-14763)  It was discovered that an out-of-bounds read existed in the QLogic QEDI iSCSI Initiator Driver in the Linux kernel. A local attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2019-15090)  It was discovered that the Raremono AM/FM/SW radio device driver in the Linux kernel did not properly allocate memory, leading to a use-after-free. A physically proximate attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2019-15211)  It was discovered at a double-free error existed in the USB Rio 500 device driver for the Linux kernel. A physically proximate attacker could use this to cause a denial of service. (CVE-2019-15212)  It was discovered that a race condition existed in the Advanced Linux Sound Architecture (ALSA) subsystem of the Linux kernel, leading to a potential use-after-free. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-15214)  It was discovered that a race condition existed in the CPiA2 video4linux device driver for the Linux kernel, leading to a use-after-free. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-15215)  It was discovered that a race condition existed in the Softmac USB Prism54 device driver in the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2019-15220)  It was discovered that a use-after-free vulnerability existed in the AppleTalk implementation in the Linux kernel if an error occurs during initialization. A local attacker could use this to cause a denial of service (system crash). (CVE-2019-15292)  It was discovered that the Empia EM28xx DVB USB device driver implementation in the Linux kernel contained a use-after-free vulnerability when disconnecting the device. An attacker could use this to cause a denial of service (system crash). (CVE-2019-2024)  It was discovered that the USB video device class implementation in the Linux kernel did not properly validate control bits, resulting in an out of bounds buffer read. A local attacker could use this to possibly expose sensitive information (kernel memory). (CVE-2019-2101)  It was discovered that the Marvell Wireless LAN device driver in the Linux kernel did not properly validate the BSS descriptor. A local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-3846)  Jason Wang discovered that an infinite loop vulnerability existed in the virtio net driver in the Linux kernel. A local attacker in a guest VM could possibly use this to cause a denial of service in the host system. (CVE-2019-3900)  Daniele Antonioli, Nils Ole Tippenhauer, and Kasper B. Rasmussen discovered that the Bluetooth protocol BR/EDR specification did not properly require sufficiently strong encryption key lengths. A physically proximate attacker could use this to expose sensitive information. (CVE-2019-9506)  It was discovered that the Appletalk IP encapsulation driver in the Linux kernel did not properly prevent kernel addresses from being copied to user space. A local attacker with the CAP_NET_ADMIN capability could use this to expose sensitive information. (CVE-2018-20511)  It was discovered that a race condition existed in the USB YUREX device driver in the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2019-15216)  It was discovered that the Siano USB MDTV receiver device driver in the Linux kernel made improper assumptions about the device characteristics. A physically proximate attacker could use this cause a denial of service (system crash). (CVE-2019-15218)  It was discovered that the Line 6 POD USB device driver in the Linux kernel did not properly validate data size information from the device. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2019-15221)  Muyu Yu discovered that the CAN implementation in the Linux kernel in some situations did not properly restrict the field size when processing outgoing frames. A local attacker with CAP_NET_ADMIN privileges could use this to execute arbitrary code. (CVE-2019-3701)  Vladis Dronov discovered that the debug interface for the Linux kernel's HID subsystem did not properly validate passed parameters in some situations. A local privileged attacker could use this to cause a denial of service (infinite loop). (CVE-2019-3819)",
                "aliases": [
                    "CVE-2018-5383",
                    "CVE-2018-13053",
                    "CVE-2018-13093",
                    "CVE-2018-13096",
                    "CVE-2018-13097",
                    "CVE-2018-13098",
                    "CVE-2018-13099",
                    "CVE-2018-13100",
                    "CVE-2018-14609",
                    "CVE-2018-14610",
                    "CVE-2018-14611",
                    "CVE-2018-14612",
                    "CVE-2018-14613",
                    "CVE-2018-14614",
                    "CVE-2018-14615",
                    "CVE-2018-14616",
                    "CVE-2018-14617",
                    "CVE-2018-16862",
                    "CVE-2018-19985",
                    "CVE-2018-20169",
                    "CVE-2018-20511",
                    "CVE-2018-20784",
                    "CVE-2018-20856",
                    "CVE-2019-0136",
                    "CVE-2019-2024",
                    "CVE-2019-2101",
                    "CVE-2019-3701",
                    "CVE-2019-3819",
                    "CVE-2019-3846",
                    "CVE-2019-3900",
                    "CVE-2019-9506",
                    "CVE-2019-10126",
                    "CVE-2019-10207",
                    "CVE-2019-10638",
                    "CVE-2019-10639",
                    "CVE-2019-11085",
                    "CVE-2019-11487",
                    "CVE-2019-11599",
                    "CVE-2019-11810",
                    "CVE-2019-11815",
                    "CVE-2019-11833",
                    "CVE-2019-11884",
                    "CVE-2019-12818",
                    "CVE-2019-12819",
                    "CVE-2019-12984",
                    "CVE-2019-13233",
                    "CVE-2019-13272",
                    "CVE-2019-13631",
                    "CVE-2019-14283",
                    "CVE-2019-14284",
                    "CVE-2019-14763",
                    "CVE-2019-15090",
                    "CVE-2019-15211",
                    "CVE-2019-15212",
                    "CVE-2019-15214",
                    "CVE-2019-15215",
                    "CVE-2019-15216",
                    "CVE-2019-15218",
                    "CVE-2019-15220",
                    "CVE-2019-15221",
                    "CVE-2019-15292"
                ]
            },
            "timestamp": "2019-09-02 21:34:33.075167",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe@4.15.0-1047.49~16.04.1?arch=source&distro=xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe-cloud-tools-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe-tools-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe-tools-4.15.0-1047@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws-dbgsym@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws-dbgsym@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1047-aws@4.15.0-1047.49~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws@4.15.0-1047.49?arch=source&distro=bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-cloud-tools-4.15.0-1047@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1047@4.15.0-1047.49?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-tools-4.15.0-1047@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-tools-4.15.0-1047@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1047-aws@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1047-aws@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.15.0-1047-aws@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1047-aws@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1047-aws@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws-dbgsym@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.15.0-1047-aws-dbgsym@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1047-aws@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1047-aws@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1047-aws@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1047-aws@4.15.0-1047.49?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1047-aws@4.15.0-1047.49?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1047-aws@4.15.0-1047.49?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}