{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5924-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.831609",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5924-1",
                "name": "USN-5924-1",
                "description": "It was discovered that the Upper Level Protocol (ULP) subsystem in the Linux kernel did not properly handle sockets entering the LISTEN state in certain protocols, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-0461)  It was discovered that the System V IPC implementation in the Linux kernel did not properly handle large shared memory counts. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-3669)  It was discovered that an out-of-bounds write vulnerability existed in the Video for Linux 2 (V4L2) implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-20369)  Pawan Kumar Gupta, Alyssa Milburn, Amit Peled, Shani Rehana, Nir Shildan and Ariel Sabba discovered that some Intel processors with Enhanced Indirect Branch Restricted Speculation (eIBRS) did not properly handle RET instructions after a VM exits. A local attacker could potentially use this to expose sensitive information. (CVE-2022-26373)  David Leadbeater discovered that the netfilter IRC protocol tracking implementation in the Linux Kernel incorrectly handled certain message payloads in some situations. A remote attacker could possibly use this to cause a denial of service or bypass firewall filtering. (CVE-2022-2663)  Johannes Wikner and Kaveh Razavi discovered that for some AMD x86-64 processors, the branch predictor could by mis-trained for return instructions in certain circumstances. A local attacker could possibly use this to expose sensitive information. (CVE-2022-29900)  Johannes Wikner and Kaveh Razavi discovered that for some Intel x86-64 processors, the Linux kernel's protections against speculative branch target injection attacks were insufficient in some circumstances. A local attacker could possibly use this to expose sensitive information. (CVE-2022-29901)  It was discovered that a use-after-free vulnerability existed in the SGI GRU driver in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3424)  It was discovered that a race condition existed in the Kernel Connection Multiplexor (KCM) socket implementation in the Linux kernel when releasing sockets in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3521)  It was discovered that the Netronome Ethernet driver in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3545)  It was discovered that the Broadcom FullMAC USB WiFi driver in the Linux kernel did not properly perform bounds checking in some situations. A physically proximate attacker could use this to craft a malicious USB device that when inserted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3628)  Ziming Zhang discovered that the VMware Virtual GPU DRM driver in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36280)  It was discovered that a use-after-free vulnerability existed in the Bluetooth stack in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3640)  It was discovered that the NILFS2 file system implementation in the Linux kernel did not properly deallocate memory in certain error conditions. An attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-3646)  Khalid Masum discovered that the NILFS2 file system implementation in the Linux kernel did not properly handle certain error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2022-3649)  Hyunwoo Kim discovered that an integer overflow vulnerability existed in the PXA3xx graphics driver in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-39842)  Hyunwoo Kim discovered that the DVB Core driver in the Linux kernel did not properly perform reference counting in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41218)  It was discovered that a race condition existed in the SMSC UFX USB driver implementation in the Linux kernel, leading to a use-after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41849)  It was discovered that a race condition existed in the Roccat HID driver in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41850)  It was discovered that a race condition existed in the Xen network backend driver in the Linux kernel when handling dropped packets in certain circumstances. An attacker could use this to cause a denial of service (kernel deadlock). (CVE-2022-42328, CVE-2022-42329)  Tamás Koczka discovered that the Bluetooth L2CAP implementation in the Linux kernel did not properly initialize memory in some situations. A physically proximate attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2022-42895)  It was discovered that the USB monitoring (usbmon) component in the Linux kernel did not properly set permissions on memory mapped in to user space processes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-43750)  It was discovered that the network queuing discipline implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-47929)  José Oliveira and Rodrigo Branco discovered that the prctl syscall implementation in the Linux kernel did not properly protect against indirect branch prediction attacks in some situations. A local attacker could possibly use this to expose sensitive information. (CVE-2023-0045)  It was discovered that a use-after-free vulnerability existed in the Advanced Linux Sound Architecture (ALSA) subsystem. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0266)  Kyle Zeng discovered that the IPv6 implementation in the Linux kernel contained a NULL pointer dereference vulnerability in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0394)  Kyle Zeng discovered that the ATM VC queuing discipline implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-23455)  It was discovered that the RNDIS USB driver in the Linux kernel contained an integer overflow vulnerability. A local attacker with physical access could plug in a malicious USB device to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-23559)",
                "aliases": [
                    "CVE-2021-3669",
                    "CVE-2022-2663",
                    "CVE-2022-3424",
                    "CVE-2022-3521",
                    "CVE-2022-3545",
                    "CVE-2022-3628",
                    "CVE-2022-3640",
                    "CVE-2022-3646",
                    "CVE-2022-3649",
                    "CVE-2022-20369",
                    "CVE-2022-26373",
                    "CVE-2022-29901",
                    "CVE-2022-36280",
                    "CVE-2022-39842",
                    "CVE-2022-41218",
                    "CVE-2022-41849",
                    "CVE-2022-41850",
                    "CVE-2022-42328",
                    "CVE-2022-42329",
                    "CVE-2022-42895",
                    "CVE-2022-43750",
                    "CVE-2022-47929",
                    "CVE-2023-0045",
                    "CVE-2023-0266",
                    "CVE-2023-0394",
                    "CVE-2023-0461",
                    "CVE-2023-23455",
                    "CVE-2023-23559"
                ]
            },
            "timestamp": "2023-03-06 22:40:05.056309",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure@4.15.0-1162.177~14.04.1?arch=src?distro=esm/trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-cloud-tools-4.15.0-1162@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1162@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1162@4.15.0-1162.177~14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1162@4.15.0-1162.177~14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1162@4.15.0-1162.177~14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1162@4.15.0-1162.177~14.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-tools-4.15.0-1162@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1162-azure@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.15.0-1162-azure@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1162-azure@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1162-azure@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1162-azure-dbgsym@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1162-azure@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1162-azure@4.15.0-1162.177~14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1162-azure@4.15.0-1162.177~14.04.1?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}