{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5774-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:41.604185",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5774-1",
                "name": "USN-5774-1",
                "description": "Jann Horn discovered that the Linux kernel did not properly track memory allocations for anonymous VMA mappings in some situations, leading to potential data structure reuse. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-42703)  It was discovered that a race condition existed in the instruction emulator of the Linux kernel on Arm 64-bit systems. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-20422)  It was discovered that the KVM implementation in the Linux kernel did not properly handle virtual CPUs without APICs in certain situations. A local attacker could possibly use this to cause a denial of service (host system crash). (CVE-2022-2153)  Hao Sun and Jiacheng Xu discovered that the NILFS file system implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-2978)  Abhishek Shah discovered a race condition in the PF_KEYv2 implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2022-3028)  It was discovered that the video4linux driver for Empia based TV cards in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3239)  It was discovered that a memory leak existed in the IPv6 implementation of the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-3524)  It was discovered that a race condition existed in the Bluetooth subsystem in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3564)  It was discovered that the ISDN implementation of the Linux kernel contained a use-after-free vulnerability. A privileged user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3565)  It was discovered that the TCP implementation in the Linux kernel contained a data race condition. An attacker could possibly use this to cause undesired behaviors. (CVE-2022-3566)  It was discovered that the IPv6 implementation in the Linux kernel contained a data race condition. An attacker could possibly use this to cause undesired behaviors. (CVE-2022-3567)  It was discovered that the Realtek RTL8152 USB Ethernet adapter driver in the Linux kernel did not properly handle certain error conditions. A local attacker with physical access could plug in a specially crafted USB device to cause a denial of service (memory exhaustion). (CVE-2022-3594)  It was discovered that a null pointer dereference existed in the NILFS2 file system implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3621)  It was discovered that the IDT 77252 ATM PCI device driver in the Linux kernel did not properly remove any pending timers during device exit, resulting in a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-3635)  It was discovered that the Netlink Transformation (XFRM) subsystem in the Linux kernel contained a reference counting error. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36879)  Xingyuan Mo and Gengjia Chen discovered that the Promise SuperTrak EX storage controller driver in the Linux kernel did not properly handle certain structures. A local attacker could potentially use this to expose sensitive information (kernel memory). (CVE-2022-40768)",
                "aliases": [
                    "CVE-2022-2153",
                    "CVE-2022-2978",
                    "CVE-2022-3028",
                    "CVE-2022-3239",
                    "CVE-2022-3524",
                    "CVE-2022-3564",
                    "CVE-2022-3565",
                    "CVE-2022-3566",
                    "CVE-2022-3567",
                    "CVE-2022-3594",
                    "CVE-2022-3621",
                    "CVE-2022-3635",
                    "CVE-2022-20422",
                    "CVE-2022-36879",
                    "CVE-2022-40768",
                    "CVE-2022-42703"
                ]
            },
            "timestamp": "2022-12-12 16:34:15.969489",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure@4.15.0-1157.172~14.04.2?arch=source&distro=trusty/esm"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-cloud-tools-4.15.0-1157@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1157@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1157@4.15.0-1157.172~14.04.2?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1157@4.15.0-1157.172~14.04.2?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1157@4.15.0-1157.172~14.04.2?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-4.15.0-1157@4.15.0-1157.172~14.04.2?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-tools-4.15.0-1157@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1157-azure@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.15.0-1157-azure@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1157-azure@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1157-azure@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1157-azure-dbgsym@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1157-azure@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1157-azure@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1157-azure@4.15.0-1157.172~14.04.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15@4.15.0-1157.172?arch=source&distro=bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-cloud-tools-4.15.0-1157@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1157@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1157@4.15.0-1157.172?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1157@4.15.0-1157.172?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1157@4.15.0-1157.172?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1157@4.15.0-1157.172?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1157@4.15.0-1157.172?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-tools-4.15.0-1157@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1157-azure@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.15.0-1157-azure@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1157-azure@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1157-azure@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1157-azure-dbgsym@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1157-azure@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1157-azure@4.15.0-1157.172?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1157-azure@4.15.0-1157.172?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}