{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4369-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:39.305765",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4369-2",
                "name": "USN-4369-2",
                "description": "USN-4369-1 fixed vulnerabilities in the 5.3 Linux kernel. Unfortunately, that update introduced a regression in overlayfs. This update corrects the problem.  We apologize for the inconvenience.  Original advisory details:   It was discovered that the btrfs implementation in the Linux kernel did not  properly detect that a block was marked dirty in some situations. An  attacker could use this to specially craft a file system image that, when  unmounted, could cause a denial of service (system crash). (CVE-2019-19377)   Tristan Madani discovered that the file locking implementation in the Linux  kernel contained a race condition. A local attacker could possibly use this  to cause a denial of service or expose sensitive information.  (CVE-2019-19769)   It was discovered that the Serial CAN interface driver in the Linux kernel  did not properly initialize data. A local attacker could use this to expose  sensitive information (kernel memory). (CVE-2020-11494)   It was discovered that the linux kernel did not properly validate certain  mount options to the tmpfs virtual memory file system. A local attacker  with the ability to specify mount options could use this to cause a denial  of service (system crash). (CVE-2020-11565)   It was discovered that the OV51x USB Camera device driver in the Linux  kernel did not properly validate device metadata. A physically proximate  attacker could use this to cause a denial of service (system crash).  (CVE-2020-11608)   It was discovered that the STV06XX USB Camera device driver in the Linux  kernel did not properly validate device metadata. A physically proximate  attacker could use this to cause a denial of service (system crash).  (CVE-2020-11609)   It was discovered that the Xirlink C-It USB Camera device driver in the  Linux kernel did not properly validate device metadata. A physically  proximate attacker could use this to cause a denial of service (system  crash). (CVE-2020-11668)   It was discovered that the block layer in the Linux kernel contained a race  condition leading to a use-after-free vulnerability. A local attacker could  possibly use this to cause a denial of service (system crash) or execute  arbitrary code. (CVE-2020-12657)",
                "aliases": []
            },
            "timestamp": "2020-05-28 22:34:51.525779",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-5.3@5.3.0-1026.28~18.04.1?arch=source&distro=bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-5.3.0-1026-raspi2-dbgsym@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-5.3.0-1026-raspi2-dbgsym@5.3.0-1026.28~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-5.3-headers-5.3.0-1026@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-5.3-headers-5.3.0-1026@5.3.0-1026.28~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-5.3-tools-5.3.0-1026@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-5.3-tools-5.3.0-1026@5.3.0-1026.28~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.3.0-1026-raspi2@5.3.0-1026.28~18.04.1?arch=armhf"
                }
            ],
            "status": "fixed",
            "status_notes": "USN-4369-1 introduced a regression in the Linux kernel."
        }
    ]
}