{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2433-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:36.307858",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2433-1",
                "name": "USN-2433-1",
                "description": "Steffen Bauch discovered that tcpdump incorrectly handled printing OSLR packets. A remote attacker could use this issue to cause tcpdump to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2014-8767)  Steffen Bauch discovered that tcpdump incorrectly handled printing GeoNet packets. A remote attacker could use this issue to cause tcpdump to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only applied to Ubuntu 14.04 LTS and Ubuntu 14.10. (CVE-2014-8768)  Steffen Bauch discovered that tcpdump incorrectly handled printing AODV packets. A remote attacker could use this issue to cause tcpdump to crash, resulting in a denial of service, reveal sensitive information, or possibly execute arbitrary code. (CVE-2014-8769)  It was discovered that tcpdump incorrectly handled printing PPP packets. A remote attacker could use this issue to cause tcpdump to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2014-9140)  In the default installation, attackers would be isolated by the tcpdump AppArmor profile.",
                "aliases": [
                    "CVE-2014-8767",
                    "CVE-2014-8768",
                    "CVE-2014-8769",
                    "CVE-2014-9140"
                ]
            },
            "timestamp": "2014-12-04 14:05:51.691404",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/tcpdump@4.5.1-2ubuntu1.1?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/tcpdump@4.5.1-2ubuntu1.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/tcpdump@4.5.1-2ubuntu1.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/tcpdump@4.5.1-2ubuntu1.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/tcpdump@4.5.1-2ubuntu1.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/tcpdump@4.5.1-2ubuntu1.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/tcpdump@4.5.1-2ubuntu1.1?arch=ppc64el"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in tcpdump."
        }
    ]
}