{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5120-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:25.731817",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5120-1",
                "name": "USN-5120-1",
                "description": "It was discovered that the f2fs file system in the Linux kernel did not properly validate metadata in some situations. An attacker could use this to construct a malicious f2fs image that, when mounted and operated on, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-19449)  It was discovered that the Linux kernel did not properly enforce certain types of entries in the Secure Boot Forbidden Signature Database (aka dbx) protection mechanism. An attacker could use this to bypass UEFI Secure Boot restrictions. (CVE-2020-26541)  It was discovered that the KVM hypervisor implementation for AMD processors in the Linux kernel did not ensure enough processing time was given to perform cleanups of large SEV VMs. A local attacker could use this to cause a denial of service (soft lockup). (CVE-2020-36311)  It was discovered that the KVM hypervisor implementation in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. An attacker who could start and control a VM could possibly use this to expose sensitive information or execute arbitrary code. (CVE-2021-22543)  Murray McAllister discovered that the joystick device interface in the Linux kernel did not properly validate data passed via an ioctl(). A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code on systems with a joystick device registered. (CVE-2021-3612)  It was discovered that the Linux kernel did not properly account for the memory usage of certain IPC objects. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-3759)  Michael Wakabayashi discovered that the NFSv4 client implementation in the Linux kernel did not properly order connection setup operations. An attacker controlling a remote NFS server could use this to cause a denial of service on the client. (CVE-2021-38199)  It was discovered that the Xilinx LL TEMAC device driver in the Linux kernel did not properly calculate the number of buffers to be used in certain situations. A remote attacker could use this to cause a denial of service (system crash). (CVE-2021-38207)  It was discovered that the ext4 file system in the Linux kernel contained a race condition when writing xattrs to an inode. A local attacker could use this to cause a denial of service or possibly gain administrative privileges. (CVE-2021-40490)",
                "aliases": [
                    "CVE-2019-19449",
                    "CVE-2020-26541",
                    "CVE-2020-36311",
                    "CVE-2021-3612",
                    "CVE-2021-3759",
                    "CVE-2021-22543",
                    "CVE-2021-38199",
                    "CVE-2021-38207",
                    "CVE-2021-40490"
                ]
            },
            "timestamp": "2021-10-22 01:52:40.106459",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8@5.8.0-1043.46~20.04.1?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-cloud-tools-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-headers-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-headers-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-headers-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-headers-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-headers-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-headers-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-headers-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.8-tools-5.8.0-1043@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.8.0-1043-azure@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-5.8.0-1043-azure@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.8.0-1043-azure@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.8.0-1043-azure@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.8.0-1043-azure-dbgsym@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.8.0-1043-azure@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.8.0-1043-azure@5.8.0-1043.46~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.8.0-1043-azure@5.8.0-1043.46~20.04.1?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}