{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5831-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.909664",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5831-1",
                "name": "USN-5831-1",
                "description": "Kyle Zeng discovered that the sysctl implementation in the Linux kernel contained a stack-based buffer overflow. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-4378)  Tamás Koczka discovered that the Bluetooth L2CAP handshake implementation in the Linux kernel contained multiple use-after-free vulnerabilities. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-42896)  It was discovered that the Xen netback driver in the Linux kernel did not properly handle packets structured in certain ways. An attacker in a guest VM could possibly use this to cause a denial of service (host NIC availability). (CVE-2022-3643)  It was discovered that an integer overflow vulnerability existed in the Bluetooth subsystem in the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2022-45934)",
                "aliases": [
                    "CVE-2022-3643",
                    "CVE-2022-4378",
                    "CVE-2022-42896",
                    "CVE-2022-45934"
                ]
            },
            "timestamp": "2023-01-27 20:01:20.825094",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-fde@5.15.0-1031.38.1?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1031-azure-fde@5.15.0-1031.38.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1031-azure-fde-dbgsym@5.15.0-1031.38.1?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}