{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5582-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:41.277780",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5582-1",
                "name": "USN-5582-1",
                "description": "Arthur Mongodin discovered that the netfilter subsystem in the Linux kernel did not properly perform data validation. A local attacker could use this to escalate privileges in certain situations. (CVE-2022-34918)  Zhenpeng Lin discovered that the network packet scheduler implementation in the Linux kernel did not properly remove all references to a route filter before freeing it in some situations. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-2588)  It was discovered that the netfilter subsystem of the Linux kernel did not prevent one nft object from referencing an nft set in another nft table, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-2586)  It was discovered that the block layer subsystem in the Linux kernel did not properly initialize memory in some situations. A privileged local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-0494)  Hu Jiahui discovered that multiple race conditions existed in the Advanced Linux Sound Architecture (ALSA) framework, leading to use-after-free vulnerabilities. A local attacker could use these to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1048)  Minh Yuan discovered that the floppy disk driver in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-1652)  It was discovered that the Atheros ath9k wireless device driver in the Linux kernel did not properly handle some error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1679)  It was discovered that the Marvell NFC device driver implementation in the Linux kernel did not properly perform memory cleanup operations in some situations, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-1734)  Duoming Zhou discovered a race condition in the NFC subsystem in the Linux kernel, leading to a use-after-free vulnerability. A privileged local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1974)  Duoming Zhou discovered that the NFC subsystem in the Linux kernel did not properly prevent context switches from occurring during certain atomic context operations. A privileged local attacker could use this to cause a denial of service (system crash). (CVE-2022-1975)  Felix Fu discovered that the Sun RPC implementation in the Linux kernel did not properly handle socket states, leading to a use-after-free vulnerability. A remote attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-28893)",
                "aliases": [
                    "CVE-2022-0494",
                    "CVE-2022-1048",
                    "CVE-2022-1652",
                    "CVE-2022-1679",
                    "CVE-2022-1734",
                    "CVE-2022-1974",
                    "CVE-2022-1975",
                    "CVE-2022-2586",
                    "CVE-2022-2588",
                    "CVE-2022-28893",
                    "CVE-2022-34918"
                ]
            },
            "timestamp": "2022-08-25 03:58:20.605561",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-fde@5.4.0-1089.94+cvm1.2?arch=source&distro=focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1089-azure-fde@5.4.0-1089.94+cvm1.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1089-azure-fde-dbgsym@5.4.0-1089.94+cvm1.2?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}