{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-7036-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-09-27T04:37:42.351130",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-7036-1",
                "name": "USN-7036-1",
                "description": "It was discovered that Rack was not properly parsing data when processing multipart POST requests. If a user or automated system were tricked into sending a specially crafted multipart POST request to an application using Rack, a remote attacker could possibly use this issue to cause a denial of service. (CVE-2022-30122)  It was discovered that Rack was not properly escaping untrusted data when performing logging operations, which could cause shell escaped sequences to be written to a terminal. If a user or automated system were tricked into sending a specially crafted request to an application using Rack, a remote attacker could possibly use this issue to execute arbitrary code in the machine running the application. (CVE-2022-30123)  It was discovered that Rack did not properly structure regular expressions in some of its parsing components, which could result in uncontrolled resource consumption if an application using Rack received specially crafted input. A remote attacker could possibly use this issue to cause a denial of service. (CVE-2022-44570, CVE-2022-44571)  It was discovered that Rack did not properly structure regular expressions in its multipart parsing component, which could result in uncontrolled resource consumption if an application using Rack to parse multipart posts received specially crafted input. A remote attacker could possibly use this issue to cause a denial of service. (CVE-2022-44572)  It was discovered that Rack incorrectly handled Multipart MIME parsing. A remote attacker could possibly use this issue to cause Rack to consume resources, leading to a denial of service. (CVE-2023-27530)  It was discovered that Rack incorrectly handled certain regular expressions. A remote attacker could possibly use this issue to cause Rack to consume resources, leading to a denial of service. (CVE-2023-27539)  It was discovered that Rack incorrectly parsed certain media types. A remote attacker could possibly use this issue to cause Rack to consume resources, leading to a denial of service. (CVE-2024-25126)  It was discovered that Rack incorrectly handled certain Range headers. A remote attacker could possibly use this issue to cause Rack to create large responses, leading to a denial of service. (CVE-2024-26141)  It was discovered that Rack incorrectly handled certain crafted headers. A remote attacker could possibly use this issue to cause Rack to consume resources, leading to a denial of service. (CVE-2024-26146)",
                "aliases": [
                    "CVE-2022-30122",
                    "CVE-2022-30123",
                    "CVE-2022-44570",
                    "CVE-2022-44571",
                    "CVE-2022-44572",
                    "CVE-2023-27530",
                    "CVE-2023-27539",
                    "CVE-2024-25126",
                    "CVE-2024-26141",
                    "CVE-2024-26146"
                ]
            },
            "timestamp": "2024-09-26 04:19:46.522367",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/ruby-rack@2.1.4-5ubuntu1.1?arch=s390x"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in Rack."
        }
    ]
}