{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5278-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:40.745656",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5278-1",
                "name": "USN-5278-1",
                "description": "It was discovered that the rlimit tracking for user namespaces in the Linux kernel did not properly perform reference counting, leading to a use-after- free vulnerability. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2022-24122)  It was discovered that the BPF verifier in the Linux kernel did not properly restrict pointer types in certain situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-23222)  Jeremy Cline discovered a use-after-free in the nouveau graphics driver of the Linux kernel during device removal. A privileged or physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2020-27820)  It was discovered that the Packet network protocol implementation in the Linux kernel contained a double-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-22600)  Jürgen Groß discovered that the Xen subsystem within the Linux kernel did not adequately limit the number of events driver domains (unprivileged PV backends) could send to other guest VMs. An attacker in a driver domain could use this to cause a denial of service in other guest VMs. (CVE-2021-28713)  Jürgen Groß discovered that the Xen network backend driver in the Linux kernel did not adequately limit the amount of queued packets when a guest did not process them. An attacker in a guest VM can use this to cause a denial of service (excessive kernel memory consumption) in the network backend domain. (CVE-2021-28714, CVE-2021-28715)  Szymon Heidrich discovered that the USB Gadget subsystem in the Linux kernel did not properly restrict the size of control requests for certain gadget types, leading to possible out of bounds reads or writes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-39685)  It was discovered that the eBPF implementation in the Linux kernel contained a race condition around read-only maps. A privileged attacker could use this to modify read-only maps. (CVE-2021-4001)  Jann Horn discovered a race condition in the Unix domain socket implementation in the Linux kernel that could result in a read-after-free. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-4083)  It was discovered that the simulated networking device driver for the Linux kernel did not properly initialize memory in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2021-4135)  Kirill Tkhai discovered that the XFS file system implementation in the Linux kernel did not calculate size correctly when pre-allocating space in some situations. A local attacker could use this to expose sensitive information. (CVE-2021-4155)  Eric Biederman discovered that the cgroup process migration implementation in the Linux kernel did not perform permission checks correctly in some situations. A local attacker could possibly use this to gain administrative privileges. (CVE-2021-4197)  Brendan Dolan-Gavitt discovered that the aQuantia AQtion Ethernet device driver in the Linux kernel did not properly validate meta-data coming from the device. A local attacker who can control an emulated device can use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-43975)  It was discovered that the ARM Trusted Execution Environment (TEE) subsystem in the Linux kernel contained a race condition leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2021-44733)  It was discovered that the Phone Network protocol (PhoNet) implementation in the Linux kernel did not properly perform reference counting in some error conditions. A local attacker could possibly use this to cause a denial of service (memory exhaustion). (CVE-2021-45095)  It was discovered that the Reliable Datagram Sockets (RDS) protocol implementation in the Linux kernel did not properly deallocate memory in some error conditions. A local attacker could possibly use this to cause a denial of service (memory exhaustion). (CVE-2021-45480)  It was discovered that the BPF subsystem in the Linux kernel did not properly track pointer types on atomic fetch operations in some situations. A local attacker could use this to expose sensitive information (kernel pointer addresses). (CVE-2022-0264)  Sushma Venkatesh Reddy discovered that the Intel i915 graphics driver in the Linux kernel did not perform a GPU TLB flush in some situations. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2022-0330)  It was discovered that the TIPC Protocol implementation in the Linux kernel did not properly initialize memory in some situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-0382)  It was discovered that the VMware Virtual GPU driver in the Linux kernel did not properly handle certain failure conditions, leading to a stale entry in the file descriptor table. A local attacker could use this to expose sensitive information or possibly gain administrative privileges. (CVE-2022-22942)",
                "aliases": [
                    "CVE-2020-27820",
                    "CVE-2021-4001",
                    "CVE-2021-4083",
                    "CVE-2021-4135",
                    "CVE-2021-4155",
                    "CVE-2021-4197",
                    "CVE-2021-22600",
                    "CVE-2021-28713",
                    "CVE-2021-28714",
                    "CVE-2021-28715",
                    "CVE-2021-39685",
                    "CVE-2021-43975",
                    "CVE-2021-44733",
                    "CVE-2021-45095",
                    "CVE-2021-45480",
                    "CVE-2022-0264",
                    "CVE-2022-0330",
                    "CVE-2022-0382",
                    "CVE-2022-22942",
                    "CVE-2022-23222",
                    "CVE-2022-24122"
                ]
            },
            "timestamp": "2022-02-09 02:16:11.094252",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14@5.14.0-1022.24?arch=source&distro=focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.14.0-1022-oem@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.14.0-1022-oem@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.14.0-1022-oem@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.14.0-1022-oem-dbgsym@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.14.0-1022-oem@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1022@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1022@5.14.0-1022.24?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1022@5.14.0-1022.24?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1022@5.14.0-1022.24?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1022@5.14.0-1022.24?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1022@5.14.0-1022.24?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1022@5.14.0-1022.24?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-5.14.0-1022@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1022.24?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1022.24?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1022.24?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1022.24?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1022.24?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1022.24?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1022.24?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.14.0-1022-oem@5.14.0-1022.24?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}