{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2702-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:36.521651",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2702-2",
                "name": "USN-2702-2",
                "description": "USN-2702-1 fixed vulnerabilities in Firefox. This update provides the corresponding updates for Ubufox.  Original advisory details:   Gary Kwong, Christian Holler, Byron Campen, Tyson Smith, Bobby Holley,  Chris Coulson, and Eric Rahm discovered multiple memory safety issues in  Firefox. If a user were tricked in to opening a specially crafted website,  an attacker could potentially exploit these to cause a denial of service  via application crash, or execute arbitrary code with the privileges of  the user invoking Firefox. (CVE-2015-4473, CVE-2015-4474)    Aki Helin discovered an out-of-bounds read when playing malformed MP3  content in some circumstances. If a user were tricked in to opening a  specially crafted website, an attacker could potentially exploit this to  obtain sensitive information, cause a denial of service via application  crash, or execute arbitrary code with the privileges of the user invoking  Firefox. (CVE-2015-4475)    A use-after-free was discovered during MediaStream playback in some  circumstances. If a user were tricked in to opening a specially crafted  website, an attacker could potentially exploit this to cause a denial of  service via application crash or execute arbitrary code with the  priviliges of the user invoking Firefox. (CVE-2015-4477)    André Bargull discovered that non-configurable properties on javascript  objects could be redefined when parsing JSON. If a user were tricked in to  opening a specially crafted website, an attacker could potentially exploit  this to bypass same-origin restrictions. (CVE-2015-4478)    Multiple integer overflows were discovered in libstagefright. If a user  were tricked in to opening a specially crafted website, an attacker could  potentially exploit these to cause a denial of service via application  crash, or execute arbitrary code with the privileges of the user invoking  Firefox. (CVE-2015-4479, CVE-2015-4480, CVE-2015-4493)    Jukka Jylänki discovered a crash that occurs because javascript does not  properly gate access to Atomics or SharedArrayBuffers in some  circumstances. If a user were tricked in to opening a specially crafted  website, an attacker could potentially exploit this to cause a denial of  service. (CVE-2015-4484)    Abhishek Arya discovered 2 buffer overflows in libvpx when decoding  malformed WebM content in some circumstances. If a user were tricked in  to opening a specially crafted website, an attacker could potentially  exploit these to cause a denial of service via application crash, or  execute arbitrary code with the privileges of the user invoking Firefox.  (CVE-2015-4485, CVE-2015-4486)    Ronald Crane reported 3 security issues. If a user were tricked in to  opening a specially crafted website, an attacker could potentially  exploit these, in combination with another security vulnerability, to  cause a denial of service via application crash, or execute arbitrary  code with the privileges of the user invoking Firefox. (CVE-2015-4487,  CVE-2015-4488, CVE-2015-4489)    Christoph Kerschbaumer discovered an issue with Mozilla's implementation  of Content Security Policy (CSP), which could allow for a more permissive  usage in some cirucumstances. An attacker could potentially exploit this  to conduct cross-site scripting (XSS) attacks. (CVE-2015-4490)    Gustavo Grieco discovered a heap overflow in gdk-pixbuf. If a user were  tricked in to opening a specially crafted website, an attacker could  potentially exploit this to cause a denial of service via application  crash or execute arbitrary code with the priviliges of the user invoking  Firefox. (CVE-2015-4491)    Looben Yang discovered a use-after-free when using XMLHttpRequest with  shared workers in some circumstances. If a user were tricked in to opening  a specially crafted website, an attacker could potentially exploit this to  cause a denial of service via application crash or execute arbitrary code  with the priviliges of the user invoking Firefox. (CVE-2015-4492)",
                "aliases": []
            },
            "timestamp": "2015-08-11 18:48:40.490216",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.1-0ubuntu0.14.04.1?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.1-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.1-0ubuntu0.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.1-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.1-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.1-0ubuntu0.14.04.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.1-0ubuntu0.14.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.1-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.1-0ubuntu0.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.1-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.1-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.1-0ubuntu0.14.04.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.1-0ubuntu0.14.04.1?arch=ppc64el"
                }
            ],
            "status": "fixed",
            "status_notes": "This update provides compatible packages for Firefox 40."
        }
    ]
}