{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6548-3",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.202977",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6548-3",
                "name": "USN-6548-3",
                "description": "It was discovered that Spectre-BHB mitigations were missing for Ampere processors. A local attacker could potentially use this to expose sensitive information. (CVE-2023-3006)  It was discovered that the USB subsystem in the Linux kernel contained a race condition while handling device descriptors in certain situations, leading to a out-of-bounds read vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-37453)  Lucas Leong discovered that the netfilter subsystem in the Linux kernel did not properly validate some attributes passed from userspace. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2023-39189)  Sunjoo Park discovered that the netfilter subsystem in the Linux kernel did not properly validate u32 packets content, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-39192)  Lucas Leong discovered that the netfilter subsystem in the Linux kernel did not properly validate SCTP data, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-39193)  Lucas Leong discovered that the Netlink Transformation (XFRM) subsystem in the Linux kernel did not properly handle state filters, leading to an out- of-bounds read vulnerability. A privileged local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-39194)  Kyle Zeng discovered that the IPv4 implementation in the Linux kernel did not properly handle socket buffers (skb) when performing IP routing in certain circumstances, leading to a null pointer dereference vulnerability. A privileged attacker could use this to cause a denial of service (system crash). (CVE-2023-42754)  Alon Zahavi discovered that the NVMe-oF/TCP subsystem in the Linux kernel did not properly handle queue initialization failures in certain situations, leading to a use-after-free vulnerability. A remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-5178)  Budimir Markovic discovered that the perf subsystem in the Linux kernel did not properly handle event groups, leading to an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-5717)  It was discovered that the TLS subsystem in the Linux kernel did not properly perform cryptographic operations in some situations, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6176)",
                "aliases": [
                    "CVE-2023-3006",
                    "CVE-2023-5178",
                    "CVE-2023-5717",
                    "CVE-2023-6176",
                    "CVE-2023-37453",
                    "CVE-2023-39189",
                    "CVE-2023-39192",
                    "CVE-2023-39193",
                    "CVE-2023-39194",
                    "CVE-2023-42754"
                ]
            },
            "timestamp": "2023-12-13 15:09:42.509068",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle@5.4.0-1115.124?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1115-oracle@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1115-oracle@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1115-oracle@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1115-oracle@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1115-oracle@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1115-oracle@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1115-oracle-dbgsym@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1115-oracle-dbgsym@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1115-oracle@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1115-oracle@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.4.0-1115-oracle@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.4.0-1115-oracle@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-headers-5.4.0-1115@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-headers-5.4.0-1115@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-headers-5.4.0-1115@5.4.0-1115.124?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-headers-5.4.0-1115@5.4.0-1115.124?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-headers-5.4.0-1115@5.4.0-1115.124?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-headers-5.4.0-1115@5.4.0-1115.124?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-headers-5.4.0-1115@5.4.0-1115.124?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-tools-5.4.0-1115@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-tools-5.4.0-1115@5.4.0-1115.124?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1115-oracle@5.4.0-1115.124?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1115-oracle@5.4.0-1115.124?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}