{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5865-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.883561",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5865-1",
                "name": "USN-5865-1",
                "description": "It was discovered that an out-of-bounds write vulnerability existed in the Video for Linux 2 (V4L2) implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-20369)  Pawan Kumar Gupta, Alyssa Milburn, Amit Peled, Shani Rehana, Nir Shildan and Ariel Sabba discovered that some Intel processors with Enhanced Indirect Branch Restricted Speculation (eIBRS) did not properly handle RET instructions after a VM exits. A local attacker could potentially use this to expose sensitive information. (CVE-2022-26373)  David Leadbeater discovered that the netfilter IRC protocol tracking implementation in the Linux Kernel incorrectly handled certain message payloads in some situations. A remote attacker could possibly use this to cause a denial of service or bypass firewall filtering. (CVE-2022-2663)  Johannes Wikner and Kaveh Razavi discovered that for some AMD x86-64 processors, the branch predictor could by mis-trained for return instructions in certain circumstances. A local attacker could possibly use this to expose sensitive information. (CVE-2022-29900)  Johannes Wikner and Kaveh Razavi discovered that for some Intel x86-64 processors, the Linux kernel's protections against speculative branch target injection attacks were insufficient in some circumstances. A local attacker could possibly use this to expose sensitive information. (CVE-2022-29901)  It was discovered that the NILFS2 file system implementation in the Linux kernel did not properly deallocate memory in certain error conditions. An attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-3646)  Khalid Masum discovered that the NILFS2 file system implementation in the Linux kernel did not properly handle certain error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2022-3649)  Hyunwoo Kim discovered that an integer overflow vulnerability existed in the PXA3xx graphics driver in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-39842)  It was discovered that a race condition existed in the SMSC UFX USB driver implementation in the Linux kernel, leading to a use-after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41849)  It was discovered that a race condition existed in the Roccat HID driver in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41850)  It was discovered that the USB monitoring (usbmon) component in the Linux kernel did not properly set permissions on memory mapped in to user space processes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-43750)",
                "aliases": [
                    "CVE-2022-2663",
                    "CVE-2022-3646",
                    "CVE-2022-3649",
                    "CVE-2022-20369",
                    "CVE-2022-26373",
                    "CVE-2022-29900",
                    "CVE-2022-29901",
                    "CVE-2022-39842",
                    "CVE-2022-41849",
                    "CVE-2022-41850",
                    "CVE-2022-43750"
                ]
            },
            "timestamp": "2023-02-10 15:08:25.776765",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15@4.15.0-1161.176?arch=src?distro=ubuntu/bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-cloud-tools-4.15.0-1161@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1161@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1161@4.15.0-1161.176?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1161@4.15.0-1161.176?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1161@4.15.0-1161.176?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1161@4.15.0-1161.176?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-headers-4.15.0-1161@4.15.0-1161.176?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-4.15-tools-4.15.0-1161@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1161-azure@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.15.0-1161-azure@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1161-azure@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1161-azure@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1161-azure-dbgsym@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1161-azure@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1161-azure@4.15.0-1161.176?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1161-azure@4.15.0-1161.176?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}