{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6635-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.120963",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6635-1",
                "name": "USN-6635-1",
                "description": "It was discovered that the USB subsystem in the Linux kernel contained a race condition while handling device descriptors in certain situations, leading to a out-of-bounds read vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-37453)  Lucas Leong discovered that the netfilter subsystem in the Linux kernel did not properly validate some attributes passed from userspace. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2023-39189)  Sunjoo Park discovered that the netfilter subsystem in the Linux kernel did not properly validate u32 packets content, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-39192)  Lucas Leong discovered that the netfilter subsystem in the Linux kernel did not properly validate SCTP data, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-39193)  Kyle Zeng discovered that the IPv4 implementation in the Linux kernel did not properly handle socket buffers (skb) when performing IP routing in certain circumstances, leading to a null pointer dereference vulnerability. A privileged attacker could use this to cause a denial of service (system crash). (CVE-2023-42754)  Jason Wang discovered that the virtio ring implementation in the Linux kernel did not properly handle iov buffers in some situations. A local attacker in a guest VM could use this to cause a denial of service (host system crash). (CVE-2023-5158)  Alon Zahavi discovered that the NVMe-oF/TCP subsystem in the Linux kernel did not properly handle queue initialization failures in certain situations, leading to a use-after-free vulnerability. A remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-5178)  Budimir Markovic discovered that the perf subsystem in the Linux kernel did not properly handle event groups, leading to an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-5717)  It was discovered that the CIFS network file system implementation in the Linux kernel did not properly validate the server frame size in certain situation, leading to an out-of-bounds read vulnerability. An attacker could use this to construct a malicious CIFS image that, when operated on, could cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-6606)  Xingyuan Mo discovered that the netfilter subsystem in the Linux kernel did not properly handle inactive elements in its PIPAPO data structure, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6817)  Budimir Markovic, Lucas De Marchi, and Pengfei Xu discovered that the perf subsystem in the Linux kernel did not properly validate all event sizes when attaching new events, leading to an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6931)  It was discovered that the IGMP protocol implementation in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-6932)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly check deactivated elements in certain situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2024-0193)",
                "aliases": [
                    "CVE-2023-5158",
                    "CVE-2023-5178",
                    "CVE-2023-5717",
                    "CVE-2023-6606",
                    "CVE-2023-6817",
                    "CVE-2023-6931",
                    "CVE-2023-6932",
                    "CVE-2023-37453",
                    "CVE-2023-39189",
                    "CVE-2023-39192",
                    "CVE-2023-39193",
                    "CVE-2023-42754",
                    "CVE-2024-0193"
                ]
            },
            "timestamp": "2024-02-14 09:17:09.575532",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-6.2@6.2.0-1021.23~22.04.1?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-6.2-headers-6.2.0-1021@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-6.2-headers-6.2.0-1021@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-6.2-tools-6.2.0-1021@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-6.2-tools-6.2.0-1021@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.2.0-1021-gcp-dbgsym@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.2.0-1021-gcp-dbgsym@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-6.2.0-1021-gcp@6.2.0-1021.23~22.04.1?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}