{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4843-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:40.050306",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4843-1",
                "name": "USN-4843-1",
                "description": "Javier Nieto and Andres Rojas discovered that phpMyAdmin incorrectly managed input in the form of passwords. An attacker could use this vulnerability to cause a denial-of-service (DoS). This issue only affected Ubuntu 14.04 ESM. (CVE-2014-9218)  Emanuel Bronshtein discovered that phpMyAdmin failed to properly sanitize input in the form of database names in the PHP Array export feature. An authenticated attacker could use this vulnerability to run arbitrary PHP commands. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2016-6609)  Emanuel Bronshtein discovered that phpMyAdmin failed to properly sanitize input. An attacker could use this vulnerability to execute SQL injection attacks. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2016-6619)  Emanuel Bronshtein discovered that phpMyadmin failed to properly sanitize input. An authenticated attacker could use this vulnerability to cause a denial-of-service (DoS). This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2016-6630)  Emanuel Bronshtein discovered that phpMyAdmin failed to properly sanitize input. An attacker could use this vulnerability to bypass AllowRoot restrictions and deny rules for usernames. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2016-9849)  Emanuel Bronshtein discovered that phpMyAdmin would allow sensitive information to be leaked when the argument separator in a URL was not the default & value. An attacker could use this vulnerability to obtain the CSRF token of a user. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2016-9866)  Isaac Bennetch discovered that phpMyAdmin was incorrectly restricting user access due to the behavior of the substr function on some PHP versions. An attacker could use this vulnerability to bypass login restrictions established for users that have no password set. This issue only affected Ubuntu 14.04 ESM. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2017-18264)  Emanuel Bronshtein discovered that phpMyAdmin failed to properly sanitize input in the form of parameters sent during a table editing operation. An attacker could use this vulnerability to trigger an endless recursion and cause a denial-of-service (DoS). This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2017-1000014)  Emanuel Bronshtein discovered that phpMyAdmin failed to properly sanitize input used to generate a web page. An authenticated attacker could use this vulnerability to execute CSS injection attacks. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2017-1000015)  It was discovered that phpMyAdmin incorrectly handled certain input. An attacker could use this vulnerability to execute a cross-site scripting (XSS) attack via a crafted URL. This issue only affected Ubuntu 16.04 ESM. (CVE-2018-7260)  It was discovered phpMyAdmin incorrectly handled database names. An attacker could possibly use this to trigger a cross-site scripting attack. This issue only affected Ubuntu 16.04 ESM and Ubuntu 18.04 ESM. (CVE-2018-12581)  Daniel Le Gall discovered that phpMyAdmin would expose sensitive information to unauthorized actors due to an error in its transformation feature. An authenticated attacker could use this vulnerability to leak the contents of a local file. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2018-19968)  It was discovered that phpMyAdmin incorrectly handled user input. An attacker could possibly use this to perform a cross-site scripting attack. This issue only affected Ubuntu 16.04 ESM. (CVE-2018-19970)  It was discovered that phpMyAdmin failed to properly sanitize input. An attacker could use this vulnerability to execute an SQL injection attack via a specially crafted database name. This issue only affected Ubuntu 16.04 ESM. (CVE-2019-11768)  It was discovered that phpMyAdmin incorrectly handled some requests. An attacker could possibly use this to perform a cross site request forgery attack. This issue only affected Ubuntu 16.04 ESM. (CVE-2019-12616)  It was discovered that phpMyAdmin incorrectly handled some requests. An attacker could possibly use this to perform a cross site request forgery attack. This issue only affected Ubuntu 14.04 ESM and Ubuntu 18.04 ESM. (CVE-2019-12922)  It was discovered that phpMyAdmin failed to properly sanitize input. An attacker could use this vulnerability to execute an SQL injection attack via a specially crafted username. This issue only affected Ubuntu 16.04 ESM. (CVE-2019-6798)  It was discovered that phpMyAdmin did not properly sanitize certain input. An attacker could use this vulnerability to possibly execute an HTML injection or a cross-site scripting (XSS) attack. This issue only affected Ubuntu 14.04 ESM and Ubuntu 16.04 ESM. (CVE-2019-19617)  CSW Research Labs discovered that phpMyAdmin failed to properly sanitize input.  An attacker could use this vulnerability to execute SQL injection attacks. This issue only affected Ubuntu 16.04 ESM. (CVE-2020-5504)  Giwan Go and Yelang Lee discovered that phpMyAdmin was vulnerable to an XSS attack in the transformation feature. If a victim were to click on a crafted link, an attacker could run malicious JavaScript on the victim's system. This issue only affected Ubuntu 20.04 ESM. (CVE-2020-26934)  Andre Sá discovered that phpMyAdmin incorrectly handled certain SQL statements in the search feature. A remote, authenticated attacker could use this to inject malicious SQL into a query. This issue only affected Ubuntu 20.04 ESM. (CVE-2020-26935)",
                "aliases": [
                    "CVE-2014-9218",
                    "CVE-2016-6609",
                    "CVE-2016-6619",
                    "CVE-2016-6630",
                    "CVE-2016-9849",
                    "CVE-2016-9866",
                    "CVE-2017-18264",
                    "CVE-2017-1000014",
                    "CVE-2017-1000015",
                    "CVE-2018-7260",
                    "CVE-2018-12581",
                    "CVE-2018-19968",
                    "CVE-2018-19970",
                    "CVE-2019-6798",
                    "CVE-2019-11768",
                    "CVE-2019-12616",
                    "CVE-2019-12922",
                    "CVE-2019-19617",
                    "CVE-2020-5504",
                    "CVE-2020-26934",
                    "CVE-2020-26935"
                ]
            },
            "timestamp": "2021-03-16 14:27:57.040177",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.0.10-1ubuntu0.1+esm4?arch=source&distro=trusty/esm"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.0.10-1ubuntu0.1+esm4?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.0.10-1ubuntu0.1+esm4?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.0.10-1ubuntu0.1+esm4?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.0.10-1ubuntu0.1+esm4?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.0.10-1ubuntu0.1+esm4?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.0.10-1ubuntu0.1+esm4?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=source&distro=esm-apps/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.5.4.1-2ubuntu2.1+esm6?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.6.6-5ubuntu0.5+esm1?arch=source&distro=esm-apps/bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.6.6-5ubuntu0.5+esm1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.6.6-5ubuntu0.5+esm1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.6.6-5ubuntu0.5+esm1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.6.6-5ubuntu0.5+esm1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.6.6-5ubuntu0.5+esm1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.6.6-5ubuntu0.5+esm1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=source&distro=esm-apps/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/phpmyadmin@4:4.9.5+dfsg1-2ubuntu0.1~esm1?arch=s390x"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in phpMyAdmin. Available with Ubuntu Pro."
        }
    ]
}