{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5978-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.781021",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5978-1",
                "name": "USN-5978-1",
                "description": "It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1281)  It was discovered that the KVM VMX implementation in the Linux kernel did not properly handle indirect branch prediction isolation between L1 and L2 VMs. An attacker in a guest VM could use this to expose sensitive information from the host OS or other guest VMs. (CVE-2022-2196)  It was discovered that some AMD x86-64 processors with SMT enabled could speculatively execute instructions using a return address from a sibling thread. A local attacker could possibly use this to expose sensitive information. (CVE-2022-27672)  Gerald Lee discovered that the USB Gadget file system implementation in the Linux kernel contained a race condition, leading to a use-after-free vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-4382)  It was discovered that the NTFS file system implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-4842)  Kyle Zeng discovered that the IPv6 implementation in the Linux kernel contained a NULL pointer dereference vulnerability in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0394)  It was discovered that the Human Interface Device (HID) support driver in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-1073)  It was discovered that a memory leak existed in the SCTP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2023-1074)  It was discovered that the TLS subsystem in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1075)  It was discovered that the Reliable Datagram Sockets (RDS) protocol implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-1078)  It was discovered that the RNDIS USB driver in the Linux kernel contained an integer overflow vulnerability. A local attacker with physical access could plug in a malicious USB device to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-23559)  Lianhui Tang discovered that the MPLS implementation in the Linux kernel did not properly handle certain sysctl allocation failure conditions, leading to a double-free vulnerability. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-26545)",
                "aliases": [
                    "CVE-2022-2196",
                    "CVE-2022-4382",
                    "CVE-2022-4842",
                    "CVE-2022-27672",
                    "CVE-2023-0394",
                    "CVE-2023-1073",
                    "CVE-2023-1074",
                    "CVE-2023-1075",
                    "CVE-2023-1078",
                    "CVE-2023-1281",
                    "CVE-2023-23559",
                    "CVE-2023-26545"
                ]
            },
            "timestamp": "2023-03-28 00:49:05.000000",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1@6.1.0-1008.8?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-6.1.0-1008-oem@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-6.1.0-1008-oem@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.1.0-1008-oem@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-6.1.0-1008-oem-dbgsym@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-6.1.0-1008-oem@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-ipu6-6.1.0-1008-oem@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-ivsc-6.1.0-1008-oem@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1008@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1008@6.1.0-1008.8?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1008@6.1.0-1008.8?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1008@6.1.0-1008.8?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1008@6.1.0-1008.8?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1008@6.1.0-1008.8?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-headers-6.1.0-1008@6.1.0-1008.8?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-6.1.0-1008@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1008.8?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1008.8?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1008.8?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1008.8?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1008.8?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1008.8?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-6.1-tools-host@6.1.0-1008.8?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-6.1.0-1008-oem@6.1.0-1008.8?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}