{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5348-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:40.872396",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5348-2",
                "name": "USN-5348-2",
                "description": "USN-5348-1 fixed several vulnerabilities in Smarty. This update provides the fixes for CVE-2021-21408, CVE-2021-26119, CVE-2021-26120 and CVE-2021-29454 for Ubuntu 16.04 ESM.  Original advisory details:   David Gnedt and Thomas Konrad discovered that Smarty was incorrectly  sanitizing the paths present in the templates. An attacker could possibly  use this use to read arbitrary files when controlling the executed  template. (CVE-2018-13982)   It was discovered that Smarty was incorrectly sanitizing the paths  present in the templates. An attacker could possibly use this use to read  arbitrary files when controlling the executed template. (CVE-2018-16831)   It was discovered that Smarty was incorrectly validating security policy  data, allowing the execution of static classes even when not permitted by  the security settings. An attacker could possibly use this issue to  execute arbitrary code. (CVE-2021-21408)   It was discovered that Smarty was incorrectly managing access control to  template objects, which allowed users to perform a sandbox escape. An  attacker could possibly use this issue to send specially crafted input to  applications that use Smarty and execute arbitrary code. (CVE-2021-26119)   It was discovered that Smarty was not checking for special characters  when setting function names during plugin compile operations. An attacker  could possibly use this issue to send specially crafted input to  applications that use Smarty and execute arbitrary code. (CVE-2021-26120)   It was discovered that Smarty was incorrectly sanitizing characters in  math strings processed by the math function. An attacker could possibly  use this issue to send specially crafted input to applications that use  Smarty and execute arbitrary code. (CVE-2021-29454)",
                "aliases": [
                    "CVE-2021-21408",
                    "CVE-2021-26119",
                    "CVE-2021-26120",
                    "CVE-2021-29454"
                ]
            },
            "timestamp": "2022-03-28 13:22:18.709387",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/smarty3@3.1.21-1ubuntu1+esm1?arch=source&distro=esm-apps/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/smarty3@3.1.21-1ubuntu1+esm1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/smarty3@3.1.21-1ubuntu1+esm1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/smarty3@3.1.21-1ubuntu1+esm1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/smarty3@3.1.21-1ubuntu1+esm1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/smarty3@3.1.21-1ubuntu1+esm1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/smarty3@3.1.21-1ubuntu1+esm1?arch=s390x"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in Smarty. Available with Ubuntu Pro."
        }
    ]
}