{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4019-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:38.653209",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4019-2",
                "name": "USN-4019-2",
                "description": "USN-4019-1 fixed several vulnerabilities in sqlite3. This update provides the corresponding update for Ubuntu 12.04 ESM and 14.04 ESM.  Original advisory details:   It was discovered that SQLite incorrectly handled certain SQL files.  An attacker could possibly use this issue to execute arbitrary code  or cause a denial of service. (CVE-2017-2518)   It was discovered that SQLite incorrectly handled certain queries.  An attacker could possibly use this issue to execute arbitrary code.  (CVE-2018-20346, CVE-2018-20506)   It was discovered that SQLite incorrectly handled certain inputs.  An attacker could possibly use this issue to access sensitive information.  (CVE-2019-8457)   It was discovered that SQLite incorrectly handled certain inputs.  An attacker could possibly use this issue to cause a denial of service.  (CVE-2016-6153)   It was discovered that SQLite incorrectly handled certain databases.  An attacker could possibly use this issue to access sensitive information.  This issue only affected Ubuntu 14.04 LTS. (CVE-2017-10989)   It was discovered that SQLite incorrectly handled certain files.  An attacker could possibly use this issue to cause a denial of service.  (CVE-2017-13685)",
                "aliases": [
                    "CVE-2016-6153",
                    "CVE-2017-2518",
                    "CVE-2017-10989",
                    "CVE-2017-13685",
                    "CVE-2018-20346",
                    "CVE-2018-20506",
                    "CVE-2019-8457"
                ]
            },
            "timestamp": "2019-06-19 17:21:01.605793",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/sqlite3@3.8.2-1ubuntu2.2+esm1?arch=source&distro=trusty"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in SQLite. Available with Ubuntu Pro."
        }
    ]
}