{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5115-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:40.491079",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5115-1",
                "name": "USN-5115-1",
                "description": "It was discovered that a race condition existed in the Atheros Ath9k WiFi driver in the Linux kernel. An attacker could possibly use this to expose sensitive information (WiFi network traffic). (CVE-2020-3702)  Ofek Kirzner, Adam Morrison, Benedict Schlueter, and Piotr Krysiuk discovered that the BPF verifier in the Linux kernel missed possible mispredicted branches due to type confusion, allowing a side-channel attack. An attacker could use this to expose sensitive information. (CVE-2021-33624)  Benedict Schlueter discovered that the BPF subsystem in the Linux kernel did not properly protect against Speculative Store Bypass (SSB) side- channel attacks in some situations. A local attacker could possibly use this to expose sensitive information. (CVE-2021-34556)  Piotr Krysiuk discovered that the BPF subsystem in the Linux kernel did not properly protect against Speculative Store Bypass (SSB) side-channel attacks in some situations. A local attacker could possibly use this to expose sensitive information. (CVE-2021-35477)  It was discovered that the tracing subsystem in the Linux kernel did not properly keep track of per-cpu ring buffer state. A privileged attacker could use this to cause a denial of service. (CVE-2021-3679)  It was discovered that the Option USB High Speed Mobile device driver in the Linux kernel did not properly handle error conditions. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-37159)  Alois Wohlschlager discovered that the overlay file system in the Linux kernel did not restrict private clones in some situations. An attacker could use this to expose sensitive information. (CVE-2021-3732)  It was discovered that the btrfs file system in the Linux kernel did not properly handle removing a non-existent device id. An attacker with CAP_SYS_ADMIN could use this to cause a denial of service. (CVE-2021-3739)  It was discovered that the Qualcomm IPC Router protocol implementation in the Linux kernel did not properly validate metadata in some situations. A local attacker could use this to cause a denial of service (system crash) or expose sensitive information. (CVE-2021-3743)  It was discovered that the virtual terminal (vt) device implementation in the Linux kernel contained a race condition in its ioctl handling that led to an out-of-bounds read vulnerability. A local attacker could possibly use this to expose sensitive information. (CVE-2021-3753)  It was discovered that the Linux kernel did not properly account for the memory usage of certain IPC objects. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2021-3759)  It was discovered that the BPF subsystem in the Linux kernel contained an integer overflow in its hash table implementation. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-38166)  It was discovered that the MAX-3421 host USB device driver in the Linux kernel did not properly handle device removal events. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2021-38204)  It was discovered that the Xilinx 10/100 Ethernet Lite device driver in the Linux kernel could report pointer addresses in some situations. An attacker could use this information to ease the exploitation of another vulnerability. (CVE-2021-38205)  It was discovered that the ext4 file system in the Linux kernel contained a race condition when writing xattrs to an inode. A local attacker could use this to cause a denial of service or possibly gain administrative privileges. (CVE-2021-40490)  It was discovered that the 6pack network protocol driver in the Linux kernel did not properly perform validation checks. A privileged attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2021-42008)",
                "aliases": [
                    "CVE-2020-3702",
                    "CVE-2021-3679",
                    "CVE-2021-3732",
                    "CVE-2021-3739",
                    "CVE-2021-3743",
                    "CVE-2021-3753",
                    "CVE-2021-3759",
                    "CVE-2021-33624",
                    "CVE-2021-34556",
                    "CVE-2021-35477",
                    "CVE-2021-37159",
                    "CVE-2021-38166",
                    "CVE-2021-38204",
                    "CVE-2021-38205",
                    "CVE-2021-40490",
                    "CVE-2021-42008"
                ]
            },
            "timestamp": "2021-10-20 18:39:34.699929",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10@5.10.0-1050.52?arch=source&distro=focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.10.0-1050-oem@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.10.0-1050-oem@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.10.0-1050-oem@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.10.0-1050-oem-dbgsym@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.10.0-1050-oem@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-headers-5.10.0-1050@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-headers-5.10.0-1050@5.10.0-1050.52?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-headers-5.10.0-1050@5.10.0-1050.52?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-headers-5.10.0-1050@5.10.0-1050.52?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-headers-5.10.0-1050@5.10.0-1050.52?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-headers-5.10.0-1050@5.10.0-1050.52?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-headers-5.10.0-1050@5.10.0-1050.52?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-5.10.0-1050@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-host@5.10.0-1050.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-host@5.10.0-1050.52?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-host@5.10.0-1050.52?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-host@5.10.0-1050.52?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-host@5.10.0-1050.52?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-host@5.10.0-1050.52?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.10-tools-host@5.10.0-1050.52?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.10.0-1050-oem@5.10.0-1050.52?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}