{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2476-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:28.553720",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2476-1",
                "name": "USN-2476-1",
                "description": "Several memory corruption bugs were discovered in ICU. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7923, CVE-2014-7926)  A use-after-free was discovered in the IndexedDB implementation. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-7924)  A use-after free was discovered in the WebAudio implementation in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7925)  Several memory corruption bugs were discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7927, CVE-2014-7928, CVE-2014-7931)  Several use-after free bugs were discovered in the DOM implementation in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7929, CVE-2014-7930, CVE-2014-7932, CVE-2014-7934)  A use-after free was discovered in FFmpeg. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7933)  Multiple off-by-one errors were discovered in FFmpeg. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7937)  A memory corruption bug was discovered in the fonts implementation. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7938)  It was discovered that ICU did not initialize memory for a data structure correctly. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7940)  It was discovered that the fonts implementation did not initialize memory for a data structure correctly. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-7942)  An out-of-bounds read was discovered in Skia. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash. (CVE-2014-7943)  An out-of-bounds read was discovered in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash. (CVE-2014-7946)  It was discovered that the AppCache proceeded with caching for SSL sessions even if there is a certificate error. A remote attacker could potentially exploit this by conducting a MITM attack to modify HTML application content. (CVE-2014-7948)  Multiple security issues were discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2015-1205)  Multiple security issues were discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to read uninitialized memory, cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2015-1346)",
                "aliases": [
                    "CVE-2014-7923",
                    "CVE-2014-7924",
                    "CVE-2014-7925",
                    "CVE-2014-7926",
                    "CVE-2014-7927",
                    "CVE-2014-7928",
                    "CVE-2014-7929",
                    "CVE-2014-7930",
                    "CVE-2014-7931",
                    "CVE-2014-7932",
                    "CVE-2014-7933",
                    "CVE-2014-7934",
                    "CVE-2014-7937",
                    "CVE-2014-7938",
                    "CVE-2014-7940",
                    "CVE-2014-7942",
                    "CVE-2014-7943",
                    "CVE-2014-7946",
                    "CVE-2014-7948",
                    "CVE-2015-1205",
                    "CVE-2015-1346"
                ]
            },
            "timestamp": "2015-01-26 21:01:30.432656",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/oxide-qt@1.4.2-0ubuntu0.14.04.1?arch=src?distro=ubuntu/trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtquick0@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-chromedriver@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.4.2-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.4.2-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.4.2-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.4.2-0ubuntu0.14.04.1?arch=i386"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in Oxide."
        }
    ]
}