{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6446-3",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:42.634103",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6446-3",
                "name": "USN-6446-3",
                "description": "Ross Lagerwall discovered that the Xen netback backend driver in the Linux kernel did not properly handle certain unusual packets from a paravirtualized network frontend, leading to a buffer overflow. An attacker in a guest VM could use this to cause a denial of service (host system crash) or possibly execute arbitrary code. (CVE-2023-34319)  Bien Pham discovered that the netfiler subsystem in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4244)  Kyle Zeng discovered that the networking stack implementation in the Linux kernel did not properly validate skb object size in certain conditions. An attacker could use this cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-42752)  Kyle Zeng discovered that the netfiler subsystem in the Linux kernel did not properly calculate array offsets, leading to a out-of-bounds write vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-42753)  Kyle Zeng discovered that the IPv4 Resource Reservation Protocol (RSVP) classifier implementation in the Linux kernel contained an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash). Please note that kernel packet classifier support for RSVP has been removed to resolve this vulnerability. (CVE-2023-42755)  Kyle Zeng discovered that the netfilter subsystem in the Linux kernel contained a race condition in IP set operations in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-42756)  Bing-Jhong Billy Jheng discovered that the Unix domain socket implementation in the Linux kernel contained a race condition in certain situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4622)  Budimir Markovic discovered that the qdisc implementation in the Linux kernel did not properly validate inner classes, leading to a use-after-free vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4623)  Alex Birnberg discovered that the netfilter subsystem in the Linux kernel did not properly validate register length, leading to an out-of- bounds write vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-4881)  It was discovered that the Quick Fair Queueing scheduler implementation in the Linux kernel did not properly handle network packets in certain conditions, leading to a use after free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4921)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle removal of rules from chain bindings in certain circumstances, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-5197)",
                "aliases": [
                    "CVE-2023-4244",
                    "CVE-2023-4622",
                    "CVE-2023-4623",
                    "CVE-2023-4921",
                    "CVE-2023-5197",
                    "CVE-2023-34319",
                    "CVE-2023-42752",
                    "CVE-2023-42753",
                    "CVE-2023-42755",
                    "CVE-2023-42756"
                ]
            },
            "timestamp": "2023-10-26 11:50:35.837047",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15@5.15.0-1046.52~20.04.1?arch=source&distro=focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1046-oracle-dbgsym@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1046-oracle-dbgsym@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-headers-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-headers-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-headers-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-headers-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-headers-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-headers-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-headers-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-tools-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oracle-5.15-tools-5.15.0-1046@5.15.0-1046.52~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.15.0-1046-oracle@5.15.0-1046.52~20.04.1?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}