{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4127-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:38.855010",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4127-2",
                "name": "USN-4127-2",
                "description": "USN-4127-1 fixed several vulnerabilities in Python. This update provides the corresponding update for Ubuntu 12.04 ESM and Ubuntu 14.04 ESM.  Original advisory details:   It was discovered that Python incorrectly handled certain pickle files. An  attacker could possibly use this issue to consume memory, leading to a  denial of service. This issue only affected Ubuntu 14.04 ESM. (CVE-2018-20406)   It was discovered that Python incorrectly validated the domain when  handling cookies. An attacker could possibly trick Python into sending  cookies to the wrong domain. (CVE-2018-20852)   Jonathan Birch and Panayiotis Panayiotou discovered that Python incorrectly  handled Unicode encoding during NFKC normalization. An attacker could  possibly use this issue to obtain sensitive information. (CVE-2019-9636,  CVE-2019-10160)   Colin Read and Nicolas Edet discovered that Python incorrectly handled  parsing certain X509 certificates. An attacker could possibly use this  issue to cause Python to crash, resulting in a denial of service. This  issue only affected Ubuntu 14.04 ESM. (CVE-2019-5010)   It was discovered that Python incorrectly handled certain urls. A remote  attacker could possibly use this issue to perform CRLF injection attacks.  (CVE-2019-9740, CVE-2019-9947)   Sihoon Lee discovered that Python incorrectly handled the local_file:  scheme. A remote attacker could possibly use this issue to bypass blocklist  meschanisms. (CVE-2019-9948)",
                "aliases": [
                    "CVE-2018-20406",
                    "CVE-2018-20852",
                    "CVE-2019-5010",
                    "CVE-2019-9636",
                    "CVE-2019-9740",
                    "CVE-2019-9947",
                    "CVE-2019-9948",
                    "CVE-2019-10160"
                ]
            },
            "timestamp": "2019-09-10 13:08:17.663523",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/python2.7@2.7.6-8ubuntu0.6+esm2?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/python3.4@3.4.3-1ubuntu1~14.04.7+esm2?arch=source&distro=trusty"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in Python. Available with Ubuntu Pro."
        }
    ]
}