{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-3161-3",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:37.069808",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-3161-3",
                "name": "USN-3161-3",
                "description": "Tilman Schmidt and Sasha Levin discovered a use-after-free condition in the TTY implementation in the Linux kernel. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2015-8964)  It was discovered that the Video For Linux Two (v4l2) implementation in the Linux kernel did not properly handle multiple planes when processing a VIDIOC_DQBUF ioctl(). A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-4568)  CAI Qian discovered that shared bind mounts in a mount namespace exponentially added entries without restriction to the Linux kernel's mount table. A local attacker could use this to cause a denial of service (system crash). (CVE-2016-6213)  Ondrej Kozina discovered that the keyring interface in the Linux kernel contained a buffer overflow when displaying timeout events via the /proc/keys interface. A local attacker could use this to cause a denial of service (system crash). (CVE-2016-7042)  Andreas Gruenbacher and Jan Kara discovered that the filesystem implementation in the Linux kernel did not clear the setgid bit during a setxattr call. A local attacker could use this to possibly elevate group privileges. (CVE-2016-7097)  Marco Grassi discovered that the driver for Areca RAID Controllers in the Linux kernel did not properly validate control messages. A local attacker could use this to cause a denial of service (system crash) or possibly gain privileges. (CVE-2016-7425)  It was discovered that the KVM implementation for x86/x86_64 in the Linux kernel could dereference a null pointer. An attacker in a guest virtual machine could use this to cause a denial of service (system crash) in the KVM host. (CVE-2016-8630)  Eyal Itkin discovered that the IP over IEEE 1394 (FireWire) implementation in the Linux kernel contained a buffer overflow when handling fragmented packets. A remote attacker could use this to possibly execute arbitrary code with administrative privileges. (CVE-2016-8633)  Marco Grassi discovered that the TCP implementation in the Linux kernel mishandles socket buffer (skb) truncation. A local attacker could use this to cause a denial of service (system crash). (CVE-2016-8645)  Daxing Guo discovered a stack-based buffer overflow in the Broadcom IEEE802.11n FullMAC driver in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly gain privileges. (CVE-2016-8658)  It was discovered that an information leak existed in __get_user_asm_ex() in the Linux kernel. A local attacker could use this to expose sensitive information. (CVE-2016-9178)  Andrey Konovalov discovered that the SCTP implementation in the Linux kernel improperly handled validation of incoming data. A remote attacker could use this to cause a denial of service (system crash). (CVE-2016-9555)",
                "aliases": [
                    "CVE-2015-8964",
                    "CVE-2016-4568",
                    "CVE-2016-6213",
                    "CVE-2016-7042",
                    "CVE-2016-7097",
                    "CVE-2016-7425",
                    "CVE-2016-8630",
                    "CVE-2016-8633",
                    "CVE-2016-8645",
                    "CVE-2016-8658",
                    "CVE-2016-9178",
                    "CVE-2016-9555"
                ]
            },
            "timestamp": "2016-12-20 21:31:04.945901",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2@4.4.0-1038.45?arch=source&distro=xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.4.0-1038-raspi2@4.4.0-1038.45?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1038-raspi2@4.4.0-1038.45?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1038-raspi2-dbgsym@4.4.0-1038.45?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-headers-4.4.0-1038@4.4.0-1038.45?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-tools-4.4.0-1038@4.4.0-1038.45?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-tools-4.4.0-1038-dbgsym@4.4.0-1038.45?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.4.0-1038-raspi2@4.4.0-1038.45?arch=armhf"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the kernel."
        }
    ]
}