{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6397-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.370711",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6397-1",
                "name": "USN-6397-1",
                "description": "Daniel Moghimi discovered that some Intel(R) Processors did not properly clear microarchitectural state after speculative execution of various instructions. A local unprivileged user could use this to obtain to sensitive information. (CVE-2022-40982)  Ruihan Li discovered that the bluetooth subsystem in the Linux kernel did not properly perform permissions checks when handling HCI sockets. A physically proximate attacker could use this to cause a denial of service (bluetooth communication). (CVE-2023-2002)  Tavis Ormandy discovered that some AMD processors did not properly handle speculative execution of certain vector register instructions. A local attacker could use this to expose sensitive information. (CVE-2023-20593)  Zi Fan Tan discovered that the binder IPC implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-21255)  Juan Jose Lopez Jaimez, Meador Inge, Simon Scannell, and Nenad Stojanovski discovered that the BPF verifier in the Linux kernel did not properly mark registers for precision tracking in certain situations, leading to an out- of-bounds access vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-2163)  Zheng Zhang discovered that the device-mapper implementation in the Linux kernel did not properly handle locking during table_clear() operations. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2023-2269)  It was discovered that the DVB Core driver in the Linux kernel did not properly handle locking events in certain situations. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2023-31084)  It was discovered that the kernel->user space relay implementation in the Linux kernel did not properly perform certain buffer calculations, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash) or expose sensitive information (kernel memory). (CVE-2023-3268)  It was discovered that the video4linux driver for Philips based TV cards in the Linux kernel contained a race condition during device removal, leading to a use-after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-35823)  It was discovered that the SDMC DM1105 PCI device driver in the Linux kernel contained a race condition during device removal, leading to a use- after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-35824)  It was discovered that the Renesas USB controller driver in the Linux kernel contained a race condition during device removal, leading to a use- after-free vulnerability. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-35828)  It was discovered that the universal 32bit network packet classifier implementation in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3609)  It was discovered that the Quick Fair Queueing network scheduler implementation in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3611)  It was discovered that the network packet classifier with netfilter/firewall marks implementation in the Linux kernel did not properly handle reference counting, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3776)",
                "aliases": [
                    "CVE-2022-40982",
                    "CVE-2023-2002",
                    "CVE-2023-2163",
                    "CVE-2023-2269",
                    "CVE-2023-3268",
                    "CVE-2023-3609",
                    "CVE-2023-3611",
                    "CVE-2023-3776",
                    "CVE-2023-20593",
                    "CVE-2023-21255",
                    "CVE-2023-31084",
                    "CVE-2023-35823",
                    "CVE-2023-35824",
                    "CVE-2023-35828"
                ]
            },
            "timestamp": "2023-09-26 20:39:11.954401",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield@5.4.0-1070.76?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1070@5.4.0-1070.76?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1070@5.4.0-1070.76?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1070@5.4.0-1070.76?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1070@5.4.0-1070.76?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1070@5.4.0-1070.76?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1070@5.4.0-1070.76?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1070@5.4.0-1070.76?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-tools-5.4.0-1070@5.4.0-1070.76?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1070-bluefield@5.4.0-1070.76?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1070-bluefield@5.4.0-1070.76?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1070-bluefield@5.4.0-1070.76?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1070-bluefield-dbgsym@5.4.0-1070.76?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1070-bluefield@5.4.0-1070.76?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1070-bluefield@5.4.0-1070.76?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}