{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6440-3",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:42.616255",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6440-3",
                "name": "USN-6440-3",
                "description": "Seth Jenkins discovered that the Linux kernel did not properly perform address randomization for a per-cpu memory management structure. A local attacker could use this to expose sensitive information (kernel memory) or in conjunction with another kernel vulnerability. (CVE-2023-0597)  It was discovered that the IPv6 implementation in the Linux kernel contained a high rate of hash collisions in connection lookup table. A remote attacker could use this to cause a denial of service (excessive CPU consumption). (CVE-2023-1206)  Yu Hao and Weiteng Chen discovered that the Bluetooth HCI UART driver in the Linux kernel contained a race condition, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-31083)  Ross Lagerwall discovered that the Xen netback backend driver in the Linux kernel did not properly handle certain unusual packets from a paravirtualized network frontend, leading to a buffer overflow. An attacker in a guest VM could use this to cause a denial of service (host system crash) or possibly execute arbitrary code. (CVE-2023-34319)  Lin Ma discovered that the Netlink Transformation (XFRM) subsystem in the Linux kernel contained a null pointer dereference vulnerability in some situations. A local privileged attacker could use this to cause a denial of service (system crash). (CVE-2023-3772)  Kyle Zeng discovered that the networking stack implementation in the Linux kernel did not properly validate skb object size in certain conditions. An attacker could use this cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-42752)  Kyle Zeng discovered that the netfiler subsystem in the Linux kernel did not properly calculate array offsets, leading to a out-of-bounds write vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-42753)  Kyle Zeng discovered that the IPv4 Resource Reservation Protocol (RSVP) classifier implementation in the Linux kernel contained an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash). Please note that kernel packet classifier support for RSVP has been removed to resolve this vulnerability. (CVE-2023-42755)  Bing-Jhong Billy Jheng discovered that the Unix domain socket implementation in the Linux kernel contained a race condition in certain situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4622)  Budimir Markovic discovered that the qdisc implementation in the Linux kernel did not properly validate inner classes, leading to a use-after-free vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4623)  Alex Birnberg discovered that the netfilter subsystem in the Linux kernel did not properly validate register length, leading to an out-of- bounds write vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-4881)  It was discovered that the Quick Fair Queueing scheduler implementation in the Linux kernel did not properly handle network packets in certain conditions, leading to a use after free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4921)",
                "aliases": [
                    "CVE-2023-0597",
                    "CVE-2023-1206",
                    "CVE-2023-3772",
                    "CVE-2023-4622",
                    "CVE-2023-4623",
                    "CVE-2023-4921",
                    "CVE-2023-31083",
                    "CVE-2023-34319",
                    "CVE-2023-42752",
                    "CVE-2023-42753",
                    "CVE-2023-42755"
                ]
            },
            "timestamp": "2023-10-25 12:43:02.312357",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe@4.15.0-1162.175~16.04.1?arch=source&distro=esm-infra/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe-cloud-tools-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe-tools-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-hwe-tools-4.15.0-1162@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1162-aws-dbgsym@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1162-aws-dbgsym@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1162-aws@4.15.0-1162.175~16.04.1?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}