{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5693-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:41.437674",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5693-1",
                "name": "USN-5693-1",
                "description": "David Bouman and Billy Jheng Bing Jhong discovered that a race condition existed in the io_uring subsystem in the Linux kernel, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-2602)  Duoming Zhou discovered that race conditions existed in the timer handling implementation of the Linux kernel's Rose X.25 protocol layer, resulting in use-after-free vulnerabilities. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-2318)  Hao Sun and Jiacheng Xu discovered that the NILFS file system implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-2978)  Abhishek Shah discovered a race condition in the PF_KEYv2 implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2022-3028)  Xingyuan Mo and Gengjia Chen discovered that the Promise SuperTrak EX storage controller driver in the Linux kernel did not properly handle certain structures. A local attacker could potentially use this to expose sensitive information (kernel memory). (CVE-2022-40768)  Sönke Huster discovered that an integer overflow vulnerability existed in the WiFi driver stack in the Linux kernel, leading to a buffer overflow. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41674)  Sönke Huster discovered that a use-after-free vulnerability existed in the WiFi driver stack in the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-42719)  Sönke Huster discovered that the WiFi driver stack in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-42720)  Sönke Huster discovered that the WiFi driver stack in the Linux kernel did not properly handle BSSID/SSID lists in some situations. A physically proximate attacker could use this to cause a denial of service (infinite loop). (CVE-2022-42721)  Sönke Huster discovered that the WiFi driver stack in the Linux kernel contained a NULL pointer dereference vulnerability in certain situations. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2022-42722)",
                "aliases": [
                    "CVE-2022-2318",
                    "CVE-2022-2602",
                    "CVE-2022-2978",
                    "CVE-2022-3028",
                    "CVE-2022-40768",
                    "CVE-2022-41674",
                    "CVE-2022-42719",
                    "CVE-2022-42720",
                    "CVE-2022-42721",
                    "CVE-2022-42722"
                ]
            },
            "timestamp": "2022-10-19 22:16:57.869272",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17@5.17.0-1020.21?arch=source&distro=jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.17.0-1020-oem@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.17.0-1020-oem@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.17.0-1020-oem@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.17.0-1020-oem-dbgsym@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.17.0-1020-oem@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-5.17.0-1020-oem@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1020@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1020@5.17.0-1020.21?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1020@5.17.0-1020.21?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1020@5.17.0-1020.21?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1020@5.17.0-1020.21?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1020@5.17.0-1020.21?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1020@5.17.0-1020.21?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-5.17.0-1020@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1020.21?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1020.21?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1020.21?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1020.21?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1020.21?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1020.21?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1020.21?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.17.0-1020-oem@5.17.0-1020.21?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}