{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2298-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:36.227874",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2298-1",
                "name": "USN-2298-1",
                "description": "A type confusion bug was discovered in V8. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-1730)  A type confusion bug was discovered in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash, or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-1731)  Multiple security issues including memory safety bugs were discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-1735, CVE-2014-3162)  Multiple use-after-free issues were discovered in the WebSockets implementation. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-1740)  Multiple integer overflows were discovered in CharacterData implementation. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-1741)  Multiple use-after-free issues were discovered in Blink. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit these to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-1742, CVE-2014-1743)  An integer overflow bug was discovered in Chromium. If a user were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-1744)  An out-of-bounds read was discovered in Chromium. If a user were tricked in to opening a specially crafter website, an attacker could potentially exploit this to cause a denial of service via application crash. (CVE-2014-1746)  It was discovered that Blink allowed scrollbar painting to extend in to the parent frame in some circumstances. An attacker could potentially exploit this to conduct clickjacking attacks via UI redress. (CVE-2014-1748)  An integer underflow was discovered in Blink. If a user were tricked in to opening a specially crafter website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-3152)  A use-after-free was discovered in Chromium. If a use were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-3154)  A security issue was discovered in the SPDY implementation. An attacker could potentially exploit this to cause a denial of service via application crash or execute arbitrary code with the privileges of the user invoking the program. (CVE-2014-3155)  A heap overflow was discovered in Chromium. If a use were tricked in to opening a specially crafted website, an attacker could potentially exploit this to cause a denial of service via renderer crash or execute arbitrary code with the privileges of the sandboxed render process. (CVE-2014-3157)  It was discovered that Blink did not enforce security rules for subresource loading in SVG images. If a user opened a site that embedded a specially crafted image, an attacker could exploit this to log page views. (CVE-2014-3160)  It was discovered that the SpeechInput feature in Blink could be activated without consent or any visible indication. If a user were tricked in to opening a specially crafted website, an attacker could exploit this to eavesdrop on the user. (CVE-2014-3803)",
                "aliases": [
                    "CVE-2014-1730",
                    "CVE-2014-1731",
                    "CVE-2014-1735",
                    "CVE-2014-1740",
                    "CVE-2014-1741",
                    "CVE-2014-1742",
                    "CVE-2014-1743",
                    "CVE-2014-1744",
                    "CVE-2014-1746",
                    "CVE-2014-1748",
                    "CVE-2014-3152",
                    "CVE-2014-3154",
                    "CVE-2014-3155",
                    "CVE-2014-3157",
                    "CVE-2014-3160",
                    "CVE-2014-3162",
                    "CVE-2014-3803"
                ]
            },
            "timestamp": "2014-07-23 20:11:47.242599",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/oxide-qt@1.0.4-0ubuntu0.14.04.1?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqt-qmlplugin@1.0.4-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/liboxideqtcore0@1.0.4-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqmlscene@1.0.4-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs@1.0.4-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-dbg@1.0.4-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra@1.0.4-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-codecs-extra-dbg@1.0.4-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.0.4-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.0.4-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/oxideqt-dbg@1.0.4-0ubuntu0.14.04.1?arch=i386"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in Oxide."
        }
    ]
}