{
  "metadata": {
    "@context": "https://openvex.dev/ns/v0.2.0",
    "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-7106-1",
    "author": "Canonical Ltd.",
    "timestamp": "2024-11-13T16:37:08.698433",
    "version": 1
  },
  "statements": [
    {
      "vulnerability": {
        "@id": "https://ubuntu.com/security/notices/USN-7106-1",
        "name": "USN-7106-1",
        "description": "It was discovered that Tomcat did not include the secure attribute for session cookies when using the RemoteIpFilter with requests from a reverse proxy. An attacker could possibly use this issue to leak sensitive information. (CVE-2023-28708)  It was discovered that Tomcat had a vulnerability in its FORM authentication feature, leading to an open redirect attack. An attacker could possibly use this issue to perform phishing attacks. (CVE-2023-41080)  It was discovered that Tomcat incorrectly recycled certain objects, which could lead to information leaking from one request to the next. An attacker could potentially use this issue to leak sensitive information. (CVE-2023-42795)  It was discovered that Tomcat incorrectly handled HTTP trailer headers. A remote attacker could possibly use this issue to perform HTTP request smuggling. (CVE-2023-45648)  It was discovered that Tomcat incorrectly handled socket cleanup, which could lead to websocket connections staying open. An attacker could possibly use this issue to cause a denial of service. (CVE-2024-23672)",
        "aliases": [
          "CVE-2023-28708",
          "CVE-2023-41080",
          "CVE-2023-42795",
          "CVE-2023-45648",
          "CVE-2024-23672"
        ]
      },
      "timestamp": "2024-11-13 07:19:15.406235",
      "products": [
        {
          "@id": "pkg:deb/ubuntu/tomcat9@9.0.16-3ubuntu0.18.04.2+esm4?arch=src?distro=esm-apps/bionic"
        },
        {
          "@id": "pkg:deb/ubuntu/tomcat9@9.0.31-1ubuntu0.8?arch=src?distro=ubuntu/focal"
        },
        {
          "@id": "pkg:deb/ubuntu/tomcat9@9.0.58-1ubuntu0.1+esm4?arch=src?distro=esm-apps/jammy"
        }
      ],
      "status": "fixed",
      "status_notes": "Several security issues were fixed in Tomcat. Available with Ubuntu Pro."
    }
  ]
}