{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2458-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:36.324315",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2458-2",
                "name": "USN-2458-2",
                "description": "USN-2458-1 fixed vulnerabilities in Firefox. This update provides the corresponding version of Ubufox.  Original advisory details:   Christian Holler, Patrick McManus, Christoph Diehl, Gary Kwong, Jesse  Ruderman, Byron Campen, Terrence Cole, and Nils Ohlmeier discovered  multiple memory safety issues in Firefox. If a user were tricked in to  opening a specially crafted website, an attacker could potentially exploit  these to cause a denial of service via application crash, or execute  arbitrary code with the privileges of the user invoking Firefox.  (CVE-2014-8634, CVE-2014-8635)    Bobby Holley discovered that some DOM objects with certain properties  can bypass XrayWrappers in some circumstances. If a user were tricked in  to opening a specially crafted website, an attacker could potentially  exploit this to bypass security restrictions. (CVE-2014-8636)    Michal Zalewski discovered a use of uninitialized memory when rendering  malformed bitmap images on a canvas element. If a user were tricked in to  opening a specially crafted website, an attacker could potentially  exploit this to steal confidential information. (CVE-2014-8637)    Muneaki Nishimura discovered that requests from navigator.sendBeacon()  lack an origin header. If a user were tricked in to opening a specially  crafted website, an attacker could potentially exploit this to conduct  cross-site request forgery (XSRF) attacks. (CVE-2014-8638)    Xiaofeng Zheng discovered that a web proxy returning a 407 response  could inject cookies in to the originally requested domain. If a user  connected to a malicious web proxy, an attacker could potentially exploit  this to conduct session-fixation attacks. (CVE-2014-8639)    Holger Fuhrmannek discovered a crash in Web Audio while manipulating  timelines. If a user were tricked in to opening a specially crafted  website, an attacker could potentially exploit this to cause a denial  of service. (CVE-2014-8640)    Mitchell Harper discovered a use-after-free in WebRTC. If a user were  tricked in to opening a specially crafted website, an attacker could  potentially exploit this to cause a denial of service via application  crash, or execute arbitrary code with the privileges of the user invoking  Firefox. (CVE-2014-8641)    Brian Smith discovered that OCSP responses would fail to verify if signed  by a delegated OCSP responder certificate with the id-pkix-ocsp-nocheck  extension, potentially allowing a user to connect to a site with a revoked  certificate. (CVE-2014-8642)",
                "aliases": []
            },
            "timestamp": "2015-01-14 21:46:02.896134",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.0-0ubuntu0.14.04.1?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.0-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.0-0ubuntu0.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.0-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.0-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.0-0ubuntu0.14.04.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/ubufox@3.0-0ubuntu0.14.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.0-0ubuntu0.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.0-0ubuntu0.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.0-0ubuntu0.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.0-0ubuntu0.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.0-0ubuntu0.14.04.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-ubufox@3.0-0ubuntu0.14.04.1?arch=ppc64el"
                }
            ],
            "status": "fixed",
            "status_notes": "This update provides compatible packages for Firefox 35."
        }
    ]
}