{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4752-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:26.057745",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4752-1",
                "name": "USN-4752-1",
                "description": "Daniele Antonioli, Nils Ole Tippenhauer, and Kasper Rasmussen discovered that legacy pairing and secure-connections pairing authentication in the Bluetooth protocol could allow an unauthenticated user to complete authentication without pairing credentials via adjacent access. A physically proximate attacker could use this to impersonate a previously paired Bluetooth device. (CVE-2020-10135)  Jay Shin discovered that the ext4 file system implementation in the Linux kernel did not properly handle directory access with broken indexing, leading to an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2020-14314)  It was discovered that the block layer implementation in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2020-15436)  It was discovered that the serial port driver in the Linux kernel did not properly initialize a pointer in some situations. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2020-15437)  Andy Nguyen discovered that the Bluetooth HCI event packet parser in the Linux kernel did not properly handle event advertisements of certain sizes, leading to a heap-based buffer overflow. A physically proximate remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-24490)  It was discovered that the NFS client implementation in the Linux kernel did not properly perform bounds checking before copying security labels in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-25212)  It was discovered that the Rados block device (rbd) driver in the Linux kernel did not properly perform privilege checks for access to rbd devices in some situations. A local attacker could use this to map or unmap rbd block devices. (CVE-2020-25284)  It was discovered that the block layer subsystem in the Linux kernel did not properly handle zero-length requests. A local attacker could use this to cause a denial of service. (CVE-2020-25641)  It was discovered that the HDLC PPP implementation in the Linux kernel did not properly validate input in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-25643)  Kiyin (尹亮) discovered that the perf subsystem in the Linux kernel did not properly deallocate memory in some situations. A privileged attacker could use this to cause a denial of service (kernel memory exhaustion). (CVE-2020-25704)  It was discovered that the KVM hypervisor in the Linux kernel did not properly handle interrupts in certain situations. A local attacker in a guest VM could possibly use this to cause a denial of service (host system crash). (CVE-2020-27152)  It was discovered that the jfs file system implementation in the Linux kernel contained an out-of-bounds read vulnerability. A local attacker could use this to possibly cause a denial of service (system crash). (CVE-2020-27815)  It was discovered that an information leak existed in the syscall implementation in the Linux kernel on 32 bit systems. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2020-28588)  It was discovered that the framebuffer implementation in the Linux kernel did not properly perform range checks in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2020-28915)  Jann Horn discovered a race condition in the copy-on-write implementation in the Linux kernel when handling hugepages. A local attacker could use this to gain unintended write access to read-only memory pages. (CVE-2020-29368)  Jann Horn discovered that the mmap implementation in the Linux kernel contained a race condition when handling munmap() operations, leading to a read-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2020-29369)  Jann Horn discovered that the romfs file system in the Linux kernel did not properly validate file system meta-data, leading to an out-of-bounds read. An attacker could use this to construct a malicious romfs image that, when mounted, exposed sensitive information (kernel memory). (CVE-2020-29371)  Jann Horn discovered that the tty subsystem of the Linux kernel did not use consistent locking in some situations, leading to a read-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2020-29660)  Jann Horn discovered a race condition in the tty subsystem of the Linux kernel in the locking for the TIOCSPGRP ioctl(), leading to a use-after- free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2020-29661)  It was discovered that a race condition existed that caused the Linux kernel to not properly restrict exit signal delivery. A local attacker could possibly use this to send signals to arbitrary processes. (CVE-2020-35508)",
                "aliases": [
                    "CVE-2020-10135",
                    "CVE-2020-14314",
                    "CVE-2020-15436",
                    "CVE-2020-15437",
                    "CVE-2020-24490",
                    "CVE-2020-25212",
                    "CVE-2020-25284",
                    "CVE-2020-25641",
                    "CVE-2020-25643",
                    "CVE-2020-25704",
                    "CVE-2020-27152",
                    "CVE-2020-27815",
                    "CVE-2020-28588",
                    "CVE-2020-28915",
                    "CVE-2020-29368",
                    "CVE-2020-29369",
                    "CVE-2020-29371",
                    "CVE-2020-29660",
                    "CVE-2020-29661",
                    "CVE-2020-35508"
                ]
            },
            "timestamp": "2021-02-25 07:54:20.524424",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6@5.6.0-1048.52?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.6.0-1048-oem@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.6.0-1048-oem@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.6.0-1048-oem@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.6.0-1048-oem-dbgsym@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.6.0-1048-oem@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-headers-5.6.0-1048@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-headers-5.6.0-1048@5.6.0-1048.52?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-headers-5.6.0-1048@5.6.0-1048.52?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-headers-5.6.0-1048@5.6.0-1048.52?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-headers-5.6.0-1048@5.6.0-1048.52?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-headers-5.6.0-1048@5.6.0-1048.52?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-headers-5.6.0-1048@5.6.0-1048.52?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-5.6.0-1048@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-host@5.6.0-1048.52?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-host@5.6.0-1048.52?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-host@5.6.0-1048.52?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-host@5.6.0-1048.52?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-host@5.6.0-1048.52?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-host@5.6.0-1048.52?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.6-tools-host@5.6.0-1048.52?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.6.0-1048-oem@5.6.0-1048.52?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}