{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4488-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:39.551523",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4488-2",
                "name": "USN-4488-2",
                "description": "USN-4488-1 fixed several vulnerabilities in X.Org. This update provides the corresponding update and also the update from USN-4490-1 for Ubuntu 14.04 ESM.  Original advisory details:   Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled the  input extension protocol. A local attacker could possibly use this issue to  escalate privileges. (CVE-2020-14346)    Jan-Niklas Sohn discovered that the X.Org X Server incorrectly initialized  memory. A local attacker could possibly use this issue to obtain sensitive  information. (CVE-2020-14347)    Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled the  XkbSelectEvents function. A local attacker could possibly use this issue to  escalate privileges. (CVE-2020-14361)    Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled the  XRecordRegisterClients function. A local attacker could possibly use this  issue to escalate privileges. (CVE-2020-14362)   Jan-Niklas Sohn discovered that the X.Org X Server incorrectly handled the  XkbSetNames function. A local attacker could possibly use this issue to  escalate privileges. (CVE-2020-14345)",
                "aliases": [
                    "CVE-2020-14345",
                    "CVE-2020-14346",
                    "CVE-2020-14347",
                    "CVE-2020-14361",
                    "CVE-2020-14362"
                ]
            },
            "timestamp": "2020-09-09 16:33:35.016224",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/xorg-server@2:1.15.1-0ubuntu2.11+esm2?arch=source&distro=trusty"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in X.Org X Server. Available with Ubuntu Pro."
        }
    ]
}