{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6700-2",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.063662",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6700-2",
                "name": "USN-6700-2",
                "description": "It was discovered that the Layer 2 Tunneling Protocol (L2TP) implementation in the Linux kernel contained a race condition when releasing PPPoL2TP sockets in certain conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-20567)  It was discovered that the ext4 file system implementation in the Linux kernel did not properly handle block device modification while it is mounted. A privileged attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-34256)  Eric Dumazet discovered that the netfilter subsystem in the Linux kernel did not properly handle DCCP conntrack buffers in certain situations, leading to an out-of-bounds read vulnerability. An attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2023-39197)  It was discovered that a race condition existed in the AppleTalk networking subsystem of the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-51781)  It was discovered that the ext4 file system implementation in the Linux kernel did not properly handle the remount operation in certain cases, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2024-0775)  Notselwyn discovered that the netfilter subsystem in the Linux kernel did not properly handle verdict parameters in certain cases, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2024-1086)  It was discovered that a race condition existed in the SCSI Emulex LightPulse Fibre Channel driver in the Linux kernel when unregistering FCF and re-scanning an HBA FCF table, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2024-24855)",
                "aliases": [
                    "CVE-2022-20567",
                    "CVE-2023-34256",
                    "CVE-2023-39197",
                    "CVE-2023-51781",
                    "CVE-2024-0775",
                    "CVE-2024-1086",
                    "CVE-2024-24855"
                ]
            },
            "timestamp": "2024-03-21 21:19:05.543914",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-aws@4.4.0-1167.182?arch=src?distro=esm-infra/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-cloud-tools-4.4.0-1167@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1167@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1167@4.4.0-1167.182?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1167@4.4.0-1167.182?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1167@4.4.0-1167.182?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1167@4.4.0-1167.182?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1167@4.4.0-1167.182?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-tools-4.4.0-1167@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.4.0-1167-aws@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.4.0-1167-aws@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.4.0-1167-aws@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1167-aws@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1167-aws-dbgsym@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.4.0-1167-aws@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.4.0-1167-aws@4.4.0-1167.182?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.4.0-1167-aws@4.4.0-1167.182?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}