{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-3656-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:27.686020",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-3656-1",
                "name": "USN-3656-1",
                "description": "Tuba Yavuz discovered that a double-free error existed in the USBTV007 driver of the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-17975)  It was discovered that a race condition existed in the F2FS implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2017-18193)  It was discovered that a buffer overflow existed in the Hisilicon HNS Ethernet Device driver in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-18222)  It was discovered that the netfilter subsystem in the Linux kernel did not validate that rules containing jumps contained user-defined chains. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-1065)  It was discovered that the netfilter subsystem of the Linux kernel did not properly validate ebtables offsets. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-1068)  It was discovered that a null pointer dereference vulnerability existed in the DCCP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash). (CVE-2018-1130)  It was discovered that the SCTP Protocol implementation in the Linux kernel did not properly validate userspace provided payload lengths in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2018-5803)  It was discovered that a double free error existed in the block layer subsystem of the Linux kernel when setting up a request queue. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-7480)  It was discovered that a memory leak existed in the SAS driver subsystem of the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2018-7757)  It was discovered that a race condition existed in the x86 machine check handler in the Linux kernel. A local privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-7995)  Eyal Itkin discovered that the USB displaylink video adapter driver in the Linux kernel did not properly validate mmap offsets sent from userspace. A local attacker could use this to expose sensitive information (kernel memory) or possibly execute arbitrary code. (CVE-2018-8781)  Silvio Cesare discovered a buffer overwrite existed in the NCPFS implementation in the Linux kernel. A remote attacker controlling a malicious NCPFS server could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2018-8822)",
                "aliases": [
                    "CVE-2017-17975",
                    "CVE-2017-18193",
                    "CVE-2017-18222",
                    "CVE-2018-1065",
                    "CVE-2018-1068",
                    "CVE-2018-1130",
                    "CVE-2018-5803",
                    "CVE-2018-7480",
                    "CVE-2018-7757",
                    "CVE-2018-7995",
                    "CVE-2018-8781",
                    "CVE-2018-8822"
                ]
            },
            "timestamp": "2018-05-23 00:42:32.307253",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2@4.4.0-1090.98?arch=src?distro=ubuntu/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.4.0-1090-raspi2@4.4.0-1090.98?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1090-raspi2@4.4.0-1090.98?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1090-raspi2-dbgsym@4.4.0-1090.98?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-headers-4.4.0-1090@4.4.0-1090.98?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-tools-4.4.0-1090@4.4.0-1090.98?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-raspi2-tools-4.4.0-1090-dbgsym@4.4.0-1090.98?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.4.0-1090-raspi2@4.4.0-1090.98?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-snapdragon@4.4.0-1093.98?arch=src?distro=ubuntu/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.4.0-1093-snapdragon@4.4.0-1093.98?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1093-snapdragon@4.4.0-1093.98?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1093-snapdragon-dbgsym@4.4.0-1093.98?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-snapdragon-headers-4.4.0-1093@4.4.0-1093.98?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-snapdragon-tools-4.4.0-1093@4.4.0-1093.98?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-snapdragon-tools-4.4.0-1093-dbgsym@4.4.0-1093.98?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.4.0-1093-snapdragon@4.4.0-1093.98?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}