{
  "metadata": {
    "@context": "https://openvex.dev/ns/v0.2.0",
    "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6445-1",
    "author": "Canonical Ltd.",
    "timestamp": "2025-07-16T05:54:26.280320",
    "version": 3
  },
  "statements": [
    {
      "vulnerability": {
        "@id": "https://ubuntu.com/security/notices/USN-6445-1",
        "name": "USN-6445-1",
        "description": "It was discovered that the IPv6 implementation in the Linux kernel contained a high rate of hash collisions in connection lookup table. A remote attacker could use this to cause a denial of service (excessive CPU consumption). (CVE-2023-1206)  Daniel Trujillo, Johannes Wikner, and Kaveh Razavi discovered that some AMD processors utilising speculative execution and branch prediction may allow unauthorised memory reads via a speculative side-channel attack. A local attacker could use this to expose sensitive information, including kernel memory. (CVE-2023-20569)  It was discovered that the IPv6 RPL protocol implementation in the Linux kernel did not properly handle user-supplied data. A remote attacker could use this to cause a denial of service (system crash). (CVE-2023-2156)  Davide Ornaghi discovered that the DECnet network protocol implementation in the Linux kernel contained a null pointer dereference vulnerability. A remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. Please note that kernel support for the DECnet has been removed to resolve this CVE. (CVE-2023-3338)  Ross Lagerwall discovered that the Xen netback backend driver in the Linux kernel did not properly handle certain unusual packets from a paravirtualized network frontend, leading to a buffer overflow. An attacker in a guest VM could use this to cause a denial of service (host system crash) or possibly execute arbitrary code. (CVE-2023-34319)  Chih-Yen Chang discovered that the KSMBD implementation in the Linux kernel did not properly validate command payload size, leading to a out-of-bounds read vulnerability. A remote attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-38432)  It was discovered that the NFC implementation in the Linux kernel contained a use-after-free vulnerability when performing peer-to-peer communication in certain conditions. A privileged attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information (kernel memory). (CVE-2023-3863)  Laurence Wit discovered that the KSMBD implementation in the Linux kernel did not properly validate a buffer size in certain situations, leading to an out-of-bounds read vulnerability. A remote attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-3865)  Laurence Wit discovered that the KSMBD implementation in the Linux kernel contained a null pointer dereference vulnerability when handling handling chained requests. A remote attacker could use this to cause a denial of service (system crash). (CVE-2023-3866)  It was discovered that the Siano USB MDTV receiver device driver in the Linux kernel did not properly handle device initialization failures in certain situations, leading to a use-after-free vulnerability. A physically proximate attacker could use this cause a denial of service (system crash). (CVE-2023-4132)  Andy Nguyen discovered that the KVM implementation for AMD processors in the Linux kernel with Secure Encrypted Virtualization (SEV) contained a race condition when accessing the GHCB page. A local attacker in a SEV guest VM could possibly use this to cause a denial of service (host system crash). (CVE-2023-4155)  It was discovered that the TUN/TAP driver in the Linux kernel did not properly initialize socket data. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-4194)  Bien Pham discovered that the netfiler subsystem in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4244)  Maxim Suhanov discovered that the exFAT file system implementation in the Linux kernel did not properly check a file name length, leading to an out- of-bounds write vulnerability. An attacker could use this to construct a malicious exFAT image that, when mounted and operated on, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4273)  Kyle Zeng discovered that the networking stack implementation in the Linux kernel did not properly validate skb object size in certain conditions. An attacker could use this cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-42752)  Kyle Zeng discovered that the netfiler subsystem in the Linux kernel did not properly calculate array offsets, leading to a out-of-bounds write vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-42753)  Kyle Zeng discovered that the IPv4 Resource Reservation Protocol (RSVP) classifier implementation in the Linux kernel contained an out-of-bounds read vulnerability. A local attacker could use this to cause a denial of service (system crash). Please note that kernel packet classifier support for RSVP has been removed to resolve this vulnerability. (CVE-2023-42755)  Kyle Zeng discovered that the netfilter subsystem in the Linux kernel contained a race condition in IP set operations in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-42756)  Thelford Williams discovered that the Ceph file system messenger protocol implementation in the Linux kernel did not properly validate frame segment length in certain situation, leading to a buffer overflow vulnerability. A remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-44466)  Bing-Jhong Billy Jheng discovered that the Unix domain socket implementation in the Linux kernel contained a race condition in certain situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4622)  Budimir Markovic discovered that the qdisc implementation in the Linux kernel did not properly validate inner classes, leading to a use-after-free vulnerability. A local user could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4623)  Alex Birnberg discovered that the netfilter subsystem in the Linux kernel did not properly validate register length, leading to an out-of- bounds write vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-4881)  It was discovered that the Quick Fair Queueing scheduler implementation in the Linux kernel did not properly handle network packets in certain conditions, leading to a use after free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-4921)  Kevin Rich discovered that the netfilter subsystem in the Linux kernel did not properly handle removal of rules from chain bindings in certain circumstances, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2023-5197)",
        "aliases": [
          "CVE-2023-1206",
          "CVE-2023-2156",
          "CVE-2023-3338",
          "CVE-2023-3863",
          "CVE-2023-3865",
          "CVE-2023-3866",
          "CVE-2023-4132",
          "CVE-2023-4155",
          "CVE-2023-4194",
          "CVE-2023-4244",
          "CVE-2023-4273",
          "CVE-2023-4622",
          "CVE-2023-4623",
          "CVE-2023-4881",
          "CVE-2023-4921",
          "CVE-2023-5197",
          "CVE-2023-20569",
          "CVE-2023-34319",
          "CVE-2023-38432",
          "CVE-2023-42752",
          "CVE-2023-42753",
          "CVE-2023-42755",
          "CVE-2023-42756",
          "CVE-2023-44466"
        ]
      },
      "timestamp": "2023-10-19 23:18:13.639278",
      "products": [
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg@5.15.0-1043.49?arch=source&distro=jammy"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-buildinfo-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-cloud-tools-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-headers-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1043-intel-iotg-dbgsym@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-5.15.0-1043@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-common@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-common@5.15.0-1043.49?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-common@5.15.0-1043.49?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-common@5.15.0-1043.49?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-common@5.15.0-1043.49?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-common@5.15.0-1043.49?arch=riscv64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-cloud-tools-common@5.15.0-1043.49?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-headers-5.15.0-1043@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-headers-5.15.0-1043@5.15.0-1043.49?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-headers-5.15.0-1043@5.15.0-1043.49?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-headers-5.15.0-1043@5.15.0-1043.49?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-headers-5.15.0-1043@5.15.0-1043.49?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-headers-5.15.0-1043@5.15.0-1043.49?arch=riscv64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-headers-5.15.0-1043@5.15.0-1043.49?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-5.15.0-1043@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-common@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-common@5.15.0-1043.49?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-common@5.15.0-1043.49?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-common@5.15.0-1043.49?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-common@5.15.0-1043.49?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-common@5.15.0-1043.49?arch=riscv64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-common@5.15.0-1043.49?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-host@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-host@5.15.0-1043.49?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-host@5.15.0-1043.49?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-host@5.15.0-1043.49?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-host@5.15.0-1043.49?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-host@5.15.0-1043.49?arch=riscv64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-intel-iotg-tools-host@5.15.0-1043.49?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-modules-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-modules-extra-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/linux-tools-5.15.0-1043-intel-iotg@5.15.0-1043.49?arch=amd64"
        }
      ],
      "status": "fixed",
      "status_notes": "Several security issues were fixed in the Linux kernel."
    }
  ]
}