{
  "metadata": {
    "@context": "https://openvex.dev/ns/v0.2.0",
    "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-7330-2",
    "author": "Canonical Ltd.",
    "timestamp": "2025-03-31T04:41:17.987467",
    "version": 1
  },
  "statements": [
    {
      "vulnerability": {
        "@id": "https://ubuntu.com/security/notices/USN-7330-2",
        "name": "USN-7330-2",
        "description": "USN-7330-1 fixed vulnerabilities in Ansible. The update introduced a regression when attempting to install Ansible on Ubuntu 16.04 LTS. This update fixes the problem.  We apologize for the inconvenience.  Original advisory details:   It was discovered that Ansible did not properly verify certain fields  of X.509 certificates. An attacker could possibly use this issue to  spoof SSL servers if they were able to intercept network communications.  This issue only affected Ubuntu 14.04 LTS. (CVE-2015-3908)    Martin Carpenter discovered that certain connection plugins for Ansible  did not properly restrict users. An attacker with local access could  possibly use this issue to escape a restricted environment via symbolic  links misuse. This issue only affected Ubuntu 14.04 LTS. (CVE-2015-6240)    Robin Schneider discovered that Ansible's apt_key module did not properly  verify key fingerprints. A remote attacker could possibly use this issue  to perform key injection, leading to the access of sensitive information.  This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS.  (CVE-2016-8614)    It was discovered that Ansible would expose passwords in certain  instances. An attacker could possibly use specially crafted input  related to this issue to access sensitive information. This issue only  affected  Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2019-10206)    It was discovered that Ansible incorrectly logged sensitive information.  An attacker with local access could possibly use this issue to access  sensitive information. This issue only affected Ubuntu 14.04 LTS, Ubuntu  16.04 LTS, and Ubuntu 18.04 LTS. (CVE-2019-14846)    It was discovered that Ansible's solaris_zone module accepted input  without performing input checking. A remote attacker could possibly use  this issue to enable the execution of arbitrary code. This issue only  affected Ubuntu 16.04 LTS and Ubuntu 18.04 LTS. (CVE-2019-14904)    It was discovered that Ansible did not generate sufficiently random  values, which could lead to the exposure of passwords. An attacker  could possibly use this issue to access sensitive information. This  issue only affected Ubuntu 16.04 LTS and Ubuntu 18.04 LTS.  (CVE-2020-10729)    It was discovered that Ansible's svn module could disclose passwords to  users within the same node. An attacker could possibly use this issue to  access sensitive information. (CVE-2020-1739)",
        "aliases": []
      },
      "timestamp": "2025-03-28 16:32:05.618284",
      "products": [
        {
          "@id": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=source&distro=esm-apps/xenial"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible@2.0.0.2-2ubuntu1.3+esm6?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=s390x"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-node-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=amd64"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-node-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=arm64"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-node-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=armhf"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-node-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=i386"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-node-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=ppc64el"
        },
        {
          "@id": "pkg:deb/ubuntu/ansible-node-fireball@2.0.0.2-2ubuntu1.3+esm6?arch=s390x"
        }
      ],
      "status": "fixed",
      "status_notes": "USN 7330-1 introduced a regression in Ansible. Available with Ubuntu Pro."
    }
  ]
}