{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6331-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.430954",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6331-1",
                "name": "USN-6331-1",
                "description": "It was discovered that the netlink implementation in the Linux kernel did not properly validate policies when parsing attributes in some situations. An attacker could use this to cause a denial of service (infinite recursion). (CVE-2020-36691)  Billy Jheng Bing Jhong discovered that the CIFS network file system implementation in the Linux kernel did not properly validate arguments to ioctl() in some situations. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-0168)  It was discovered that the ext4 file system implementation in the Linux kernel contained a use-after-free vulnerability. An attacker could use this to construct a malicious ext4 file system image that, when mounted, could cause a denial of service (system crash). (CVE-2022-1184)  It was discovered that some AMD x86-64 processors with SMT enabled could speculatively execute instructions using a return address from a sibling thread. A local attacker could possibly use this to expose sensitive information. (CVE-2022-27672)  Daniel Moghimi discovered that some Intel(R) Processors did not properly clear microarchitectural state after speculative execution of various instructions. A local unprivileged user could use this to obtain to sensitive information. (CVE-2022-40982)  William Zhao discovered that the Traffic Control (TC) subsystem in the Linux kernel did not properly handle network packet retransmission in certain situations. A local attacker could use this to cause a denial of service (kernel deadlock). (CVE-2022-4269)  It was discovered that a race condition existed in the qdisc implementation in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-0590)  It was discovered that a race condition existed in the btrfs file system implementation in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1611)  It was discovered that the APM X-Gene SoC hardware monitoring driver in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or expose sensitive information (kernel memory). (CVE-2023-1855)  It was discovered that the ST NCI NFC driver did not properly handle device removal events. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2023-1990)  Tavis Ormandy discovered that some AMD processors did not properly handle speculative execution of certain vector register instructions. A local attacker could use this to expose sensitive information. (CVE-2023-20593)  It was discovered that the XFS file system implementation in the Linux kernel did not properly perform metadata validation when mounting certain images. An attacker could use this to specially craft a file system image that, when mounted, could cause a denial of service (system crash). (CVE-2023-2124)  It was discovered that the SLIMpro I2C device driver in the Linux kernel did not properly validate user-supplied data in some situations, leading to an out-of-bounds write vulnerability. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-2194)  It was discovered that a race condition existed in the TLS subsystem in the Linux kernel, leading to a use-after-free or a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-28466)  It was discovered that the DA9150 charger driver in the Linux kernel did not properly handle device removal, leading to a user-after free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-30772)  It was discovered that the btrfs file system implementation in the Linux kernel did not properly handle error conditions in some situations, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-3111)  It was discovered that the Ricoh R5C592 MemoryStick card reader driver in the Linux kernel contained a race condition during module unload, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3141)  It was discovered that the Qualcomm EMAC ethernet driver in the Linux kernel did not properly handle device removal, leading to a user-after free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-33203)  It was discovered that the universal 32bit network packet classifier implementation in the Linux kernel did not properly perform reference counting in some situations, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3609)  It was discovered that the Quick Fair Queueing network scheduler implementation in the Linux kernel contained an out-of-bounds write vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3611)  It was discovered that the network packet classifier with netfilter/firewall marks implementation in the Linux kernel did not properly handle reference counting, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-3776)",
                "aliases": [
                    "CVE-2022-27672",
                    "CVE-2022-40982",
                    "CVE-2023-3609",
                    "CVE-2023-3611",
                    "CVE-2023-3776",
                    "CVE-2023-20593"
                ]
            },
            "timestamp": "2023-09-01 00:31:05.122529",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure@5.4.0-1114.120?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-cloud-tools-5.4.0-1114@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-cloud-tools-5.4.0-1114@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-5.4.0-1114@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-5.4.0-1114@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-5.4.0-1114@5.4.0-1114.120?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-5.4.0-1114@5.4.0-1114.120?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-5.4.0-1114@5.4.0-1114.120?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-5.4.0-1114@5.4.0-1114.120?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-headers-5.4.0-1114@5.4.0-1114.120?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-tools-5.4.0-1114@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-tools-5.4.0-1114@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1114-azure@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1114-azure@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-5.4.0-1114-azure@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-5.4.0-1114-azure@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1114-azure@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1114-azure@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1114-azure@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1114-azure@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1114-azure-dbgsym@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1114-azure-dbgsym@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1114-azure@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1114-azure@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.4.0-1114-azure@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.4.0-1114-azure@5.4.0-1114.120?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1114-azure@5.4.0-1114.120?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1114-azure@5.4.0-1114.120?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}