{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4191-2",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:27.062269",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4191-2",
                "name": "USN-4191-2",
                "description": "USN-4191-2 fixed a vulnerability in QEMU. This update provides the corresponding update for Ubuntu 14.04 ESM.  Original advisory details:   It was discovered that the LSI SCSI adapter emulator implementation in QEMU  did not properly validate executed scripts. A local attacker could use this  to cause a denial of service. (CVE-2019-12068)   Sergej Schumilo, Cornelius Aschermann and Simon Wörner discovered that the  qxl paravirtual graphics driver implementation in QEMU contained a null  pointer dereference. A local attacker in a guest could use this to cause a  denial of service. (CVE-2019-12155)   Riccardo Schirone discovered that the QEMU bridge helper did not properly  validate network interface names. A local attacker could possibly use this  to bypass ACL restrictions. (CVE-2019-13164)   It was discovered that a heap-based buffer overflow existed in the SLiRP  networking implementation of QEMU. A local attacker in a guest could use  this to cause a denial of service or possibly execute arbitrary code in the  host. (CVE-2019-14378)   It was discovered that a use-after-free vulnerability existed in the SLiRP  networking implementation of QEMU. A local attacker in a guest could use  this to cause a denial of service. (CVE-2019-15890)",
                "aliases": []
            },
            "timestamp": "2019-11-14 01:25:35.646880",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/qemu@2.0.0+dfsg-2ubuntu1.47?arch=src?distro=ubuntu/trusty"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in QEMU."
        }
    ]
}