{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5529-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:25.242088",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5529-1",
                "name": "USN-5529-1",
                "description": "It was discovered that the Atheros ath9k wireless device driver in the Linux kernel did not properly handle some error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1679)  Yongkang Jia discovered that the KVM hypervisor implementation in the Linux kernel did not properly handle guest TLB mapping invalidation requests in some situations. An attacker in a guest VM could use this to cause a denial of service (system crash) in the host OS. (CVE-2022-1789)  Qiuhao Li, Gaoning Pan, and Yongkang Jia discovered that the KVM hypervisor implementation in the Linux kernel did not properly handle an illegal instruction in a guest, resulting in a null pointer dereference. An attacker in a guest VM could use this to cause a denial of service (system crash) in the host OS. (CVE-2022-1852)  Gerald Lee discovered that the NTFS file system implementation in the Linux kernel did not properly handle certain error conditions, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2022-1973)  It was discovered that the netfilter subsystem in the Linux kernel contained a buffer overflow in certain situations. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-2078)  It was discovered that some Intel processors did not completely perform cleanup actions on multi-core shared buffers. A local attacker could possibly use this to expose sensitive information. (CVE-2022-21123)  It was discovered that some Intel processors did not completely perform cleanup actions on microarchitectural fill buffers. A local attacker could possibly use this to expose sensitive information. (CVE-2022-21125)  It was discovered that some Intel processors did not properly perform cleanup during specific special register write operations. A local attacker could possibly use this to expose sensitive information. (CVE-2022-21166)  It was discovered that the virtio RPMSG bus driver in the Linux kernel contained a double-free vulnerability in certain error conditions. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-34494, CVE-2022-34495)  Minh Yuan discovered that the floppy disk driver in the Linux kernel contained a race condition, leading to a use-after-free vulnerability. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-1652)",
                "aliases": [
                    "CVE-2022-1652",
                    "CVE-2022-1679",
                    "CVE-2022-1789",
                    "CVE-2022-1852",
                    "CVE-2022-1973",
                    "CVE-2022-2078",
                    "CVE-2022-21123",
                    "CVE-2022-21125",
                    "CVE-2022-21166",
                    "CVE-2022-34494",
                    "CVE-2022-34495"
                ]
            },
            "timestamp": "2022-07-21 02:00:38.393859",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17@5.17.0-1013.14?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.17.0-1013-oem@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.17.0-1013-oem@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.17.0-1013-oem@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.17.0-1013-oem-dbgsym@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.17.0-1013-oem@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-5.17.0-1013-oem@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1013@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1013@5.17.0-1013.14?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1013@5.17.0-1013.14?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1013@5.17.0-1013.14?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1013@5.17.0-1013.14?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1013@5.17.0-1013.14?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1013@5.17.0-1013.14?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-5.17.0-1013@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1013.14?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1013.14?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1013.14?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1013.14?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1013.14?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1013.14?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1013.14?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.17.0-1013-oem@5.17.0-1013.14?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}