{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6071-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.670343",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6071-1",
                "name": "USN-6071-1",
                "description": "It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel did not properly perform filter deactivation in some situations. A local attacker could possibly use this to gain elevated privileges. Please note that with the fix for this CVE, kernel support for the TCINDEX classifier has been removed. (CVE-2023-1829)  Lin Ma discovered a race condition in the io_uring subsystem in the Linux kernel, leading to a null pointer dereference vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0468)  It was discovered that the OverlayFS implementation in the Linux kernel did not properly handle copy up operation in some conditions. A local attacker could possibly use this to gain elevated privileges. (CVE-2023-0386)  David Hildenbrand discovered that a race condition existed in the memory manager of the Linux kernel when handling copy-on-write with shared memory pages. A local attacker could use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-2590)  It was discovered that the sound subsystem in the Linux kernel contained a race condition in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3303)  Gwnaun Jung discovered that the SFB packet scheduling implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3586)  It was discovered that a race condition existed in the EFI capsule loader driver in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-40307)  Zheng Wang and Zhuorao Yang discovered that the RealTek RTL8712U wireless driver in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-4095)  It was discovered that the USB core subsystem in the Linux kernel did not properly handle nested reset events. A local attacker with physical access could plug in a specially crafted USB device to cause a denial of service (kernel deadlock). (CVE-2022-4662)  It was discovered that a race condition existed in the Xen transport layer implementation for the 9P file system protocol in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (guest crash) or expose sensitive information (guest kernel memory). (CVE-2023-1859)  Kyle Zeng discovered that the ATM VC queuing discipline implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-23455)  Lianhui Tang discovered that the MPLS implementation in the Linux kernel did not properly handle certain sysctl allocation failure conditions, leading to a double-free vulnerability. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-26545)",
                "aliases": [
                    "CVE-2022-2590",
                    "CVE-2022-3303",
                    "CVE-2022-3586",
                    "CVE-2022-4095",
                    "CVE-2022-4662",
                    "CVE-2022-40307",
                    "CVE-2023-0386",
                    "CVE-2023-0468",
                    "CVE-2023-1829",
                    "CVE-2023-1859",
                    "CVE-2023-23455",
                    "CVE-2023-26545"
                ]
            },
            "timestamp": "2023-05-10 17:11:53.128758",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17@5.17.0-1031.32?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.17.0-1031-oem-dbgsym@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-ipu6-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-ivsc-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1031@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1031@5.17.0-1031.32?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1031@5.17.0-1031.32?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1031@5.17.0-1031.32?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1031@5.17.0-1031.32?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1031@5.17.0-1031.32?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-headers-5.17.0-1031@5.17.0-1031.32?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-5.17.0-1031@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1031.32?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1031.32?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1031.32?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1031.32?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1031.32?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1031.32?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.17-tools-host@5.17.0-1031.32?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.17.0-1031-oem@5.17.0-1031.32?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}