{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-3566-2",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:37.703149",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-3566-2",
                "name": "USN-3566-2",
                "description": "USN-3566-1 fixed several vulnerabilities in PHP. This update provides the corresponding update for Ubuntu 12.04 ESM and Ubuntu 14.04 ESM.  It was discovered that PHP incorrectly handled certain files. An attacker could possibly use this issue to access sensitive information. (CVE-2018-20783)  It was discovered that PHP incorrectly handled certain files. An attacker could possibly use this issue to access sensitive information or possibly cause a crash, resulting in a denial of service. (CVE-2019-11036)  Original advisory details:   It was discovered that PHP incorrectly handled memory when unserializing  certain data. A remote attacker could use this issue to cause PHP to crash,  resulting in a denial of service, or possibly execute arbitrary code. This  issue only affected Ubuntu 12.04 ESM. (CVE-2017-12933)   It was discovered that PHP incorrectly handled locale length. A remote attacker  could possibly use this issue to cause PHP to crash, resulting in a denial of service.  This issue only affected Ubuntu 12.04 ESM. (CVE-2017-11362)   It was discovered that PHP incorrectly handled certain stream metadata. A remote  attacker could possibly use this issue to set arbitrary metadata. This issue only  affected Ubuntu 12.04 ESM. (CVE-2016-10712)",
                "aliases": [
                    "CVE-2016-10712",
                    "CVE-2017-11362",
                    "CVE-2017-12933",
                    "CVE-2018-20783",
                    "CVE-2019-11036"
                ]
            },
            "timestamp": "2019-05-22 11:58:43.823085",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/php5@5.5.9+dfsg-1ubuntu4.29+esm2?arch=source&distro=trusty"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in PHP. Available with Ubuntu Pro."
        }
    ]
}