{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5683-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:25.098095",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5683-1",
                "name": "USN-5683-1",
                "description": "It was discovered that the framebuffer driver on the Linux kernel did not verify size limits when changing font or screen size, leading to an out-of- bounds write. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2021-33655)  Selim Enes Karaduman discovered that a race condition existed in the General notification queue implementation of the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1882)  Duoming Zhou discovered that race conditions existed in the timer handling implementation of the Linux kernel's Rose X.25 protocol layer, resulting in use-after-free vulnerabilities. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-2318)  Roger Pau Monné discovered that the Xen virtual block driver in the Linux kernel did not properly initialize memory pages to be used for shared communication with the backend. A local attacker could use this to expose sensitive information (guest kernel memory). (CVE-2022-26365)  Pawan Kumar Gupta, Alyssa Milburn, Amit Peled, Shani Rehana, Nir Shildan and Ariel Sabba discovered that some Intel processors with Enhanced Indirect Branch Restricted Speculation (eIBRS) did not properly handle RET instructions after a VM exits. A local attacker could potentially use this to expose sensitive information. (CVE-2022-26373)  Eric Biggers discovered that a use-after-free vulnerability existed in the io_uring subsystem in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3176)  Roger Pau Monné discovered that the Xen paravirtualization frontend in the Linux kernel did not properly initialize memory pages to be used for shared communication with the backend. A local attacker could use this to expose sensitive information (guest kernel memory). (CVE-2022-33740)  It was discovered that the Xen paravirtualization frontend in the Linux kernel incorrectly shared unrelated data when communicating with certain backends. A local attacker could use this to cause a denial of service (guest crash) or expose sensitive information (guest kernel memory). (CVE-2022-33741, CVE-2022-33742)  Jan Beulich discovered that the Xen network device frontend driver in the Linux kernel incorrectly handled socket buffers (skb) references when communicating with certain backends. A local attacker could use this to cause a denial of service (guest crash). (CVE-2022-33743)  Oleksandr Tyshchenko discovered that the Xen paravirtualization platform in the Linux kernel on ARM platforms contained a race condition in certain situations. An attacker in a guest VM could use this to cause a denial of service in the host OS. (CVE-2022-33744)  It was discovered that the virtio RPMSG bus driver in the Linux kernel contained a double-free vulnerability in certain error conditions. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-34494, CVE-2022-34495)  It was discovered that the Netlink Transformation (XFRM) subsystem in the Linux kernel contained a reference counting error. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-36879)  Domingo Dirutigliano and Nicola Guerrera discovered that the netfilter subsystem in the Linux kernel did not properly handle rules that truncated packets below the packet header size. When such rules are in place, a remote attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-36946)  Jann Horn discovered that the KVM subsystem in the Linux kernel did not properly handle TLB flush operations in some situations. A local attacker in a guest VM could use this to cause a denial of service (guest crash) or possibly execute arbitrary code in the guest kernel. (CVE-2022-39189)",
                "aliases": [
                    "CVE-2021-33655",
                    "CVE-2022-1882",
                    "CVE-2022-2318",
                    "CVE-2022-3176",
                    "CVE-2022-26365",
                    "CVE-2022-26373",
                    "CVE-2022-33740",
                    "CVE-2022-33741",
                    "CVE-2022-33742",
                    "CVE-2022-33743",
                    "CVE-2022-33744",
                    "CVE-2022-34494",
                    "CVE-2022-34495",
                    "CVE-2022-36879",
                    "CVE-2022-36946",
                    "CVE-2022-39189"
                ]
            },
            "timestamp": "2022-10-14 22:01:01.024301",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm@5.15.0-1015.17?arch=src?distro=ubuntu/jammy"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.15.0-1015-ibm@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.15.0-1015-ibm@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-cloud-tools-common@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-cloud-tools-common@5.15.0-1015.17?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-cloud-tools-common@5.15.0-1015.17?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-cloud-tools-common@5.15.0-1015.17?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-cloud-tools-common@5.15.0-1015.17?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-cloud-tools-common@5.15.0-1015.17?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-cloud-tools-common@5.15.0-1015.17?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-headers-5.15.0-1015@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-headers-5.15.0-1015@5.15.0-1015.17?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-headers-5.15.0-1015@5.15.0-1015.17?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-headers-5.15.0-1015@5.15.0-1015.17?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-headers-5.15.0-1015@5.15.0-1015.17?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-headers-5.15.0-1015@5.15.0-1015.17?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-headers-5.15.0-1015@5.15.0-1015.17?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-source-5.15.0@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-source-5.15.0@5.15.0-1015.17?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-source-5.15.0@5.15.0-1015.17?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-source-5.15.0@5.15.0-1015.17?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-source-5.15.0@5.15.0-1015.17?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-source-5.15.0@5.15.0-1015.17?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-source-5.15.0@5.15.0-1015.17?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-5.15.0-1015@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-common@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-common@5.15.0-1015.17?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-common@5.15.0-1015.17?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-common@5.15.0-1015.17?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-common@5.15.0-1015.17?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-common@5.15.0-1015.17?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-ibm-tools-common@5.15.0-1015.17?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1015-ibm@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1015-ibm-dbgsym@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.15.0-1015-ibm@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.15.0-1015-ibm@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-5.15.0-1015-ibm@5.15.0-1015.17?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.15.0-1015-ibm@5.15.0-1015.17?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}