{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-6134-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.607676",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-6134-1",
                "name": "USN-6134-1",
                "description": "It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel did not properly perform filter deactivation in some situations. A local attacker could possibly use this to gain elevated privileges. Please note that with the fix for this CVE, kernel support for the TCINDEX classifier has been removed. (CVE-2023-1829)  It was discovered that the Traffic-Control Index (TCINDEX) implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1281)  It was discovered that the OverlayFS implementation in the Linux kernel did not properly handle copy up operation in some conditions. A local attacker could possibly use this to gain elevated privileges. (CVE-2023-0386)  It was discovered that some AMD x86-64 processors with SMT enabled could speculatively execute instructions using a return address from a sibling thread. A local attacker could possibly use this to expose sensitive information. (CVE-2022-27672)  Zheng Wang discovered that the Intel i915 graphics driver in the Linux kernel did not properly handle certain error conditions, leading to a double-free. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-3707)  Haowei Yan discovered that a race condition existed in the Layer 2 Tunneling Protocol (L2TP) implementation in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-4129)  It was discovered that the network queuing discipline implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-47929)  It was discovered that the NTFS file system implementation in the Linux kernel contained a null pointer dereference in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-4842)  Kyle Zeng discovered that the IPv6 implementation in the Linux kernel contained a NULL pointer dereference vulnerability in certain situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-0394)  Jordy Zomer and Alexandra Sandulescu discovered that syscalls invoking the do_prlimit() function in the Linux kernel did not properly handle speculative execution barriers. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-0458)  Jordy Zomer and Alexandra Sandulescu discovered that the Linux kernel did not properly implement speculative execution barriers in usercopy functions in certain situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-0459)  It was discovered that the Human Interface Device (HID) support driver in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2023-1073)  It was discovered that a memory leak existed in the SCTP protocol implementation in the Linux kernel. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2023-1074)  It was discovered that the TLS subsystem in the Linux kernel contained a type confusion vulnerability in some situations. A local attacker could use this to cause a denial of service (system crash) or possibly expose sensitive information. (CVE-2023-1075)  It was discovered that the Reliable Datagram Sockets (RDS) protocol implementation in the Linux kernel contained a type confusion vulnerability in some situations. An attacker could use this to cause a denial of service (system crash). (CVE-2023-1078)  Xingyuan Mo discovered that the x86 KVM implementation in the Linux kernel did not properly initialize some data structures. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2023-1513)  It was discovered that the NFS implementation in the Linux kernel did not properly handle pending tasks in some situations. A local attacker could use this to cause a denial of service (system crash) or expose sensitive information (kernel memory). (CVE-2023-1652)  It was discovered that a race condition existed in the io_uring subsystem in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1872)  It was discovered that the Android Binder IPC subsystem in the Linux kernel did not properly validate inputs in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-20938)  It was discovered that the ARM64 EFI runtime services implementation in the Linux kernel did not properly manage concurrency calls. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-21102)  It was discovered that a use-after-free vulnerability existed in the iSCSI TCP implementation in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2023-2162)  Lianhui Tang discovered that the MPLS implementation in the Linux kernel did not properly handle certain sysctl allocation failure conditions, leading to a double-free vulnerability. An attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2023-26545)  It was discovered that the NET/ROM protocol implementation in the Linux kernel contained a race condition in some situations, leading to a use- after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-32269)  Duoming Zhou discovered that a race condition existed in the infrared receiver/transceiver driver in the Linux kernel, leading to a use-after- free vulnerability. A privileged attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-1118)",
                "aliases": [
                    "CVE-2022-3707",
                    "CVE-2022-4129",
                    "CVE-2022-4842",
                    "CVE-2022-27672",
                    "CVE-2022-47929",
                    "CVE-2023-0386",
                    "CVE-2023-0394",
                    "CVE-2023-0458",
                    "CVE-2023-0459",
                    "CVE-2023-1073",
                    "CVE-2023-1074",
                    "CVE-2023-1075",
                    "CVE-2023-1078",
                    "CVE-2023-1118",
                    "CVE-2023-1281",
                    "CVE-2023-1513",
                    "CVE-2023-1652",
                    "CVE-2023-1829",
                    "CVE-2023-2162",
                    "CVE-2023-20938",
                    "CVE-2023-21102",
                    "CVE-2023-26545",
                    "CVE-2023-32269"
                ]
            },
            "timestamp": "2023-06-01 23:41:18.242673",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15@5.15.0-1030.35~20.04.1?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.15.0-1030-intel-iotg-dbgsym@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-common@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-common@5.15.0-1030.35~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-common@5.15.0-1030.35~20.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-common@5.15.0-1030.35~20.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-common@5.15.0-1030.35~20.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-common@5.15.0-1030.35~20.04.1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-cloud-tools-common@5.15.0-1030.35~20.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-headers-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-headers-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-headers-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-headers-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-headers-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-headers-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-headers-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-5.15.0-1030@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-common@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-common@5.15.0-1030.35~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-common@5.15.0-1030.35~20.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-common@5.15.0-1030.35~20.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-common@5.15.0-1030.35~20.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-common@5.15.0-1030.35~20.04.1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-common@5.15.0-1030.35~20.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-host@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-host@5.15.0-1030.35~20.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-host@5.15.0-1030.35~20.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-host@5.15.0-1030.35~20.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-host@5.15.0-1030.35~20.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-host@5.15.0-1030.35~20.04.1?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-intel-iotg-5.15-tools-host@5.15.0-1030.35~20.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-iwlwifi-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.15.0-1030-intel-iotg@5.15.0-1030.35~20.04.1?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}