{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5695-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:41.451885",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5695-1",
                "name": "USN-5695-1",
                "description": "It was discovered that the SUNRPC RDMA protocol implementation in the Linux kernel did not properly calculate the header size of a RPC message payload. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-0812)  Moshe Kol, Amit Klein and Yossi Gilad discovered that the IP implementation in the Linux kernel did not provide sufficient randomization when calculating port offsets. An attacker could possibly use this to expose sensitive information. (CVE-2022-1012, CVE-2022-32296)  Duoming Zhou discovered that race conditions existed in the timer handling implementation of the Linux kernel's Rose X.25 protocol layer, resulting in use-after-free vulnerabilities. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-2318)  Roger Pau Monné discovered that the Xen virtual block driver in the Linux kernel did not properly initialize memory pages to be used for shared communication with the backend. A local attacker could use this to expose sensitive information (guest kernel memory). (CVE-2022-26365)  Roger Pau Monné discovered that the Xen paravirtualization frontend in the Linux kernel did not properly initialize memory pages to be used for shared communication with the backend. A local attacker could use this to expose sensitive information (guest kernel memory). (CVE-2022-33740)  It was discovered that the Xen paravirtualization frontend in the Linux kernel incorrectly shared unrelated data when communicating with certain backends. A local attacker could use this to cause a denial of service (guest crash) or expose sensitive information (guest kernel memory). (CVE-2022-33741, CVE-2022-33742)  Oleksandr Tyshchenko discovered that the Xen paravirtualization platform in the Linux kernel on ARM platforms contained a race condition in certain situations. An attacker in a guest VM could use this to cause a denial of service in the host OS. (CVE-2022-33744)",
                "aliases": [
                    "CVE-2022-0812",
                    "CVE-2022-1012",
                    "CVE-2022-2318",
                    "CVE-2022-26365",
                    "CVE-2022-32296",
                    "CVE-2022-33740",
                    "CVE-2022-33741",
                    "CVE-2022-33742",
                    "CVE-2022-33744"
                ]
            },
            "timestamp": "2022-10-21 14:24:16.020197",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp@4.15.0-1137.153~16.04.1?arch=source&distro=esm-infra/xenial"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-4.15.0-1137-gcp@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-headers-4.15.0-1137@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-tools-4.15.0-1137@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.15.0-1137-gcp@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1137-gcp@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-4.15.0-1137-gcp-dbgsym@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-4.15.0-1137-gcp@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-4.15.0-1137-gcp@4.15.0-1137.153~16.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.15.0-1137-gcp@4.15.0-1137.153~16.04.1?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}