{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-3485-3",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:37.583831",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-3485-3",
                "name": "USN-3485-3",
                "description": "It was discovered that a race condition existed in the ALSA subsystem of the Linux kernel when creating and deleting a port via ioctl(). A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-15265)  Eric Biggers discovered that the key management subsystem in the Linux kernel did not properly restrict adding a key that already exists but is uninstantiated. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-15299)  It was discovered that a race condition existed in the packet fanout implementation in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-15649)  Eric Biggers discovered a race condition in the key management subsystem of the Linux kernel around keys in a negative state. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-15951)  Andrey Konovalov discovered a use-after-free vulnerability in the USB serial console driver in the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16525)  Andrey Konovalov discovered that the Ultra Wide Band driver in the Linux kernel did not properly check for an error condition. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16526)  Andrey Konovalov discovered that the ALSA subsystem in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16527)  Andrey Konovalov discovered that the ALSA subsystem in the Linux kernel did not properly validate USB audio buffer descriptors. A physically proximate attacker could use this cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16529)  Andrey Konovalov discovered that the USB unattached storage driver in the Linux kernel contained out-of-bounds error when handling alternative settings. A physically proximate attacker could use to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16530)  Andrey Konovalov discovered that the USB subsystem in the Linux kernel did not properly validate USB interface association descriptors. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16531)  Andrey Konovalov discovered that the USB subsystem in the Linux kernel did not properly validate USB HID descriptors. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16533)  Andrey Konovalov discovered that the USB subsystem in the Linux kernel did not properly validate CDC metadata. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2017-16534)  Andrey Konovalov discovered that the USB subsystem in the Linux kernel did not properly validate USB BOS metadata. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2017-16535)",
                "aliases": [
                    "CVE-2017-15265",
                    "CVE-2017-15299",
                    "CVE-2017-15649",
                    "CVE-2017-15951",
                    "CVE-2017-16525",
                    "CVE-2017-16526",
                    "CVE-2017-16527",
                    "CVE-2017-16529",
                    "CVE-2017-16530",
                    "CVE-2017-16531",
                    "CVE-2017-16533",
                    "CVE-2017-16534",
                    "CVE-2017-16535"
                ]
            },
            "timestamp": "2017-11-21 18:44:13.459079",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-aws@4.4.0-1003.3?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-cloud-tools-4.4.0-1003@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-cloud-tools-4.4.0-1003-dbgsym@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1003@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1003@4.4.0-1003.3?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1003@4.4.0-1003.3?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1003@4.4.0-1003.3?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1003@4.4.0-1003.3?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-headers-4.4.0-1003@4.4.0-1003.3?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-tools-4.4.0-1003@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-aws-tools-4.4.0-1003-dbgsym@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-4.4.0-1003-aws@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-4.4.0-1003-aws@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1003-aws@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-4.4.0-1003-aws-dbgsym@4.4.0-1003.3?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-4.4.0-1003-aws@4.4.0-1003.3?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}