{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5875-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:24.875946",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5875-1",
                "name": "USN-5875-1",
                "description": "It was discovered that the NFSD implementation in the Linux kernel did not properly handle some RPC messages, leading to a buffer overflow. A remote attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-43945)  Tamás Koczka discovered that the Bluetooth L2CAP handshake implementation in the Linux kernel contained multiple use-after-free vulnerabilities. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-42896)  It was discovered that the Broadcom FullMAC USB WiFi driver in the Linux kernel did not properly perform bounds checking in some situations. A physically proximate attacker could use this to craft a malicious USB device that when inserted, could cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3628)  It was discovered that a use-after-free vulnerability existed in the Bluetooth stack in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3640)  It was discovered that the Xen netback driver in the Linux kernel did not properly handle packets structured in certain ways. An attacker in a guest VM could possibly use this to cause a denial of service (host NIC availability). (CVE-2022-3643)  Khalid Masum discovered that the NILFS2 file system implementation in the Linux kernel did not properly handle certain error conditions, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2022-3649)  It was discovered that a race condition existed in the SMSC UFX USB driver implementation in the Linux kernel, leading to a use-after-free vulnerability. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41849)  It was discovered that a race condition existed in the Roccat HID driver in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-41850)  Tamás Koczka discovered that the Bluetooth L2CAP implementation in the Linux kernel did not properly initialize memory in some situations. A physically proximate attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2022-42895)  It was discovered that an integer overflow vulnerability existed in the Bluetooth subsystem in the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2022-45934)  It was discovered that the binder IPC implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2023-20928)",
                "aliases": [
                    "CVE-2022-3628",
                    "CVE-2022-3640",
                    "CVE-2022-3643",
                    "CVE-2022-3649",
                    "CVE-2022-41849",
                    "CVE-2022-41850",
                    "CVE-2022-42895",
                    "CVE-2022-42896",
                    "CVE-2022-43945",
                    "CVE-2022-45934",
                    "CVE-2023-20928"
                ]
            },
            "timestamp": "2023-02-15 21:21:32.860925",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-gke@5.4.0-1094.101?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1094-gke@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1094-gke@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gke-headers-5.4.0-1094@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gke-headers-5.4.0-1094@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gke-tools-5.4.0-1094@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gke-tools-5.4.0-1094@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1094-gke@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1094-gke@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1094-gke@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1094-gke@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1094-gke-dbgsym@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1094-gke-dbgsym@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1094-gke@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1094-gke@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.4.0-1094-gke@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.4.0-1094-gke@5.4.0-1094.101?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1094-gke@5.4.0-1094.101?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1094-gke@5.4.0-1094.101?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}