{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4225-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:39.045273",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4225-1",
                "name": "USN-4225-1",
                "description": "It was discovered that a heap-based buffer overflow existed in the Marvell WiFi-Ex Driver for the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-14895, CVE-2019-14901)  It was discovered that a heap-based buffer overflow existed in the Marvell Libertas WLAN Driver for the Linux kernel. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-14896, CVE-2019-14897)  It was discovered that the Fujitsu ES network device driver for the Linux kernel did not properly check for errors in some situations, leading to a NULL pointer dereference. A local attacker could use this to cause a denial of service. (CVE-2019-16231)  Anthony Steinhauser discovered that the Linux kernel did not properly perform Spectre_RSB mitigations to all processors for PowerPC architecture systems in some situations. A local attacker could use this to expose sensitive information. (CVE-2019-18660)  It was discovered that the Broadcom V3D DRI driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19044)  It was discovered that the Mellanox Technologies Innova driver in the Linux kernel did not properly deallocate memory in certain failure conditions. A local attacker could use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19045)  It was discovered that the Mellanox Technologies ConnectX driver in the Linux kernel did not properly deallocate memory in certain failure conditions. A local attacker could use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19047)  It was discovered that the Intel WiMAX 2400 driver in the Linux kernel did not properly deallocate memory in certain situations. A local attacker could use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19051)  It was discovered that Geschwister Schneider USB CAN interface driver in the Linux kernel did not properly deallocate memory in certain failure conditions. A physically proximate attacker could use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19052)  It was discovered that the netlink-based 802.11 configuration interface in the Linux kernel did not deallocate memory in certain error conditions. A local attacker could possibly use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19055)  It was discovered that the event tracing subsystem of the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to cause a denial of service (kernel memory exhaustion). (CVE-2019-19072)  It was discovered that the driver for memoryless force-feedback input devices in the Linux kernel contained a use-after-free vulnerability. A physically proximate attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2019-19524)  It was discovered that the Microchip CAN BUS Analyzer driver in the Linux kernel contained a use-after-free vulnerability on device disconnect. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-19529)  It was discovered that the PEAK-System Technik USB driver in the Linux kernel did not properly sanitize memory before sending it to the device. A physically proximate attacker could use this to expose sensitive information (kernel memory). (CVE-2019-19534)  Tristan Madani discovered that the ALSA timer implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-19807)  It was discovered that the DesignWare USB3 controller driver in the Linux kernel did not properly deallocate memory in some error conditions. A local attacker could possibly use this to cause a denial of service (memory exhaustion). (CVE-2019-18813)",
                "aliases": [
                    "CVE-2019-14895",
                    "CVE-2019-14896",
                    "CVE-2019-14897",
                    "CVE-2019-14901",
                    "CVE-2019-16231",
                    "CVE-2019-18660",
                    "CVE-2019-18813",
                    "CVE-2019-19044",
                    "CVE-2019-19045",
                    "CVE-2019-19047",
                    "CVE-2019-19051",
                    "CVE-2019-19052",
                    "CVE-2019-19055",
                    "CVE-2019-19072",
                    "CVE-2019-19524",
                    "CVE-2019-19529",
                    "CVE-2019-19534",
                    "CVE-2019-19807"
                ]
            },
            "timestamp": "2020-01-07 01:09:46.615794",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3@5.3.0-1009.10~18.04.1?arch=source&distro=bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-cloud-tools-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-headers-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-headers-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-headers-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-headers-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-headers-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-headers-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-azure-5.3-tools-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.3.0-1009-azure@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-cloud-tools-5.3.0-1009-azure@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.3.0-1009-azure@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.3.0-1009-azure@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.3.0-1009-azure-dbgsym@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.3.0-1009-azure@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.3.0-1009-azure@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.3.0-1009-azure@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-5.3@5.3.0-1010.11~18.04.1?arch=source&distro=bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.3.0-1010-gcp@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-5.3-headers-5.3.0-1010@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-5.3-tools-5.3.0-1010@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.3.0-1010-gcp@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.3.0-1010-gcp@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.3.0-1010-gcp-dbgsym@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.3.0-1010-gcp@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.3.0-1010-gcp@5.3.0-1010.11~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.3.0-1010-gcp@5.3.0-1010.11~18.04.1?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}