{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5381-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:25.440457",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5381-1",
                "name": "USN-5381-1",
                "description": "David Bouman discovered that the netfilter subsystem in the Linux kernel did not properly validate passed user register indices. A local attacker could use this to cause a denial of service or possibly execute arbitrary code. (CVE-2022-1015)  It was discovered that the block layer subsystem in the Linux kernel did not properly initialize memory in some situations. A privileged local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-0494)  It was discovered that the DMA subsystem in the Linux kernel did not properly ensure bounce buffers were completely overwritten by the DMA device. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-0854)  Jann Horn discovered that the FUSE file system in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1011)  David Bouman discovered that the netfilter subsystem in the Linux kernel did not initialize memory in some situations. A local attacker could use this to expose sensitive information (kernel memory). (CVE-2022-1016)  Hu Jiahui discovered that multiple race conditions existed in the Advanced Linux Sound Architecture (ALSA) framework, leading to use-after-free vulnerabilities. A local attacker could use these to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-1048)  It was discovered that the USB Gadget file system interface in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-24958)  It was discovered that the ST21NFCA NFC driver in the Linux kernel did not properly validate the size of certain data in EVT_TRANSACTION events. A physically proximate attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-26490)  It was discovered that the USB SR9700 ethernet device driver for the Linux kernel did not properly validate the length of requests from the device. A physically proximate attacker could possibly use this to expose sensitive information (kernel memory). (CVE-2022-26966)  It was discovered that the Xilinx USB2 device gadget driver in the Linux kernel did not properly validate endpoint indices from the host. A physically proximate attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-27223)  赵子轩 discovered that the 802.2 LLC type 2 driver in the Linux kernel did not properly perform reference counting in some error conditions. A local attacker could use this to cause a denial of service. (CVE-2022-28356)",
                "aliases": [
                    "CVE-2022-0494",
                    "CVE-2022-0854",
                    "CVE-2022-1011",
                    "CVE-2022-1015",
                    "CVE-2022-1016",
                    "CVE-2022-1048",
                    "CVE-2022-24958",
                    "CVE-2022-26490",
                    "CVE-2022-26966",
                    "CVE-2022-27223",
                    "CVE-2022-28356"
                ]
            },
            "timestamp": "2022-04-20 21:09:49.493974",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14@5.14.0-1033.36?arch=src?distro=ubuntu/focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.14.0-1033-oem@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.14.0-1033-oem@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.14.0-1033-oem@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.14.0-1033-oem-dbgsym@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.14.0-1033-oem@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1033@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1033@5.14.0-1033.36?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1033@5.14.0-1033.36?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1033@5.14.0-1033.36?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1033@5.14.0-1033.36?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1033@5.14.0-1033.36?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-headers-5.14.0-1033@5.14.0-1033.36?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-5.14.0-1033@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1033.36?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1033.36?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1033.36?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1033.36?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1033.36?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1033.36?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-oem-5.14-tools-host@5.14.0-1033.36?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.14.0-1033-oem@5.14.0-1033.36?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}