{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-5815-1",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:41.677009",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-5815-1",
                "name": "USN-5815-1",
                "description": "It was discovered that a race condition existed in the Android Binder IPC subsystem in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-20421)  David Leadbeater discovered that the netfilter IRC protocol tracking implementation in the Linux Kernel incorrectly handled certain message payloads in some situations. A remote attacker could possibly use this to cause a denial of service or bypass firewall filtering. (CVE-2022-2663)  It was discovered that the Intel 740 frame buffer driver in the Linux kernel contained a divide by zero vulnerability. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3061)  It was discovered that the sound subsystem in the Linux kernel contained a race condition in some situations. A local attacker could use this to cause a denial of service (system crash). (CVE-2022-3303)  Gwnaun Jung discovered that the SFB packet scheduling implementation in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-3586)  It was discovered that the NILFS2 file system implementation in the Linux kernel did not properly deallocate memory in certain error conditions. An attacker could use this to cause a denial of service (memory exhaustion). (CVE-2022-3646)  Hyunwoo Kim discovered that an integer overflow vulnerability existed in the PXA3xx graphics driver in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2022-39842)  It was discovered that a race condition existed in the EFI capsule loader driver in the Linux kernel, leading to a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-40307)  Zheng Wang and Zhuorao Yang discovered that the RealTek RTL8712U wireless driver in the Linux kernel contained a use-after-free vulnerability. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-4095)  It was discovered that the USB monitoring (usbmon) component in the Linux kernel did not properly set permissions on memory mapped in to user space processes. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2022-43750)  Jann Horn discovered a race condition existed in the Linux kernel when unmapping VMAs in certain situations, resulting in possible use-after-free vulnerabilities. A local attacker could possibly use this to cause a denial of service (system crash) or execute arbitrary code. (CVE-2022-39188)",
                "aliases": [
                    "CVE-2022-2663",
                    "CVE-2022-3061",
                    "CVE-2022-3303",
                    "CVE-2022-3586",
                    "CVE-2022-3646",
                    "CVE-2022-4095",
                    "CVE-2022-20421",
                    "CVE-2022-39188",
                    "CVE-2022-39842",
                    "CVE-2022-40307",
                    "CVE-2022-43750"
                ]
            },
            "timestamp": "2023-01-19 20:07:11.000000",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield@5.4.0-1054.60?arch=source&distro=focal"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1054@5.4.0-1054.60?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1054@5.4.0-1054.60?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1054@5.4.0-1054.60?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1054@5.4.0-1054.60?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1054@5.4.0-1054.60?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1054@5.4.0-1054.60?arch=riscv64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-headers-5.4.0-1054@5.4.0-1054.60?arch=s390x"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-bluefield-tools-5.4.0-1054@5.4.0-1054.60?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.4.0-1054-bluefield@5.4.0-1054.60?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.4.0-1054-bluefield@5.4.0-1054.60?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1054-bluefield@5.4.0-1054.60?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.4.0-1054-bluefield-dbgsym@5.4.0-1054.60?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.4.0-1054-bluefield@5.4.0-1054.60?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.4.0-1054-bluefield@5.4.0-1054.60?arch=arm64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}