{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-2743-3",
        "author": "Canonical Ltd.",
        "timestamp": "2025-01-13T11:52:36.553631",
        "version": 2
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-2743-3",
                "name": "USN-2743-3",
                "description": "USN-2743-1 fixed vulnerabilities in Firefox. Future Firefox updates will require all addons be signed and unity-firefox-extension, webapps-greasemonkey and webaccounts-browser-extension will not go through the signing process. Because these addons currently break search engine installations (LP: #1069793), this update permanently disables the addons by removing them from the system.  We apologize for any inconvenience.  Original advisory details:   Andrew Osmond, Olli Pettay, Andrew Sutherland, Christian Holler, David  Major, Andrew McCreight, Cameron McCormack, Bob Clary and Randell Jesup  discovered multiple memory safety issues in Firefox. If a user were  tricked in to opening a specially crafted website, an attacker could  potentially exploit these to cause a denial of service via application  crash, or execute arbitrary code with the privileges of the user invoking  Firefox. (CVE-2015-4500, CVE-2015-4501)    André Bargull discovered that when a web page creates a scripted proxy  for the window with a handler defined a certain way, a reference to the  inner window will be passed, rather than that of the outer window.  (CVE-2015-4502)    Felix Gröbert discovered an out-of-bounds read in the QCMS color  management library in some circumstances. If a user were tricked in to  opening a specially crafted website, an attacker could potentially exploit  this to cause a denial of service via application crash, or obtain  sensitive information. (CVE-2015-4504)    Khalil Zhani discovered a buffer overflow when parsing VP9 content in some  circumstances. If a user were tricked in to opening a specially crafted  website, an attacker could potentially exploit this to cause a denial of  service via application crash, or execute arbitrary code with the  privileges of the user invoking Firefox. (CVE-2015-4506)    Spandan Veggalam discovered a crash while using the debugger API in some  circumstances. If a user were tricked in to opening a specially crafted  website whilst using the debugger, an attacker could potentially exploit  this to execute arbitrary code with the privileges of the user invoking  Firefox. (CVE-2015-4507)    Juho Nurminen discovered that the URL bar could display the wrong URL in  reader mode in some circumstances. If a user were tricked in to opening a  specially crafted website, an attacker could potentially exploit this to  conduct URL spoofing attacks. (CVE-2015-4508)    A use-after-free was discovered when manipulating HTML media content in  some circumstances. If a user were tricked in to opening a specially  crafted website, an attacker could potentially exploit this to cause a  denial of service via application crash, or execute arbitrary code with  the privileges of the user invoking Firefox. (CVE-2015-4509)    Looben Yang discovered a use-after-free when using a shared worker with  IndexedDB in some circumstances. If a user were tricked in to opening a  specially crafted website, an attacker could potentially exploit this to  cause a denial of service via application crash, or execute arbitrary code  with the privileges of the user invoking Firefox. (CVE-2015-4510)    Francisco Alonso discovered an out-of-bounds read during 2D canvas  rendering in some circumstances. If a user were tricked in to opening a  specially crafted website, an attacker could potentially exploit this to  obtain sensitive information. (CVE-2015-4512)    Jeff Walden discovered that changes could be made to immutable properties  in some circumstances. If a user were tricked in to opening a specially  crafted website, an attacker could potentially exploit this to execute  arbitrary script in a privileged scope. (CVE-2015-4516)    Ronald Crane reported multiple vulnerabilities. If a user were tricked in  to opening a specially crafted website, an attacker could potentially  exploit these to cause a denial of service via application crash, or  execute arbitrary code with the privileges of the user invoking Firefox.  (CVE-2015-4517, CVE-2015-4521, CVE-2015-4522, CVE-2015-7174,  CVE-2015-7175, CVE-2015-7176, CVE-2015-7177, CVE-2015-7180)    Mario Gomes discovered that dragging and dropping an image after a  redirect exposes the redirected URL to scripts. An attacker could  potentially exploit this to obtain sensitive information. (CVE-2015-4519)    Ehsan Akhgari discovered 2 issues with CORS preflight requests. An  attacker could potentially exploit these to bypass CORS restrictions.  (CVE-2015-4520)",
                "aliases": []
            },
            "timestamp": "2015-09-24 16:31:43.271962",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/unity-firefox-extension@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/libufe-xidgetter0@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/libufe-xidgetter0@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/libufe-xidgetter0@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/libufe-xidgetter0@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/libufe-xidgetter0@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/libufe-xidgetter0@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-unity@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-unity@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-unity@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-unity@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-unity@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-unity@3.0.0+14.04.20140416-0ubuntu1.14.04.1?arch=ppc64el"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-browser-extension@0.5-0ubuntu2.14.04.1?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-chromium-extension@0.5-0ubuntu2.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-chromium-extension@0.5-0ubuntu2.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-chromium-extension@0.5-0ubuntu2.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-chromium-extension@0.5-0ubuntu2.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common@0.5-0ubuntu2.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common@0.5-0ubuntu2.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common@0.5-0ubuntu2.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common@0.5-0ubuntu2.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common-dbgsym@0.5-0ubuntu2.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common-dbgsym@0.5-0ubuntu2.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common-dbgsym@0.5-0ubuntu2.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/webaccounts-extension-common-dbgsym@0.5-0ubuntu2.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-webaccounts@0.5-0ubuntu2.14.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-webaccounts@0.5-0ubuntu2.14.04.1?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-webaccounts@0.5-0ubuntu2.14.04.1?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-webaccounts@0.5-0ubuntu2.14.04.1?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/webapps-greasemonkey@2.3.6+13.10.20130920.1-0ubuntu1.2?arch=source&distro=trusty"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-websites-integration@2.3.6+13.10.20130920.1-0ubuntu1.2?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-websites-integration@2.3.6+13.10.20130920.1-0ubuntu1.2?arch=arm64"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-websites-integration@2.3.6+13.10.20130920.1-0ubuntu1.2?arch=armhf"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-websites-integration@2.3.6+13.10.20130920.1-0ubuntu1.2?arch=i386"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-websites-integration@2.3.6+13.10.20130920.1-0ubuntu1.2?arch=powerpc"
                },
                {
                    "@id": "pkg:deb/ubuntu/xul-ext-websites-integration@2.3.6+13.10.20130920.1-0ubuntu1.2?arch=ppc64el"
                }
            ],
            "status": "fixed",
            "status_notes": "This update provides compatible packages for Firefox 41"
        }
    ]
}