{
    "metadata": {
        "@context": "https://openvex.dev/ns/v0.2.0",
        "@id": "https://github.com/canonical/ubuntu-security-notices/blob/main/vex/usn/USN-4208-1",
        "author": "Canonical Ltd.",
        "timestamp": "2024-07-31T20:28:27.050651",
        "version": 1
    },
    "statements": [
        {
            "vulnerability": {
                "@id": "https://ubuntu.com/security/notices/USN-4208-1",
                "name": "USN-4208-1",
                "description": "Jann Horn discovered that the OverlayFS and ShiftFS Drivers in the Linux kernel did not properly handle reference counting during memory mapping operations when used in conjunction with AUFS. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2019-15794)  Nicolas Waisman discovered that the WiFi driver stack in the Linux kernel did not properly validate SSID lengths. A physically proximate attacker could use this to cause a denial of service (system crash). (CVE-2019-17133)  It was discovered that the ARM Komeda display driver for the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2019-18810)  It was discovered that the VirtualBox guest driver implementation in the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2019-19048)  It was discovered that the ADIS16400 IIO IMU Driver for the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2019-19060, CVE-2019-19061)  It was discovered that the Intel OPA Gen1 Infiniband Driver for the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2019-19065)  It was discovered that the AMD Audio Coprocessor driver for the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker with the ability to load modules could use this to cause a denial of service (memory exhaustion). (CVE-2019-19067)  It was discovered in the Qualcomm FastRPC Driver for the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2019-19069)  It was discovered that the Cascoda CA8210 SPI 802.15.4 wireless controller driver for the Linux kernel did not properly deallocate memory in certain error conditions. A local attacker could use this to cause a denial of service (memory exhaustion). (CVE-2019-19075)  It was discovered that the AMD Display Engine Driver in the Linux kernel did not properly deallocate memory in certain error conditions. A local attack could use this to cause a denial of service (memory exhaustion). (CVE-2019-19083)  Nicolas Waisman discovered that the Chelsio T4/T5 RDMA Driver for the Linux kernel performed DMA from a kernel stack. A local attacker could use this to cause a denial of service (system crash). (CVE-2019-17075)",
                "aliases": [
                    "CVE-2019-15794",
                    "CVE-2019-17075",
                    "CVE-2019-17133",
                    "CVE-2019-18810",
                    "CVE-2019-19048",
                    "CVE-2019-19060",
                    "CVE-2019-19061",
                    "CVE-2019-19065",
                    "CVE-2019-19067",
                    "CVE-2019-19069",
                    "CVE-2019-19075",
                    "CVE-2019-19083"
                ]
            },
            "timestamp": "2019-12-03 00:37:37.024869",
            "products": [
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-5.3@5.3.0-1009.10~18.04.1?arch=src?distro=ubuntu/bionic"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-buildinfo-5.3.0-1009-gcp@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-5.3-headers-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-gcp-5.3-tools-5.3.0-1009@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-headers-5.3.0-1009-gcp@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.3.0-1009-gcp@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-image-unsigned-5.3.0-1009-gcp-dbgsym@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-5.3.0-1009-gcp@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-modules-extra-5.3.0-1009-gcp@5.3.0-1009.10~18.04.1?arch=amd64"
                },
                {
                    "@id": "pkg:deb/ubuntu/linux-tools-5.3.0-1009-gcp@5.3.0-1009.10~18.04.1?arch=amd64"
                }
            ],
            "status": "fixed",
            "status_notes": "Several security issues were fixed in the Linux kernel."
        }
    ]
}